[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:13:15
-     auditRecord('consent_changed', { area, value: String(value) });
+     auditRecord("", { area, value: String(value) });

[NoCoverage] ObjectLiteral
src/js/modules/compliance.mjs:13:34
-     auditRecord('consent_changed', { area, value: String(value) });
+     auditRecord('consent_changed', {});

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:22:34
-       if (globalThis.localStorage) {
-         ['cart', CONSENT_KEYS.analytics, 'audit_log'].forEach(k => {
-           try { if (globalThis.localStorage.getItem(k) != null) cleared.push(k); } catch {}
-           try { globalThis.localStorage.removeItem(k); } catch {}
-         });
-       }
+       if (globalThis.localStorage) {}

[NoCoverage] ArrayDeclaration
src/js/modules/compliance.mjs:23:7
-         ['cart', CONSENT_KEYS.analytics, 'audit_log'].forEach(k => {
+         [].forEach(k => {

[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:23:8
-         ['cart', CONSENT_KEYS.analytics, 'audit_log'].forEach(k => {
+         ["", CONSENT_KEYS.analytics, 'audit_log'].forEach(k => {

[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:23:40
-         ['cart', CONSENT_KEYS.analytics, 'audit_log'].forEach(k => {
+         ['cart', CONSENT_KEYS.analytics, ""].forEach(k => {

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:23:66
-         ['cart', CONSENT_KEYS.analytics, 'audit_log'].forEach(k => {
-           try { if (globalThis.localStorage.getItem(k) != null) cleared.push(k); } catch {}
-           try { globalThis.localStorage.removeItem(k); } catch {}
-         });
+         ['cart', CONSENT_KEYS.analytics, 'audit_log'].forEach(k => {});

[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:34:15
-     auditRecord('data_erasure', { cleared, sw: Boolean(swResult) });
+     auditRecord("", { cleared, sw: Boolean(swResult) });

[NoCoverage] ObjectLiteral
src/js/modules/compliance.mjs:34:31
-     auditRecord('data_erasure', { cleared, sw: Boolean(swResult) });
+     auditRecord('data_erasure', {});

[NoCoverage] BlockStatement
src/js/script.mjs:1275:63
-       window.addEventListener('securitypolicyviolation', (e) => {
-           console.warn('CSP violation (logged only):', {
-               blockedURI: e.blockedURI,
-               violatedDirective: e.violatedDirective,
-               sourceFile: e.sourceFile,
-           });
-       });
+       window.addEventListener('securitypolicyviolation', (e) => {});

[Survived] BlockStatement
src/js/script.mjs:608:34
-   const sanitizeHTML = (unsafe) => {
-       const element = document.createElement('div');
-       element.textContent = unsafe;
-       return element.innerHTML;
-   };
+   const sanitizeHTML = (unsafe) => {};
Tests ran:
    fetchProducts uses inline dataset when available
