[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:4:15
-   let enabled = false;
+   let enabled = true;

[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:5:23
-   let consentRequired = true;
+   let consentRequired = false;

[NoCoverage] BlockStatement
src/js/modules/analytics.mjs:8:42
-   export function initAnalytics(opts = {}) {
-     enabled = Boolean(opts.enabled);
-     consentRequired = opts.consentRequired !== false;
-     sampleRate = Number.isFinite(opts.sampleRate) ? Math.max(0, Math.min(1, opts.sampleRate)) : 1.0;
-   }
+   export function initAnalytics(opts = {}) {}

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:10:21
-     consentRequired = opts.consentRequired !== false;
+     consentRequired = true;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:10:21
-     consentRequired = opts.consentRequired !== false;
+     consentRequired = false;

[NoCoverage] EqualityOperator
src/js/modules/analytics.mjs:10:21
-     consentRequired = opts.consentRequired !== false;
+     consentRequired = opts.consentRequired === false;

[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:10:46
-     consentRequired = opts.consentRequired !== false;
+     consentRequired = opts.consentRequired !== true;

[NoCoverage] MethodExpression
src/js/modules/analytics.mjs:11:51
-     sampleRate = Number.isFinite(opts.sampleRate) ? Math.max(0, Math.min(1, opts.sampleRate)) : 1.0;
+     sampleRate = Number.isFinite(opts.sampleRate) ? Math.min(0, Math.min(1, opts.sampleRate)) : 1.0;

[NoCoverage] MethodExpression
src/js/modules/analytics.mjs:11:63
-     sampleRate = Number.isFinite(opts.sampleRate) ? Math.max(0, Math.min(1, opts.sampleRate)) : 1.0;
+     sampleRate = Number.isFinite(opts.sampleRate) ? Math.max(0, Math.max(1, opts.sampleRate)) : 1.0;

[NoCoverage] BlockStatement
src/js/modules/analytics.mjs:14:23
-   function hasConsent() {
-     try {
-       const v = (localStorage && localStorage.getItem('consent_analytics')) || '';
-       return String(v).toLowerCase() === 'granted';
-     } catch { return false; }
-   }
+   function hasConsent() {}

[NoCoverage] BlockStatement
src/js/modules/analytics.mjs:15:7
-     try {
-       const v = (localStorage && localStorage.getItem('consent_analytics')) || '';
-       return String(v).toLowerCase() === 'granted';
-     } catch { return false; }
+     try {} catch { return false; }

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:16:15
-       const v = (localStorage && localStorage.getItem('consent_analytics')) || '';
+       const v = true;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:16:15
-       const v = (localStorage && localStorage.getItem('consent_analytics')) || '';
+       const v = false;

[NoCoverage] LogicalOperator
src/js/modules/analytics.mjs:16:15
-       const v = (localStorage && localStorage.getItem('consent_analytics')) || '';
+       const v = localStorage && localStorage.getItem('consent_analytics') && '';

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:16:16
-       const v = (localStorage && localStorage.getItem('consent_analytics')) || '';
+       const v = (false) || '';

[NoCoverage] LogicalOperator
src/js/modules/analytics.mjs:16:16
-       const v = (localStorage && localStorage.getItem('consent_analytics')) || '';
+       const v = (localStorage || localStorage.getItem('consent_analytics')) || '';

[NoCoverage] StringLiteral
src/js/modules/analytics.mjs:16:53
-       const v = (localStorage && localStorage.getItem('consent_analytics')) || '';
+       const v = (localStorage && localStorage.getItem("")) || '';

[NoCoverage] StringLiteral
src/js/modules/analytics.mjs:16:78
-       const v = (localStorage && localStorage.getItem('consent_analytics')) || '';
+       const v = (localStorage && localStorage.getItem('consent_analytics')) || "Stryker was here!";

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:17:12
-       return String(v).toLowerCase() === 'granted';
+       return true;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:17:12
-       return String(v).toLowerCase() === 'granted';
+       return false;

[NoCoverage] EqualityOperator
src/js/modules/analytics.mjs:17:12
-       return String(v).toLowerCase() === 'granted';
+       return String(v).toLowerCase() !== 'granted';

[NoCoverage] MethodExpression
src/js/modules/analytics.mjs:17:12
-       return String(v).toLowerCase() === 'granted';
+       return String(v).toUpperCase() === 'granted';

[NoCoverage] StringLiteral
src/js/modules/analytics.mjs:17:40
-       return String(v).toLowerCase() === 'granted';
+       return String(v).toLowerCase() === "";

[NoCoverage] BlockStatement
src/js/modules/analytics.mjs:18:11
-     } catch { return false; }
+     } catch {}

[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:18:20
-     } catch { return false; }
+     } catch { return true; }

[NoCoverage] BlockStatement
src/js/modules/analytics.mjs:21:22
-   function sampledIn() {
-     if (sampleRate >= 1) return true;
-     return Math.random() < sampleRate;
-   }
+   function sampledIn() {}

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:22:7
-     if (sampleRate >= 1) return true;
+     if (true) return true;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:22:7
-     if (sampleRate >= 1) return true;
+     if (false) return true;

[NoCoverage] EqualityOperator
src/js/modules/analytics.mjs:22:7
-     if (sampleRate >= 1) return true;
+     if (sampleRate > 1) return true;

[NoCoverage] EqualityOperator
src/js/modules/analytics.mjs:22:7
-     if (sampleRate >= 1) return true;
+     if (sampleRate < 1) return true;

[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:22:31
-     if (sampleRate >= 1) return true;
+     if (sampleRate >= 1) return false;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:23:10
-     return Math.random() < sampleRate;
+     return true;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:23:10
-     return Math.random() < sampleRate;
+     return false;

[NoCoverage] EqualityOperator
src/js/modules/analytics.mjs:23:10
-     return Math.random() < sampleRate;
+     return Math.random() <= sampleRate;

[NoCoverage] EqualityOperator
src/js/modules/analytics.mjs:23:10
-     return Math.random() < sampleRate;
+     return Math.random() >= sampleRate;

[NoCoverage] BlockStatement
src/js/modules/analytics.mjs:26:51
-   export function track(eventName, properties = {}) {
-     if (!enabled) return false;
-     if (consentRequired && !hasConsent()) return false;
-     if (!sampledIn()) return false;
-     const id = createCorrelationId();
-     log('info', 'analytics_event', { id, event: eventName, props: properties });
-     return true;
-   }
+   export function track(eventName, properties = {}) {}

[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:27:7
-     if (!enabled) return false;
+     if (enabled) return false;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:27:7
-     if (!enabled) return false;
+     if (true) return false;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:27:7
-     if (!enabled) return false;
+     if (false) return false;

[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:27:24
-     if (!enabled) return false;
+     if (!enabled) return true;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:28:7
-     if (consentRequired && !hasConsent()) return false;
+     if (true) return false;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:28:7
-     if (consentRequired && !hasConsent()) return false;
+     if (false) return false;

[NoCoverage] LogicalOperator
src/js/modules/analytics.mjs:28:7
-     if (consentRequired && !hasConsent()) return false;
+     if (consentRequired || !hasConsent()) return false;

[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:28:26
-     if (consentRequired && !hasConsent()) return false;
+     if (consentRequired && hasConsent()) return false;

[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:28:48
-     if (consentRequired && !hasConsent()) return false;
+     if (consentRequired && !hasConsent()) return true;

[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:29:7
-     if (!sampledIn()) return false;
+     if (sampledIn()) return false;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:29:7
-     if (!sampledIn()) return false;
+     if (true) return false;

[NoCoverage] ConditionalExpression
src/js/modules/analytics.mjs:29:7
-     if (!sampledIn()) return false;
+     if (false) return false;

[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:29:28
-     if (!sampledIn()) return false;
+     if (!sampledIn()) return true;

[NoCoverage] StringLiteral
src/js/modules/analytics.mjs:31:7
-     log('info', 'analytics_event', { id, event: eventName, props: properties });
+     log("", 'analytics_event', { id, event: eventName, props: properties });

[NoCoverage] StringLiteral
src/js/modules/analytics.mjs:31:15
-     log('info', 'analytics_event', { id, event: eventName, props: properties });
+     log('info', "", { id, event: eventName, props: properties });

[NoCoverage] ObjectLiteral
src/js/modules/analytics.mjs:31:34
-     log('info', 'analytics_event', { id, event: eventName, props: properties });
+     log('info', 'analytics_event', {});

[NoCoverage] BooleanLiteral
src/js/modules/analytics.mjs:32:10
-     return true;
+     return false;

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:12:34
-   function getModuleExport(module) {
-     if (module && typeof module === 'object') {
-       if (module.default) {
-         return module.default;
-       }
-       const keys = Object.keys(module);
-       if (keys.length === 1) {
-         return module[keys[0]];
-       }
-     }
-     return module;
-   }
+   function getModuleExport(module) {}

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:13:7
-     if (module && typeof module === 'object') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:13:7
-     if (module && typeof module === 'object') {
+     if (false) {

[NoCoverage] LogicalOperator
src/js/modules/bootstrap.mjs:13:7
-     if (module && typeof module === 'object') {
+     if (module || typeof module === 'object') {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:13:17
-     if (module && typeof module === 'object') {
+     if (module && true) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:13:17
-     if (module && typeof module === 'object') {
+     if (module && typeof module !== 'object') {

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:13:35
-     if (module && typeof module === 'object') {
+     if (module && typeof module === "") {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:13:45
-     if (module && typeof module === 'object') {
-       if (module.default) {
-         return module.default;
-       }
-       const keys = Object.keys(module);
-       if (keys.length === 1) {
-         return module[keys[0]];
-       }
-     }
+     if (module && typeof module === 'object') {}

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:14:9
-       if (module.default) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:14:9
-       if (module.default) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:14:25
-       if (module.default) {
-         return module.default;
-       }
+       if (module.default) {}

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:18:9
-       if (keys.length === 1) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:18:9
-       if (keys.length === 1) {
+       if (false) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:18:9
-       if (keys.length === 1) {
+       if (keys.length !== 1) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:18:28
-       if (keys.length === 1) {
-         return module[keys[0]];
-       }
+       if (keys.length === 1) {}

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:25:50
-   function getOrCreateInstance(Component, element) {
-     if (!Component || !element) {
-       return null;
-     }
-     if (typeof Component.getOrCreateInstance === 'function') {
-       return Component.getOrCreateInstance(element);
-     }
-     return new Component(element);
-   }
+   function getOrCreateInstance(Component, element) {}

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:26:7
-     if (!Component || !element) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:26:7
-     if (!Component || !element) {
+     if (false) {

[NoCoverage] LogicalOperator
src/js/modules/bootstrap.mjs:26:7
-     if (!Component || !element) {
+     if (!Component && !element) {

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:26:7
-     if (!Component || !element) {
+     if (Component || !element) {

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:26:21
-     if (!Component || !element) {
+     if (!Component || element) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:26:31
-     if (!Component || !element) {
-       return null;
-     }
+     if (!Component || !element) {}

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:29:7
-     if (typeof Component.getOrCreateInstance === 'function') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:29:7
-     if (typeof Component.getOrCreateInstance === 'function') {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:29:7
-     if (typeof Component.getOrCreateInstance === 'function') {
+     if (typeof Component.getOrCreateInstance !== 'function') {

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:29:48
-     if (typeof Component.getOrCreateInstance === 'function') {
+     if (typeof Component.getOrCreateInstance === "") {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:29:60
-     if (typeof Component.getOrCreateInstance === 'function') {
-       return Component.getOrCreateInstance(element);
-     }
+     if (typeof Component.getOrCreateInstance === 'function') {}

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:35:33
-   function resolveElement(target) {
-     if (!target) {
-       return null;
-     }
-     if (typeof target === 'string') {
-       return document.querySelector(target);
-     }
-     return target;
-   }
+   function resolveElement(target) {}

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:36:7
-     if (!target) {
+     if (target) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:36:7
-     if (!target) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:36:7
-     if (!target) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:36:16
-     if (!target) {
-       return null;
-     }
+     if (!target) {}

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:39:7
-     if (typeof target === 'string') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:39:7
-     if (typeof target === 'string') {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:39:7
-     if (typeof target === 'string') {
+     if (typeof target !== 'string') {

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:39:25
-     if (typeof target === 'string') {
+     if (typeof target === "") {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:39:35
-     if (typeof target === 'string') {
-       return document.querySelector(target);
-     }
+     if (typeof target === 'string') {}

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:45:43
-   function loadWithOverride(name, importer) {
-     if (loaderOverrides.has(name)) {
-       return loaderOverrides.get(name)();
-     }
-     return importer();
-   }
+   function loadWithOverride(name, importer) {}

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:46:7
-     if (loaderOverrides.has(name)) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:46:7
-     if (loaderOverrides.has(name)) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:46:34
-     if (loaderOverrides.has(name)) {
-       return loaderOverrides.get(name)();
-     }
+     if (loaderOverrides.has(name)) {}

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:52:31
-   async function loadCollapse() {
-     if (!collapseModulePromise) {
-       collapseModulePromise = loadWithOverride('collapse', () => import('bootstrap/js/dist/collapse'));
-     }
-     const module = await collapseModulePromise;
-     return getModuleExport(module);
-   }
+   async function loadCollapse() {}

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:53:7
-     if (!collapseModulePromise) {
+     if (collapseModulePromise) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:53:7
-     if (!collapseModulePromise) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:53:7
-     if (!collapseModulePromise) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:53:31
-     if (!collapseModulePromise) {
-       collapseModulePromise = loadWithOverride('collapse', () => import('bootstrap/js/dist/collapse'));
-     }
+     if (!collapseModulePromise) {}

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:54:46
-       collapseModulePromise = loadWithOverride('collapse', () => import('bootstrap/js/dist/collapse'));
+       collapseModulePromise = loadWithOverride("", () => import('bootstrap/js/dist/collapse'));

[NoCoverage] ArrowFunction
src/js/modules/bootstrap.mjs:54:58
-       collapseModulePromise = loadWithOverride('collapse', () => import('bootstrap/js/dist/collapse'));
+       collapseModulePromise = loadWithOverride('collapse', () => undefined);

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:54:71
-       collapseModulePromise = loadWithOverride('collapse', () => import('bootstrap/js/dist/collapse'));
+       collapseModulePromise = loadWithOverride('collapse', () => import(""));

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:60:32
-   async function loadOffcanvas() {
-     if (!offcanvasModulePromise) {
-       offcanvasModulePromise = loadWithOverride('offcanvas', () => import('bootstrap/js/dist/offcanvas'));
-     }
-     const module = await offcanvasModulePromise;
-     return getModuleExport(module);
-   }
+   async function loadOffcanvas() {}

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:61:7
-     if (!offcanvasModulePromise) {
+     if (offcanvasModulePromise) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:61:7
-     if (!offcanvasModulePromise) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:61:7
-     if (!offcanvasModulePromise) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:61:32
-     if (!offcanvasModulePromise) {
-       offcanvasModulePromise = loadWithOverride('offcanvas', () => import('bootstrap/js/dist/offcanvas'));
-     }
+     if (!offcanvasModulePromise) {}

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:62:47
-       offcanvasModulePromise = loadWithOverride('offcanvas', () => import('bootstrap/js/dist/offcanvas'));
+       offcanvasModulePromise = loadWithOverride("", () => import('bootstrap/js/dist/offcanvas'));

[NoCoverage] ArrowFunction
src/js/modules/bootstrap.mjs:62:60
-       offcanvasModulePromise = loadWithOverride('offcanvas', () => import('bootstrap/js/dist/offcanvas'));
+       offcanvasModulePromise = loadWithOverride('offcanvas', () => undefined);

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:62:73
-       offcanvasModulePromise = loadWithOverride('offcanvas', () => import('bootstrap/js/dist/offcanvas'));
+       offcanvasModulePromise = loadWithOverride('offcanvas', () => import(""));

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:68:33
-   function setupCollapseToggles() {
-     const toggles = document.querySelectorAll('[data-bs-toggle="collapse"][data-bs-target]');
-     toggles.forEach((toggle) => {
-       toggle.addEventListener('click', (event) => {
-         if (shouldPreventNavigation(toggle)) {
-           event.preventDefault();
-         }
-         if (typeof event.stopImmediatePropagation === 'function') {
-           event.stopImmediatePropagation();
-         }
-         event.stopPropagation();
-         void activateCollapse(toggle, event);
-       });
-     });
-   }
+   function setupCollapseToggles() {}

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:69:45
-     const toggles = document.querySelectorAll('[data-bs-toggle="collapse"][data-bs-target]');
+     const toggles = document.querySelectorAll("");

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:70:31
-     toggles.forEach((toggle) => {
-       toggle.addEventListener('click', (event) => {
-         if (shouldPreventNavigation(toggle)) {
-           event.preventDefault();
-         }
-         if (typeof event.stopImmediatePropagation === 'function') {
-           event.stopImmediatePropagation();
-         }
-         event.stopPropagation();
-         void activateCollapse(toggle, event);
-       });
-     });
+     toggles.forEach((toggle) => {});

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:71:29
-       toggle.addEventListener('click', (event) => {
+       toggle.addEventListener("", (event) => {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:71:49
-       toggle.addEventListener('click', (event) => {
-         if (shouldPreventNavigation(toggle)) {
-           event.preventDefault();
-         }
-         if (typeof event.stopImmediatePropagation === 'function') {
-           event.stopImmediatePropagation();
-         }
-         event.stopPropagation();
-         void activateCollapse(toggle, event);
-       });
+       toggle.addEventListener('click', (event) => {});

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:72:11
-         if (shouldPreventNavigation(toggle)) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:72:11
-         if (shouldPreventNavigation(toggle)) {
+         if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:72:44
-         if (shouldPreventNavigation(toggle)) {
-           event.preventDefault();
-         }
+         if (shouldPreventNavigation(toggle)) {}

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:75:11
-         if (typeof event.stopImmediatePropagation === 'function') {
+         if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:75:11
-         if (typeof event.stopImmediatePropagation === 'function') {
+         if (false) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:75:11
-         if (typeof event.stopImmediatePropagation === 'function') {
+         if (typeof event.stopImmediatePropagation !== 'function') {

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:75:53
-         if (typeof event.stopImmediatePropagation === 'function') {
+         if (typeof event.stopImmediatePropagation === "") {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:75:65
-         if (typeof event.stopImmediatePropagation === 'function') {
-           event.stopImmediatePropagation();
-         }
+         if (typeof event.stopImmediatePropagation === 'function') {}

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:84:48
-   async function activateCollapse(toggle, event) {
-     const targetSelector = toggle?.getAttribute('data-bs-target');
-     if (!targetSelector) {
-       return;
-     }
-     const target = document.querySelector(targetSelector);
-     if (!target) {
-       return;
-     }
-     try {
-       const Collapse = await loadCollapse();
-       if (!Collapse) {
-         throw new Error('Bootstrap Collapse module no disponible');
-       }
-       const instance = getOrCreateInstance(Collapse, target);
-       if (!instance || typeof instance.toggle !== 'function') {
-         throw new Error('Instancia de Collapse inválida');
-       }
-       instance.toggle(event);
-     } catch (error) {
-       console.error('No se pudo inicializar el Collapse de Bootstrap', error);
-       fallbackToggleCollapse(toggle, target);
-     }
-   }
+   async function activateCollapse(toggle, event) {}

[NoCoverage] OptionalChaining
src/js/modules/bootstrap.mjs:85:26
-     const targetSelector = toggle?.getAttribute('data-bs-target');
+     const targetSelector = toggle.getAttribute('data-bs-target');

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:85:47
-     const targetSelector = toggle?.getAttribute('data-bs-target');
+     const targetSelector = toggle?.getAttribute("");

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:86:7
-     if (!targetSelector) {
+     if (targetSelector) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:86:7
-     if (!targetSelector) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:86:7
-     if (!targetSelector) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:86:24
-     if (!targetSelector) {
-       return;
-     }
+     if (!targetSelector) {}

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:90:7
-     if (!target) {
+     if (target) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:90:7
-     if (!target) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:90:7
-     if (!target) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:90:16
-     if (!target) {
-       return;
-     }
+     if (!target) {}

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:93:7
-     try {
-       const Collapse = await loadCollapse();
-       if (!Collapse) {
-         throw new Error('Bootstrap Collapse module no disponible');
-       }
-       const instance = getOrCreateInstance(Collapse, target);
-       if (!instance || typeof instance.toggle !== 'function') {
-         throw new Error('Instancia de Collapse inválida');
-       }
-       instance.toggle(event);
-     } catch (error) {
+     try {} catch (error) {

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:95:9
-       if (!Collapse) {
+       if (Collapse) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:95:9
-       if (!Collapse) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:95:9
-       if (!Collapse) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:95:20
-       if (!Collapse) {
-         throw new Error('Bootstrap Collapse module no disponible');
-       }
+       if (!Collapse) {}

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:96:23
-         throw new Error('Bootstrap Collapse module no disponible');
+         throw new Error("");

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:99:9
-       if (!instance || typeof instance.toggle !== 'function') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:99:9
-       if (!instance || typeof instance.toggle !== 'function') {
+       if (false) {

[NoCoverage] LogicalOperator
src/js/modules/bootstrap.mjs:99:9
-       if (!instance || typeof instance.toggle !== 'function') {
+       if (!instance && typeof instance.toggle !== 'function') {

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:99:9
-       if (!instance || typeof instance.toggle !== 'function') {
+       if (instance || typeof instance.toggle !== 'function') {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:99:22
-       if (!instance || typeof instance.toggle !== 'function') {
+       if (!instance || false) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:99:22
-       if (!instance || typeof instance.toggle !== 'function') {
+       if (!instance || typeof instance.toggle === 'function') {

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:99:49
-       if (!instance || typeof instance.toggle !== 'function') {
+       if (!instance || typeof instance.toggle !== "") {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:99:61
-       if (!instance || typeof instance.toggle !== 'function') {
-         throw new Error('Instancia de Collapse inválida');
-       }
+       if (!instance || typeof instance.toggle !== 'function') {}

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:100:23
-         throw new Error('Instancia de Collapse inválida');
+         throw new Error("");

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:103:19
-     } catch (error) {
-       console.error('No se pudo inicializar el Collapse de Bootstrap', error);
-       fallbackToggleCollapse(toggle, target);
-     }
+     } catch (error) {}

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:104:19
-       console.error('No se pudo inicializar el Collapse de Bootstrap', error);
+       console.error("", error);

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:109:42
-   function shouldPreventNavigation(toggle) {
-     if (!toggle || toggle.tagName !== 'A') {
-       return false;
-     }
-     const href = toggle.getAttribute('href');
-     return !href || href === '#';
-   }
+   function shouldPreventNavigation(toggle) {}
