[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:110:7
-     if (!toggle || toggle.tagName !== 'A') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:110:7
-     if (!toggle || toggle.tagName !== 'A') {
+     if (false) {

[NoCoverage] LogicalOperator
src/js/modules/bootstrap.mjs:110:7
-     if (!toggle || toggle.tagName !== 'A') {
+     if (!toggle && toggle.tagName !== 'A') {

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:110:7
-     if (!toggle || toggle.tagName !== 'A') {
+     if (toggle || toggle.tagName !== 'A') {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:110:18
-     if (!toggle || toggle.tagName !== 'A') {
+     if (!toggle || false) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:110:18
-     if (!toggle || toggle.tagName !== 'A') {
+     if (!toggle || toggle.tagName === 'A') {

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:110:37
-     if (!toggle || toggle.tagName !== 'A') {
+     if (!toggle || toggle.tagName !== "") {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:110:42
-     if (!toggle || toggle.tagName !== 'A') {
-       return false;
-     }
+     if (!toggle || toggle.tagName !== 'A') {}

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:111:12
-       return false;
+       return true;

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:113:36
-     const href = toggle.getAttribute('href');
+     const href = toggle.getAttribute("");

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:114:10
-     return !href || href === '#';
+     return true;

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:114:10
-     return !href || href === '#';
+     return false;

[NoCoverage] LogicalOperator
src/js/modules/bootstrap.mjs:114:10
-     return !href || href === '#';
+     return !href && href === '#';

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:114:10
-     return !href || href === '#';
+     return href || href === '#';

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:114:19
-     return !href || href === '#';
+     return !href || false;

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:114:19
-     return !href || href === '#';
+     return !href || href !== '#';

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:114:28
-     return !href || href === '#';
+     return !href || href === "";

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:117:49
-   function fallbackToggleCollapse(toggle, target) {
-     if (!target) {
-       return;
-     }
-     target.classList.remove('collapsing');
-     target.classList.add('collapse');
-     const willShow = !target.classList.contains('show');
-     target.classList.toggle('show', willShow);
-     if (toggle) {
-       toggle.setAttribute('aria-expanded', willShow ? 'true' : 'false');
-       toggle.classList.toggle('collapsed', !willShow);
-     }
-     target.style.height = '';
-   }
+   function fallbackToggleCollapse(toggle, target) {}

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:118:7
-     if (!target) {
+     if (target) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:118:7
-     if (!target) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:118:7
-     if (!target) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:118:16
-     if (!target) {
-       return;
-     }
+     if (!target) {}

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:121:27
-     target.classList.remove('collapsing');
+     target.classList.remove("");

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:122:24
-     target.classList.add('collapse');
+     target.classList.add("");

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:123:20
-     const willShow = !target.classList.contains('show');
+     const willShow = target.classList.contains('show');

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:123:47
-     const willShow = !target.classList.contains('show');
+     const willShow = !target.classList.contains("");

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:124:27
-     target.classList.toggle('show', willShow);
+     target.classList.toggle("", willShow);

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:125:7
-     if (toggle) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:125:7
-     if (toggle) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:125:15
-     if (toggle) {
-       toggle.setAttribute('aria-expanded', willShow ? 'true' : 'false');
-       toggle.classList.toggle('collapsed', !willShow);
-     }
+     if (toggle) {}

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:126:25
-       toggle.setAttribute('aria-expanded', willShow ? 'true' : 'false');
+       toggle.setAttribute("", willShow ? 'true' : 'false');

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:126:53
-       toggle.setAttribute('aria-expanded', willShow ? 'true' : 'false');
+       toggle.setAttribute('aria-expanded', willShow ? "" : 'false');

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:126:62
-       toggle.setAttribute('aria-expanded', willShow ? 'true' : 'false');
+       toggle.setAttribute('aria-expanded', willShow ? 'true' : "");

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:127:29
-       toggle.classList.toggle('collapsed', !willShow);
+       toggle.classList.toggle("", !willShow);

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:127:42
-       toggle.classList.toggle('collapsed', !willShow);
+       toggle.classList.toggle('collapsed', willShow);

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:129:25
-     target.style.height = '';
+     target.style.height = "Stryker was here!";

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:132:41
-   export function initializeBootstrapUI() {
-     if (bootstrapInitialized) {
-       return;
-     }
-     bootstrapInitialized = true;
-     if (typeof document === 'undefined') {
-       return;
-     }
-     setupCollapseToggles();
-     setupUnifiedMenuController();
-   }
+   export function initializeBootstrapUI() {}

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:133:7
-     if (bootstrapInitialized) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:133:7
-     if (bootstrapInitialized) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:133:29
-     if (bootstrapInitialized) {
-       return;
-     }
+     if (bootstrapInitialized) {}

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:136:26
-     bootstrapInitialized = true;
+     bootstrapInitialized = false;

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:137:7
-     if (typeof document === 'undefined') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:137:7
-     if (typeof document === 'undefined') {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:137:7
-     if (typeof document === 'undefined') {
+     if (typeof document !== 'undefined') {

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:137:27
-     if (typeof document === 'undefined') {
+     if (typeof document === "") {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:137:40
-     if (typeof document === 'undefined') {
-       return;
-     }
+     if (typeof document === 'undefined') {}

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:144:45
-   export async function showOffcanvas(target) {
-     if (typeof document === 'undefined') {
-       throw new Error('Offcanvas no disponible en este entorno');
-     }
-     const element = resolveElement(target);
-     if (!element) {
-       throw new Error('No se encontró el elemento de Offcanvas');
-     }
-     const Offcanvas = await loadOffcanvas();
-     const instance = getOrCreateInstance(Offcanvas, element);
-     if (!instance || typeof instance.show !== 'function') {
-       throw new Error('Instancia de Offcanvas inválida');
-     }
-     instance.show();
-     return instance;
-   }
+   export async function showOffcanvas(target) {}

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:145:7
-     if (typeof document === 'undefined') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:145:7
-     if (typeof document === 'undefined') {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:145:7
-     if (typeof document === 'undefined') {
+     if (typeof document !== 'undefined') {

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:145:27
-     if (typeof document === 'undefined') {
+     if (typeof document === "") {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:145:40
-     if (typeof document === 'undefined') {
-       throw new Error('Offcanvas no disponible en este entorno');
-     }
+     if (typeof document === 'undefined') {}

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:146:21
-       throw new Error('Offcanvas no disponible en este entorno');
+       throw new Error("");

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:149:7
-     if (!element) {
+     if (element) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:149:7
-     if (!element) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:149:7
-     if (!element) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:149:17
-     if (!element) {
-       throw new Error('No se encontró el elemento de Offcanvas');
-     }
+     if (!element) {}

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:150:21
-       throw new Error('No se encontró el elemento de Offcanvas');
+       throw new Error("");

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:154:7
-     if (!instance || typeof instance.show !== 'function') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:154:7
-     if (!instance || typeof instance.show !== 'function') {
+     if (false) {

[NoCoverage] LogicalOperator
src/js/modules/bootstrap.mjs:154:7
-     if (!instance || typeof instance.show !== 'function') {
+     if (!instance && typeof instance.show !== 'function') {

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:154:7
-     if (!instance || typeof instance.show !== 'function') {
+     if (instance || typeof instance.show !== 'function') {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:154:20
-     if (!instance || typeof instance.show !== 'function') {
+     if (!instance || false) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:154:20
-     if (!instance || typeof instance.show !== 'function') {
+     if (!instance || typeof instance.show === 'function') {

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:154:45
-     if (!instance || typeof instance.show !== 'function') {
+     if (!instance || typeof instance.show !== "") {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:154:57
-     if (!instance || typeof instance.show !== 'function') {
-       throw new Error('Instancia de Offcanvas inválida');
-     }
+     if (!instance || typeof instance.show !== 'function') {}

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:155:21
-       throw new Error('Instancia de Offcanvas inválida');
+       throw new Error("");

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:161:60
-   export function __setBootstrapLoaderOverride(name, loader) {
-     loaderOverrides.set(name, loader);
-     if (name === 'collapse') {
-       collapseModulePromise = null;
-     } else if (name === 'offcanvas') {
-       offcanvasModulePromise = null;
-     }
-   }
+   export function __setBootstrapLoaderOverride(name, loader) {}

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:163:7
-     if (name === 'collapse') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:163:7
-     if (name === 'collapse') {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:163:7
-     if (name === 'collapse') {
+     if (name !== 'collapse') {

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:163:16
-     if (name === 'collapse') {
+     if (name === "") {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:163:28
-     if (name === 'collapse') {
-       collapseModulePromise = null;
-     } else if (name === 'offcanvas') {
+     if (name === 'collapse') {} else if (name === 'offcanvas') {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:165:14
-     } else if (name === 'offcanvas') {
+     } else if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/bootstrap.mjs:165:14
-     } else if (name === 'offcanvas') {
+     } else if (false) {

[NoCoverage] EqualityOperator
src/js/modules/bootstrap.mjs:165:14
-     } else if (name === 'offcanvas') {
+     } else if (name !== 'offcanvas') {

[NoCoverage] StringLiteral
src/js/modules/bootstrap.mjs:165:23
-     } else if (name === 'offcanvas') {
+     } else if (name === "") {

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:165:36
-     } else if (name === 'offcanvas') {
-       offcanvasModulePromise = null;
-     }
+     } else if (name === 'offcanvas') {}

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:170:45
-   export function __resetBootstrapTestState() {
-     loaderOverrides.clear();
-     collapseModulePromise = null;
-     offcanvasModulePromise = null;
-     bootstrapInitialized = false;
-     __resetMenuControllerForTest();
-   }
+   export function __resetBootstrapTestState() {}

[NoCoverage] BooleanLiteral
src/js/modules/bootstrap.mjs:174:26
-     bootstrapInitialized = false;
+     bootstrapInitialized = true;

[NoCoverage] BlockStatement
src/js/modules/bootstrap.mjs:178:46
-   export function __getDropdownStateSnapshot() {
-     return __getMenuControllerSnapshot();
-   }
+   export function __getDropdownStateSnapshot() {}

[NoCoverage] ObjectLiteral
src/js/modules/compliance.mjs:3:36
-   const CONSENT_KEYS = Object.freeze({ analytics: 'consent_analytics' });
+   const CONSENT_KEYS = Object.freeze({});

[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:3:49
-   const CONSENT_KEYS = Object.freeze({ analytics: 'consent_analytics' });
+   const CONSENT_KEYS = Object.freeze({ analytics: "" });

[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:5:35
-   export function getConsent(area = 'analytics') {
+   export function getConsent(area = "") {

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:5:48
-   export function getConsent(area = 'analytics') {
-     const key = CONSENT_KEYS[area] || area;
-     try { return globalThis.localStorage?.getItem(key) || null; } catch { return null; }
-   }
+   export function getConsent(area = 'analytics') {}

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:6:15
-     const key = CONSENT_KEYS[area] || area;
+     const key = true;

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:6:15
-     const key = CONSENT_KEYS[area] || area;
+     const key = false;

[NoCoverage] LogicalOperator
src/js/modules/compliance.mjs:6:15
-     const key = CONSENT_KEYS[area] || area;
+     const key = CONSENT_KEYS[area] && area;

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:7:7
-     try { return globalThis.localStorage?.getItem(key) || null; } catch { return null; }
+     try {} catch { return null; }

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:7:16
-     try { return globalThis.localStorage?.getItem(key) || null; } catch { return null; }
+     try { return true; } catch { return null; }

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:7:16
-     try { return globalThis.localStorage?.getItem(key) || null; } catch { return null; }
+     try { return false; } catch { return null; }

[NoCoverage] LogicalOperator
src/js/modules/compliance.mjs:7:16
-     try { return globalThis.localStorage?.getItem(key) || null; } catch { return null; }
+     try { return globalThis.localStorage?.getItem(key) && null; } catch { return null; }

[NoCoverage] OptionalChaining
src/js/modules/compliance.mjs:7:16
-     try { return globalThis.localStorage?.getItem(key) || null; } catch { return null; }
+     try { return globalThis.localStorage.getItem(key) || null; } catch { return null; }

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:7:71
-     try { return globalThis.localStorage?.getItem(key) || null; } catch { return null; }
+     try { return globalThis.localStorage?.getItem(key) || null; } catch {}

[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:10:35
-   export function setConsent(area = 'analytics', value = 'denied') {
+   export function setConsent(area = "", value = 'denied') {

[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:10:56
-   export function setConsent(area = 'analytics', value = 'denied') {
+   export function setConsent(area = 'analytics', value = "") {

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:10:66
-   export function setConsent(area = 'analytics', value = 'denied') {
-     const key = CONSENT_KEYS[area] || area;
-     try { globalThis.localStorage?.setItem(key, String(value)); } catch {}
-     auditRecord('consent_changed', { area, value: String(value) });
-     try { globalThis.dispatchEvent?.(new Event('consentchange')); } catch {}
-     return true;
-   }
+   export function setConsent(area = 'analytics', value = 'denied') {}

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:11:15
-     const key = CONSENT_KEYS[area] || area;
+     const key = true;

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:11:15
-     const key = CONSENT_KEYS[area] || area;
+     const key = false;

[NoCoverage] LogicalOperator
src/js/modules/compliance.mjs:11:15
-     const key = CONSENT_KEYS[area] || area;
+     const key = CONSENT_KEYS[area] && area;

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:12:7
-     try { globalThis.localStorage?.setItem(key, String(value)); } catch {}
+     try {} catch {}

[NoCoverage] OptionalChaining
src/js/modules/compliance.mjs:12:9
-     try { globalThis.localStorage?.setItem(key, String(value)); } catch {}
+     try { globalThis.localStorage.setItem(key, String(value)); } catch {}

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:14:7
-     try { globalThis.dispatchEvent?.(new Event('consentchange')); } catch {}
+     try {} catch {}

[NoCoverage] OptionalChaining
src/js/modules/compliance.mjs:14:9
-     try { globalThis.dispatchEvent?.(new Event('consentchange')); } catch {}
+     try { globalThis.dispatchEvent(new Event('consentchange')); } catch {}

[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:14:46
-     try { globalThis.dispatchEvent?.(new Event('consentchange')); } catch {}
+     try { globalThis.dispatchEvent?.(new Event("")); } catch {}

[NoCoverage] BooleanLiteral
src/js/modules/compliance.mjs:15:10
-     return true;
+     return false;

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:18:52
-   export async function erasePersonalData(opts = {}) {
-     const options = { invalidateCaches: true, ...opts };
-     const cleared = [];
-     try {
-       if (globalThis.localStorage) {
-         ['cart', CONSENT_KEYS.analytics, 'audit_log'].forEach(k => {
-           try { if (globalThis.localStorage.getItem(k) != null) cleared.push(k); } catch {}
-           try { globalThis.localStorage.removeItem(k); } catch {}
-         });
-       }
-     } catch {}
-   
-     let swResult = null;
-     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {
-       swResult = await postToServiceWorker('INVALIDATE_ALL_CACHES').catch(() => null);
-     }
-     auditRecord('data_erasure', { cleared, sw: Boolean(swResult) });
-     return { cleared, sw: swResult };
-   }
+   export async function erasePersonalData(opts = {}) {}

[NoCoverage] ObjectLiteral
src/js/modules/compliance.mjs:19:19
-     const options = { invalidateCaches: true, ...opts };
+     const options = {};

[NoCoverage] BooleanLiteral
src/js/modules/compliance.mjs:19:39
-     const options = { invalidateCaches: true, ...opts };
+     const options = { invalidateCaches: false, ...opts };

[NoCoverage] ArrayDeclaration
src/js/modules/compliance.mjs:20:19
-     const cleared = [];
+     const cleared = ["Stryker was here"];

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:21:7
-     try {
-       if (globalThis.localStorage) {
-         ['cart', CONSENT_KEYS.analytics, 'audit_log'].forEach(k => {
-           try { if (globalThis.localStorage.getItem(k) != null) cleared.push(k); } catch {}
-           try { globalThis.localStorage.removeItem(k); } catch {}
-         });
-       }
-     } catch {}
+     try {} catch {}

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:22:9
-       if (globalThis.localStorage) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:22:9
-       if (globalThis.localStorage) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:24:13
-           try { if (globalThis.localStorage.getItem(k) != null) cleared.push(k); } catch {}
+           try {} catch {}

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:24:19
-           try { if (globalThis.localStorage.getItem(k) != null) cleared.push(k); } catch {}
+           try { if (true) cleared.push(k); } catch {}

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:24:19
-           try { if (globalThis.localStorage.getItem(k) != null) cleared.push(k); } catch {}
+           try { if (false) cleared.push(k); } catch {}

[NoCoverage] EqualityOperator
src/js/modules/compliance.mjs:24:19
-           try { if (globalThis.localStorage.getItem(k) != null) cleared.push(k); } catch {}
+           try { if (globalThis.localStorage.getItem(k) == null) cleared.push(k); } catch {}

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:25:13
-           try { globalThis.localStorage.removeItem(k); } catch {}
+           try {} catch {}

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:31:7
-     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:31:7
-     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {
+     if (false) {

[NoCoverage] LogicalOperator
src/js/modules/compliance.mjs:31:7
-     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {
+     if (options.invalidateCaches && typeof navigator !== 'undefined' || navigator.serviceWorker?.controller) {

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:31:7
-     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {
+     if (true && navigator.serviceWorker?.controller) {

[NoCoverage] LogicalOperator
src/js/modules/compliance.mjs:31:7
-     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {
+     if (options.invalidateCaches || typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:31:35
-     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {
+     if (options.invalidateCaches && true && navigator.serviceWorker?.controller) {

[NoCoverage] EqualityOperator
src/js/modules/compliance.mjs:31:35
-     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {
+     if (options.invalidateCaches && typeof navigator === 'undefined' && navigator.serviceWorker?.controller) {

[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:31:56
-     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {
+     if (options.invalidateCaches && typeof navigator !== "" && navigator.serviceWorker?.controller) {

[NoCoverage] OptionalChaining
src/js/modules/compliance.mjs:31:71
-     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {
+     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker.controller) {

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:31:108
-     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {
-       swResult = await postToServiceWorker('INVALIDATE_ALL_CACHES').catch(() => null);
-     }
+     if (options.invalidateCaches && typeof navigator !== 'undefined' && navigator.serviceWorker?.controller) {}

[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:32:42
-       swResult = await postToServiceWorker('INVALIDATE_ALL_CACHES').catch(() => null);
+       swResult = await postToServiceWorker("").catch(() => null);

[NoCoverage] ArrowFunction
src/js/modules/compliance.mjs:32:73
-       swResult = await postToServiceWorker('INVALIDATE_ALL_CACHES').catch(() => null);
+       swResult = await postToServiceWorker('INVALIDATE_ALL_CACHES').catch(() => undefined);

[NoCoverage] ObjectLiteral
src/js/modules/compliance.mjs:35:10
-     return { cleared, sw: swResult };
+     return {};

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:38:50
-   function postToServiceWorker(type, payload = {}) {
-     return new Promise((resolve, reject) => {
-       try {
-         const msg = { type, ...payload };
-         const channel = new MessageChannel();
-         const timeout = setTimeout(() => reject(new Error('timeout')), 3000);
-         channel.port1.onmessage = (event) => {
-           clearTimeout(timeout);
-           if (event.data && event.data.error) return reject(new Error(event.data.error));
-           resolve(event.data || { ok: true });
-         };
-         navigator.serviceWorker.controller.postMessage(msg, [channel.port2]);
-       } catch (e) { reject(e); }
-     });
-   }
+   function postToServiceWorker(type, payload = {}) {}

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:39:43
-     return new Promise((resolve, reject) => {
-       try {
-         const msg = { type, ...payload };
-         const channel = new MessageChannel();
-         const timeout = setTimeout(() => reject(new Error('timeout')), 3000);
-         channel.port1.onmessage = (event) => {
-           clearTimeout(timeout);
-           if (event.data && event.data.error) return reject(new Error(event.data.error));
-           resolve(event.data || { ok: true });
-         };
-         navigator.serviceWorker.controller.postMessage(msg, [channel.port2]);
-       } catch (e) { reject(e); }
-     });
+     return new Promise((resolve, reject) => {});

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:40:9
-       try {
-         const msg = { type, ...payload };
-         const channel = new MessageChannel();
-         const timeout = setTimeout(() => reject(new Error('timeout')), 3000);
-         channel.port1.onmessage = (event) => {
-           clearTimeout(timeout);
-           if (event.data && event.data.error) return reject(new Error(event.data.error));
-           resolve(event.data || { ok: true });
-         };
-         navigator.serviceWorker.controller.postMessage(msg, [channel.port2]);
-       } catch (e) { reject(e); }
+       try {} catch (e) { reject(e); }

[NoCoverage] ObjectLiteral
src/js/modules/compliance.mjs:41:19
-         const msg = { type, ...payload };
+         const msg = {};

[NoCoverage] ArrowFunction
src/js/modules/compliance.mjs:43:34
-         const timeout = setTimeout(() => reject(new Error('timeout')), 3000);
+         const timeout = setTimeout(() => undefined, 3000);

[NoCoverage] StringLiteral
src/js/modules/compliance.mjs:43:57
-         const timeout = setTimeout(() => reject(new Error('timeout')), 3000);
+         const timeout = setTimeout(() => reject(new Error("")), 3000);

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:44:44
-         channel.port1.onmessage = (event) => {
-           clearTimeout(timeout);
-           if (event.data && event.data.error) return reject(new Error(event.data.error));
-           resolve(event.data || { ok: true });
-         };
+         channel.port1.onmessage = (event) => {};

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:46:13
-           if (event.data && event.data.error) return reject(new Error(event.data.error));
+           if (true) return reject(new Error(event.data.error));

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:46:13
-           if (event.data && event.data.error) return reject(new Error(event.data.error));
+           if (false) return reject(new Error(event.data.error));

[NoCoverage] LogicalOperator
src/js/modules/compliance.mjs:46:13
-           if (event.data && event.data.error) return reject(new Error(event.data.error));
+           if (event.data || event.data.error) return reject(new Error(event.data.error));

[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:47:17
-           resolve(event.data || { ok: true });
+           resolve(true);
