[NoCoverage] ConditionalExpression
src/js/modules/compliance.mjs:47:17
-           resolve(event.data || { ok: true });
+           resolve(false);

[NoCoverage] LogicalOperator
src/js/modules/compliance.mjs:47:17
-           resolve(event.data || { ok: true });
+           resolve(event.data && {
+     ok: true
+   });

[NoCoverage] ObjectLiteral
src/js/modules/compliance.mjs:47:31
-           resolve(event.data || { ok: true });
+           resolve(event.data || {});

[NoCoverage] BooleanLiteral
src/js/modules/compliance.mjs:47:37
-           resolve(event.data || { ok: true });
+           resolve(event.data || { ok: false });

[NoCoverage] ArrayDeclaration
src/js/modules/compliance.mjs:49:59
-         navigator.serviceWorker.controller.postMessage(msg, [channel.port2]);
+         navigator.serviceWorker.controller.postMessage(msg, []);

[NoCoverage] BlockStatement
src/js/modules/compliance.mjs:50:17
-       } catch (e) { reject(e); }
+       } catch (e) {}

[NoCoverage] ArrowFunction
src/js/modules/menu-controller.mjs:7:5
-     : (cb) => setTimeout(cb, 16);
+     : () => undefined;

[NoCoverage] ArrowFunction
src/js/modules/menu-controller.mjs:11:5
-     : (id) => clearTimeout(id);
+     : () => undefined;

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:13:30
-   function composedPath(event) {
-     if (typeof event.composedPath === 'function') {
-       return event.composedPath();
-     }
-     const path = [];
-     let current = event.target;
-     while (current) {
-       path.push(current);
-       current = current.parentNode;
-     }
-     if (typeof window !== 'undefined') {
-       path.push(window);
-     }
-     path.push(document);
-     return path;
-   }
+   function composedPath(event) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:14:7
-     if (typeof event.composedPath === 'function') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:14:7
-     if (typeof event.composedPath === 'function') {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:14:7
-     if (typeof event.composedPath === 'function') {
+     if (typeof event.composedPath !== 'function') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:14:37
-     if (typeof event.composedPath === 'function') {
+     if (typeof event.composedPath === "") {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:14:49
-     if (typeof event.composedPath === 'function') {
-       return event.composedPath();
-     }
+     if (typeof event.composedPath === 'function') {}

[NoCoverage] ArrayDeclaration
src/js/modules/menu-controller.mjs:17:16
-     const path = [];
+     const path = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:19:10
-     while (current) {
+     while (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:19:19
-     while (current) {
-       path.push(current);
-       current = current.parentNode;
-     }
+     while (current) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:23:7
-     if (typeof window !== 'undefined') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:23:7
-     if (typeof window !== 'undefined') {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:23:7
-     if (typeof window !== 'undefined') {
+     if (typeof window === 'undefined') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:23:25
-     if (typeof window !== 'undefined') {
+     if (typeof window !== "") {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:23:38
-     if (typeof window !== 'undefined') {
-       path.push(window);
-     }
+     if (typeof window !== 'undefined') {}

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:30:47
-   function ensureId(baseElement, prefix, index) {
-     if (!baseElement) {
-       return `${prefix}-${index}`;
-     }
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
-       return `id:${baseElement.id}`;
-     }
-     const datasetId = baseElement.dataset?.dropdownId;
-     if (datasetId) {
-       return datasetId;
-     }
-     const generated = `${prefix}:${index}`;
-     if (baseElement.dataset) {
-       baseElement.dataset.dropdownId = generated;
-     }
-     return generated;
-   }
+   function ensureId(baseElement, prefix, index) {}

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:31:7
-     if (!baseElement) {
+     if (baseElement) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:31:7
-     if (!baseElement) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:31:7
-     if (!baseElement) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:31:21
-     if (!baseElement) {
-       return `${prefix}-${index}`;
-     }
+     if (!baseElement) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:32:12
-       return `${prefix}-${index}`;
+       return ``;

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:34:7
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:34:7
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
+     if (false) {

[NoCoverage] LogicalOperator
src/js/modules/menu-controller.mjs:34:7
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
+     if (typeof baseElement.id === 'string' || baseElement.id.trim().length > 0) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:34:7
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
+     if (true && baseElement.id.trim().length > 0) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:34:7
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
+     if (typeof baseElement.id !== 'string' && baseElement.id.trim().length > 0) {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:34:33
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
+     if (typeof baseElement.id === "" && baseElement.id.trim().length > 0) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:34:45
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
+     if (typeof baseElement.id === 'string' && true) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:34:45
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
+     if (typeof baseElement.id === 'string' && baseElement.id.trim().length >= 0) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:34:45
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
+     if (typeof baseElement.id === 'string' && baseElement.id.trim().length <= 0) {

[NoCoverage] MethodExpression
src/js/modules/menu-controller.mjs:34:45
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
+     if (typeof baseElement.id === 'string' && baseElement.id.length > 0) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:34:79
-     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {
-       return `id:${baseElement.id}`;
-     }
+     if (typeof baseElement.id === 'string' && baseElement.id.trim().length > 0) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:35:12
-       return `id:${baseElement.id}`;
+       return ``;

[NoCoverage] OptionalChaining
src/js/modules/menu-controller.mjs:37:21
-     const datasetId = baseElement.dataset?.dropdownId;
+     const datasetId = baseElement.dataset.dropdownId;

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:38:7
-     if (datasetId) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:38:7
-     if (datasetId) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:38:18
-     if (datasetId) {
-       return datasetId;
-     }
+     if (datasetId) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:41:21
-     const generated = `${prefix}:${index}`;
+     const generated = ``;

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:42:7
-     if (baseElement.dataset) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:42:7
-     if (baseElement.dataset) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:42:28
-     if (baseElement.dataset) {
-       baseElement.dataset.dropdownId = generated;
-     }
+     if (baseElement.dataset) {}

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:48:41
-   function setExpanded(entry, isExpanded) {
-     const { toggle, menu, dropdownNode } = entry;
-     toggle.classList.toggle('show', isExpanded);
-     toggle.setAttribute('aria-expanded', isExpanded ? 'true' : 'false');
-     if (menu) {
-       menu.classList.toggle('show', isExpanded);
-     }
-     if (dropdownNode) {
-       dropdownNode.classList.toggle('show', isExpanded);
-     }
-   }
+   function setExpanded(entry, isExpanded) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:50:27
-     toggle.classList.toggle('show', isExpanded);
+     toggle.classList.toggle("", isExpanded);

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:51:23
-     toggle.setAttribute('aria-expanded', isExpanded ? 'true' : 'false');
+     toggle.setAttribute("", isExpanded ? 'true' : 'false');

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:51:53
-     toggle.setAttribute('aria-expanded', isExpanded ? 'true' : 'false');
+     toggle.setAttribute('aria-expanded', isExpanded ? "" : 'false');

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:51:62
-     toggle.setAttribute('aria-expanded', isExpanded ? 'true' : 'false');
+     toggle.setAttribute('aria-expanded', isExpanded ? 'true' : "");

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:52:7
-     if (menu) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:52:7
-     if (menu) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:52:13
-     if (menu) {
-       menu.classList.toggle('show', isExpanded);
-     }
+     if (menu) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:53:27
-       menu.classList.toggle('show', isExpanded);
+       menu.classList.toggle("", isExpanded);

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:55:7
-     if (dropdownNode) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:55:7
-     if (dropdownNode) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:55:21
-     if (dropdownNode) {
-       dropdownNode.classList.toggle('show', isExpanded);
-     }
+     if (dropdownNode) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:56:35
-       dropdownNode.classList.toggle('show', isExpanded);
+       dropdownNode.classList.toggle("", isExpanded);

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:60:26
-   function closeAll(state) {
-     state.expandedId = null;
-     state.toggles.forEach((entry) => {
-       setExpanded(entry, false);
-     });
-   }
+   function closeAll(state) {}

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:62:36
-     state.toggles.forEach((entry) => {
-       setExpanded(entry, false);
-     });
+     state.toggles.forEach((entry) => {});

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:63:24
-       setExpanded(entry, false);
+       setExpanded(entry, true);

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:67:39
-   function ensureOutsideListener(state) {
-     if (state.outsideListenerInstalled) {
-       return;
-     }
-     state.outsideListenerInstalled = true;
-     let listenerAttached = false;
-     const attach = () => {
-       document.addEventListener('pointerdown', state.onPointerDownOutside, true);
-       listenerAttached = true;
-     };
-     state.outsideListenerCleanup = () => {
-       if (state.installTimer !== null) {
-         clearTimeout(state.installTimer);
-         state.installTimer = null;
-       }
-       if (listenerAttached) {
-         document.removeEventListener('pointerdown', state.onPointerDownOutside, true);
-         listenerAttached = false;
-       }
-       state.outsideListenerInstalled = false;
-     };
-     state.installTimer = setTimeout(() => {
-       state.installTimer = null;
-       attach();
-     }, 0);
-   }
+   function ensureOutsideListener(state) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:68:7
-     if (state.outsideListenerInstalled) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:68:7
-     if (state.outsideListenerInstalled) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:68:39
-     if (state.outsideListenerInstalled) {
-       return;
-     }
+     if (state.outsideListenerInstalled) {}

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:71:36
-     state.outsideListenerInstalled = true;
+     state.outsideListenerInstalled = false;

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:72:26
-     let listenerAttached = false;
+     let listenerAttached = true;

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:73:24
-     const attach = () => {
-       document.addEventListener('pointerdown', state.onPointerDownOutside, true);
-       listenerAttached = true;
-     };
+     const attach = () => {};

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:74:31
-       document.addEventListener('pointerdown', state.onPointerDownOutside, true);
+       document.addEventListener("", state.onPointerDownOutside, true);

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:74:74
-       document.addEventListener('pointerdown', state.onPointerDownOutside, true);
+       document.addEventListener('pointerdown', state.onPointerDownOutside, false);

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:75:24
-       listenerAttached = true;
+       listenerAttached = false;

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:77:40
-     state.outsideListenerCleanup = () => {
-       if (state.installTimer !== null) {
-         clearTimeout(state.installTimer);
-         state.installTimer = null;
-       }
-       if (listenerAttached) {
-         document.removeEventListener('pointerdown', state.onPointerDownOutside, true);
-         listenerAttached = false;
-       }
-       state.outsideListenerInstalled = false;
-     };
+     state.outsideListenerCleanup = () => {};

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:78:9
-       if (state.installTimer !== null) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:78:9
-       if (state.installTimer !== null) {
+       if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:78:9
-       if (state.installTimer !== null) {
+       if (state.installTimer === null) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:78:38
-       if (state.installTimer !== null) {
-         clearTimeout(state.installTimer);
-         state.installTimer = null;
-       }
+       if (state.installTimer !== null) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:82:9
-       if (listenerAttached) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:82:9
-       if (listenerAttached) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:82:27
-       if (listenerAttached) {
-         document.removeEventListener('pointerdown', state.onPointerDownOutside, true);
-         listenerAttached = false;
-       }
+       if (listenerAttached) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:83:36
-         document.removeEventListener('pointerdown', state.onPointerDownOutside, true);
+         document.removeEventListener("", state.onPointerDownOutside, true);

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:83:79
-         document.removeEventListener('pointerdown', state.onPointerDownOutside, true);
+         document.removeEventListener('pointerdown', state.onPointerDownOutside, false);

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:84:26
-         listenerAttached = false;
+         listenerAttached = true;

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:86:38
-       state.outsideListenerInstalled = false;
+       state.outsideListenerInstalled = true;

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:88:41
-     state.installTimer = setTimeout(() => {
-       state.installTimer = null;
-       attach();
-     }, 0);
+     state.installTimer = setTimeout(() => {}, 0);

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:95:7
-     if (event.button !== undefined && event.button !== 0) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:95:7
-     if (event.button !== undefined && event.button !== 0) {
+     if (false) {

[NoCoverage] LogicalOperator
src/js/modules/menu-controller.mjs:95:7
-     if (event.button !== undefined && event.button !== 0) {
+     if (event.button !== undefined || event.button !== 0) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:95:7
-     if (event.button !== undefined && event.button !== 0) {
+     if (true && event.button !== 0) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:95:7
-     if (event.button !== undefined && event.button !== 0) {
+     if (event.button === undefined && event.button !== 0) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:95:37
-     if (event.button !== undefined && event.button !== 0) {
+     if (event.button !== undefined && true) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:95:37
-     if (event.button !== undefined && event.button !== 0) {
+     if (event.button !== undefined && event.button === 0) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:95:57
-     if (event.button !== undefined && event.button !== 0) {
-       return;
-     }
+     if (event.button !== undefined && event.button !== 0) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:98:7
-     if (state.preventNavigation && entry.toggle.tagName === 'A') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:98:7
-     if (state.preventNavigation && entry.toggle.tagName === 'A') {
+     if (false) {

[NoCoverage] LogicalOperator
src/js/modules/menu-controller.mjs:98:7
-     if (state.preventNavigation && entry.toggle.tagName === 'A') {
+     if (state.preventNavigation || entry.toggle.tagName === 'A') {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:98:34
-     if (state.preventNavigation && entry.toggle.tagName === 'A') {
+     if (state.preventNavigation && true) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:98:34
-     if (state.preventNavigation && entry.toggle.tagName === 'A') {
+     if (state.preventNavigation && entry.toggle.tagName !== 'A') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:98:59
-     if (state.preventNavigation && entry.toggle.tagName === 'A') {
+     if (state.preventNavigation && entry.toggle.tagName === "") {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:98:64
-     if (state.preventNavigation && entry.toggle.tagName === 'A') {
-       event.preventDefault();
-     }
+     if (state.preventNavigation && entry.toggle.tagName === 'A') {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:102:7
-     if (typeof event.stopImmediatePropagation === 'function') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:102:7
-     if (typeof event.stopImmediatePropagation === 'function') {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:102:7
-     if (typeof event.stopImmediatePropagation === 'function') {
+     if (typeof event.stopImmediatePropagation !== 'function') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:102:49
-     if (typeof event.stopImmediatePropagation === 'function') {
+     if (typeof event.stopImmediatePropagation === "") {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:102:61
-     if (typeof event.stopImmediatePropagation === 'function') {
-       event.stopImmediatePropagation();
-     }
+     if (typeof event.stopImmediatePropagation === 'function') {}

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:106:22
-     state.justOpened = true;
+     state.justOpened = false;

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:107:7
-     if (state.justOpenedFrame !== null) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:107:7
-     if (state.justOpenedFrame !== null) {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:107:7
-     if (state.justOpenedFrame !== null) {
+     if (state.justOpenedFrame === null) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:107:39
-     if (state.justOpenedFrame !== null) {
-       caf(state.justOpenedFrame);
-     }
+     if (state.justOpenedFrame !== null) {}

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:110:37
-     state.justOpenedFrame = raf(() => {
-       state.justOpened = false;
-       state.justOpenedFrame = null;
-     });
+     state.justOpenedFrame = raf(() => {});

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:111:24
-       state.justOpened = false;
+       state.justOpened = true;

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:117:7
-     if (state.expandedId === entry.id) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:117:7
-     if (state.expandedId === entry.id) {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:117:7
-     if (state.expandedId === entry.id) {
+     if (state.expandedId !== entry.id) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:117:38
-     if (state.expandedId === entry.id) {
-       closeAll(state);
-       return;
-     }
+     if (state.expandedId === entry.id) {}

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:123:22
-     setExpanded(entry, true);
+     setExpanded(entry, false);

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:127:51
-   function handleToggleKeyDown(event, state, entry) {
-     const key = event.key;
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
-       event.preventDefault();
-       handleTogglePointerDown(event, state, entry);
-     } else if (key === 'Escape') {
-       closeAll(state);
-       entry.toggle.focus();
-     }
-   }
+   function handleToggleKeyDown(event, state, entry) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:129:7
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:129:7
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (false) {

[NoCoverage] LogicalOperator
src/js/modules/menu-controller.mjs:129:7
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if ((key === 'Enter' || key === ' ') && key === 'Spacebar') {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:129:7
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (false || key === 'Spacebar') {

[NoCoverage] LogicalOperator
src/js/modules/menu-controller.mjs:129:7
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (key === 'Enter' && key === ' ' || key === 'Spacebar') {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:129:7
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (false || key === ' ' || key === 'Spacebar') {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:129:7
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (key !== 'Enter' || key === ' ' || key === 'Spacebar') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:129:15
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (key === "" || key === ' ' || key === 'Spacebar') {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:129:26
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (key === 'Enter' || false || key === 'Spacebar') {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:129:26
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (key === 'Enter' || key !== ' ' || key === 'Spacebar') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:129:34
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (key === 'Enter' || key === "" || key === 'Spacebar') {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:129:41
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (key === 'Enter' || key === ' ' || false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:129:41
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (key === 'Enter' || key === ' ' || key !== 'Spacebar') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:129:49
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
+     if (key === 'Enter' || key === ' ' || key === "") {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:129:61
-     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {
-       event.preventDefault();
-       handleTogglePointerDown(event, state, entry);
-     } else if (key === 'Escape') {
+     if (key === 'Enter' || key === ' ' || key === 'Spacebar') {} else if (key === 'Escape') {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:132:14
-     } else if (key === 'Escape') {
+     } else if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:132:14
-     } else if (key === 'Escape') {
+     } else if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:132:14
-     } else if (key === 'Escape') {
+     } else if (key !== 'Escape') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:132:22
-     } else if (key === 'Escape') {
+     } else if (key === "") {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:132:32
-     } else if (key === 'Escape') {
-       closeAll(state);
-       entry.toggle.focus();
-     }
+     } else if (key === 'Escape') {}

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:138:16
-   function now() {
-     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {
-       return performance.now();
-     }
-     return Date.now();
-   }
+   function now() {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:139:7
-     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:139:7
-     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {
+     if (false) {

[NoCoverage] LogicalOperator
src/js/modules/menu-controller.mjs:139:7
-     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {
+     if (typeof performance !== 'undefined' || typeof performance.now === 'function') {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:139:7
-     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {
+     if (true && typeof performance.now === 'function') {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:139:7
-     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {
+     if (typeof performance === 'undefined' && typeof performance.now === 'function') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:139:30
-     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {
+     if (typeof performance !== "" && typeof performance.now === 'function') {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:139:45
-     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {
+     if (typeof performance !== 'undefined' && true) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:139:45
-     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {
+     if (typeof performance !== 'undefined' && typeof performance.now !== 'function') {
