[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:139:72
-     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {
+     if (typeof performance !== 'undefined' && typeof performance.now === "") {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:139:84
-     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {
-       return performance.now();
-     }
+     if (typeof performance !== 'undefined' && typeof performance.now === 'function') {}

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:145:37
-   function createEntry(toggle, index) {
-     const dropdownNode = toggle.closest('.dropdown');
-     const menu = dropdownNode?.querySelector('.dropdown-menu');
-     const id = ensureId(toggle, 'auto', index);
-     const entry = { toggle, menu, dropdownNode, id, lastPointerTime: 0 };
-     if (menu && !menu.id) {
-       menu.id = `${id}-menu`;
-     }
-     if (menu) {
-       toggle.setAttribute('aria-controls', menu.id);
-     }
-     return entry;
-   }
+   function createEntry(toggle, index) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:146:39
-     const dropdownNode = toggle.closest('.dropdown');
+     const dropdownNode = toggle.closest("");

[NoCoverage] OptionalChaining
src/js/modules/menu-controller.mjs:147:16
-     const menu = dropdownNode?.querySelector('.dropdown-menu');
+     const menu = dropdownNode.querySelector('.dropdown-menu');

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:147:44
-     const menu = dropdownNode?.querySelector('.dropdown-menu');
+     const menu = dropdownNode?.querySelector("");

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:148:31
-     const id = ensureId(toggle, 'auto', index);
+     const id = ensureId(toggle, "", index);

[NoCoverage] ObjectLiteral
src/js/modules/menu-controller.mjs:149:17
-     const entry = { toggle, menu, dropdownNode, id, lastPointerTime: 0 };
+     const entry = {};

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:150:7
-     if (menu && !menu.id) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:150:7
-     if (menu && !menu.id) {
+     if (false) {

[NoCoverage] LogicalOperator
src/js/modules/menu-controller.mjs:150:7
-     if (menu && !menu.id) {
+     if (menu || !menu.id) {

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:150:15
-     if (menu && !menu.id) {
+     if (menu && menu.id) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:150:25
-     if (menu && !menu.id) {
-       menu.id = `${id}-menu`;
-     }
+     if (menu && !menu.id) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:151:15
-       menu.id = `${id}-menu`;
+       menu.id = ``;

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:153:7
-     if (menu) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:153:7
-     if (menu) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:153:13
-     if (menu) {
-       toggle.setAttribute('aria-controls', menu.id);
-     }
+     if (menu) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:154:25
-       toggle.setAttribute('aria-controls', menu.id);
+       toggle.setAttribute("", menu.id);

[NoCoverage] ObjectLiteral
src/js/modules/menu-controller.mjs:160:17
-     const state = {
-       container: nav,
-       toggles: [],
-       expandedId: null,
-       justOpened: false,
-       justOpenedFrame: null,
-       outsideListenerInstalled: false,
-       outsideListenerCleanup: null,
-       installTimer: null,
-       onPointerDownOutside: null,
-       preventNavigation: true,
-     };
+     const state = {};

[NoCoverage] ArrayDeclaration
src/js/modules/menu-controller.mjs:162:14
-       toggles: [],
+       toggles: ["Stryker was here"],

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:164:17
-       justOpened: false,
+       justOpened: true,

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:166:31
-       outsideListenerInstalled: false,
+       outsideListenerInstalled: true,

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:170:24
-       preventNavigation: true,
+       preventNavigation: false,

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:173:43
-     state.onPointerDownOutside = (event) => {
-       if (state.justOpened) {
-         return;
-       }
-       const path = composedPath(event);
-       if (path.includes(state.container)) {
-         return;
-       }
-       closeAll(state);
-     };
+     state.onPointerDownOutside = (event) => {};

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:174:9
-       if (state.justOpened) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:174:9
-       if (state.justOpened) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:174:27
-       if (state.justOpened) {
-         return;
-       }
+       if (state.justOpened) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:178:9
-       if (path.includes(state.container)) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:178:9
-       if (path.includes(state.container)) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:178:41
-       if (path.includes(state.container)) {
-         return;
-       }
+       if (path.includes(state.container)) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:184:51
-     const toggles = Array.from(nav.querySelectorAll('.dropdown-toggle'));
+     const toggles = Array.from(nav.querySelectorAll(""));

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:186:9
-       if (toggle.dataset.menuControllerBound === '1') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:186:9
-       if (toggle.dataset.menuControllerBound === '1') {
+       if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:186:9
-       if (toggle.dataset.menuControllerBound === '1') {
+       if (toggle.dataset.menuControllerBound !== '1') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:186:48
-       if (toggle.dataset.menuControllerBound === '1') {
+       if (toggle.dataset.menuControllerBound === "") {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:186:53
-       if (toggle.dataset.menuControllerBound === '1') {
-         return;
-       }
+       if (toggle.dataset.menuControllerBound === '1') {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:189:42
-       toggle.dataset.menuControllerBound = '1';
+       toggle.dataset.menuControllerBound = "";

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:193:39
-       const pointerHandler = (event) => {
-         entry.lastPointerTime = now();
-         handleTogglePointerDown(event, state, entry);
-       };
+       const pointerHandler = (event) => {};

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:197:37
-       const clickHandler = (event) => {
-         const sincePointer = now() - (entry.lastPointerTime || 0);
-         if (sincePointer < 250) {
-           event.preventDefault();
-           event.stopPropagation();
-           if (typeof event.stopImmediatePropagation === 'function') {
-             event.stopImmediatePropagation();
-           }
-           return;
-         }
-         handleTogglePointerDown(event, state, entry);
-       };
+       const clickHandler = (event) => {};

[NoCoverage] ArithmeticOperator
src/js/modules/menu-controller.mjs:198:28
-         const sincePointer = now() - (entry.lastPointerTime || 0);
+         const sincePointer = now() + (entry.lastPointerTime || 0);

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:198:37
-         const sincePointer = now() - (entry.lastPointerTime || 0);
+         const sincePointer = now() - (true);

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:198:37
-         const sincePointer = now() - (entry.lastPointerTime || 0);
+         const sincePointer = now() - (false);

[NoCoverage] LogicalOperator
src/js/modules/menu-controller.mjs:198:37
-         const sincePointer = now() - (entry.lastPointerTime || 0);
+         const sincePointer = now() - (entry.lastPointerTime && 0);

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:199:11
-         if (sincePointer < 250) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:199:11
-         if (sincePointer < 250) {
+         if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:199:11
-         if (sincePointer < 250) {
+         if (sincePointer <= 250) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:199:11
-         if (sincePointer < 250) {
+         if (sincePointer >= 250) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:199:31
-         if (sincePointer < 250) {
-           event.preventDefault();
-           event.stopPropagation();
-           if (typeof event.stopImmediatePropagation === 'function') {
-             event.stopImmediatePropagation();
-           }
-           return;
-         }
+         if (sincePointer < 250) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:202:13
-           if (typeof event.stopImmediatePropagation === 'function') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:202:13
-           if (typeof event.stopImmediatePropagation === 'function') {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:202:13
-           if (typeof event.stopImmediatePropagation === 'function') {
+           if (typeof event.stopImmediatePropagation !== 'function') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:202:55
-           if (typeof event.stopImmediatePropagation === 'function') {
+           if (typeof event.stopImmediatePropagation === "") {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:202:67
-           if (typeof event.stopImmediatePropagation === 'function') {
-             event.stopImmediatePropagation();
-           }
+           if (typeof event.stopImmediatePropagation === 'function') {}

[NoCoverage] ArrowFunction
src/js/modules/menu-controller.mjs:209:24
-       const keyHandler = (event) => handleToggleKeyDown(event, state, entry);
+       const keyHandler = () => undefined;

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:210:29
-       toggle.addEventListener('pointerdown', pointerHandler);
+       toggle.addEventListener("", pointerHandler);

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:211:29
-       toggle.addEventListener('click', clickHandler);
+       toggle.addEventListener("", clickHandler);

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:212:29
-       toggle.addEventListener('keydown', keyHandler);
+       toggle.addEventListener("", keyHandler);

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:213:27
-       entry.cleanup = () => {
-         toggle.removeEventListener('pointerdown', pointerHandler);
-         toggle.removeEventListener('click', clickHandler);
-         toggle.removeEventListener('keydown', keyHandler);
-         delete toggle.dataset.menuControllerBound;
-       };
+       entry.cleanup = () => {};

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:214:34
-         toggle.removeEventListener('pointerdown', pointerHandler);
+         toggle.removeEventListener("", pointerHandler);

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:215:34
-         toggle.removeEventListener('click', clickHandler);
+         toggle.removeEventListener("", clickHandler);

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:216:34
-         toggle.removeEventListener('keydown', keyHandler);
+         toggle.removeEventListener("", keyHandler);

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:224:7
-     if (state.toggles.length === 0) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:224:7
-     if (state.toggles.length === 0) {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:224:7
-     if (state.toggles.length === 0) {
+     if (state.toggles.length !== 0) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:224:35
-     if (state.toggles.length === 0) {
-       destroyController(state);
-       return null;
-     }
+     if (state.toggles.length === 0) {}

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:231:35
-   function destroyController(state) {
-     if (!state) {
-       return;
-     }
-     state.toggles.forEach((entry) => {
-       setExpanded(entry, false);
-       entry.cleanup?.();
-     });
-     state.toggles = [];
-     closeAll(state);
-     if (state.outsideListenerCleanup) {
-       state.outsideListenerCleanup();
-       state.outsideListenerCleanup = null;
-     }
-     if (state.justOpenedFrame !== null) {
-       caf(state.justOpenedFrame);
-       state.justOpenedFrame = null;
-     }
-     if (state.container) {
-       controllerRegistry.delete(state.container);
-       controllerContainers.delete(state.container);
-     }
-     activeControllers.delete(state);
-   }
+   function destroyController(state) {}

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:232:7
-     if (!state) {
+     if (state) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:232:7
-     if (!state) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:232:7
-     if (!state) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:232:15
-     if (!state) {
-       return;
-     }
+     if (!state) {}

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:235:36
-     state.toggles.forEach((entry) => {
-       setExpanded(entry, false);
-       entry.cleanup?.();
-     });
+     state.toggles.forEach((entry) => {});

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:236:24
-       setExpanded(entry, false);
+       setExpanded(entry, true);

[NoCoverage] OptionalChaining
src/js/modules/menu-controller.mjs:237:5
-       entry.cleanup?.();
+       entry.cleanup();

[NoCoverage] ArrayDeclaration
src/js/modules/menu-controller.mjs:239:19
-     state.toggles = [];
+     state.toggles = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:241:7
-     if (state.outsideListenerCleanup) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:241:7
-     if (state.outsideListenerCleanup) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:241:37
-     if (state.outsideListenerCleanup) {
-       state.outsideListenerCleanup();
-       state.outsideListenerCleanup = null;
-     }
+     if (state.outsideListenerCleanup) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:245:7
-     if (state.justOpenedFrame !== null) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:245:7
-     if (state.justOpenedFrame !== null) {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:245:7
-     if (state.justOpenedFrame !== null) {
+     if (state.justOpenedFrame === null) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:245:39
-     if (state.justOpenedFrame !== null) {
-       caf(state.justOpenedFrame);
-       state.justOpenedFrame = null;
-     }
+     if (state.justOpenedFrame !== null) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:249:7
-     if (state.container) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:249:7
-     if (state.container) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:249:24
-     if (state.container) {
-       controllerRegistry.delete(state.container);
-       controllerContainers.delete(state.container);
-     }
+     if (state.container) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:257:7
-     if (typeof document === 'undefined') {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:257:7
-     if (typeof document === 'undefined') {
+     if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:257:7
-     if (typeof document === 'undefined') {
+     if (typeof document !== 'undefined') {

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:257:27
-     if (typeof document === 'undefined') {
+     if (typeof document === "") {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:257:40
-     if (typeof document === 'undefined') {
-       return;
-     }
+     if (typeof document === 'undefined') {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:261:7
-     if (container) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:261:7
-     if (container) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:261:18
-     if (container) {
-       navContainers = [container];
-     } else {
+     if (container) {} else {

[NoCoverage] ArrayDeclaration
src/js/modules/menu-controller.mjs:262:21
-       navContainers = [container];
+       navContainers = [];

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:263:10
-     } else {
-       const preferred = Array.from(document.querySelectorAll('#navbar-container'));
-       navContainers = preferred.length > 0 ? preferred : Array.from(document.querySelectorAll('.navbar, nav'));
-     }
+     } else {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:264:60
-       const preferred = Array.from(document.querySelectorAll('#navbar-container'));
+       const preferred = Array.from(document.querySelectorAll(""));

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:265:21
-       navContainers = preferred.length > 0 ? preferred : Array.from(document.querySelectorAll('.navbar, nav'));
+       navContainers = true ? preferred : Array.from(document.querySelectorAll('.navbar, nav'));

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:265:21
-       navContainers = preferred.length > 0 ? preferred : Array.from(document.querySelectorAll('.navbar, nav'));
+       navContainers = false ? preferred : Array.from(document.querySelectorAll('.navbar, nav'));

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:265:21
-       navContainers = preferred.length > 0 ? preferred : Array.from(document.querySelectorAll('.navbar, nav'));
+       navContainers = preferred.length >= 0 ? preferred : Array.from(document.querySelectorAll('.navbar, nav'));

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:265:21
-       navContainers = preferred.length > 0 ? preferred : Array.from(document.querySelectorAll('.navbar, nav'));
+       navContainers = preferred.length <= 0 ? preferred : Array.from(document.querySelectorAll('.navbar, nav'));

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:265:93
-       navContainers = preferred.length > 0 ? preferred : Array.from(document.querySelectorAll('.navbar, nav'));
+       navContainers = preferred.length > 0 ? preferred : Array.from(document.querySelectorAll(""));

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:268:34
-     navContainers.forEach((nav) => {
-       if (!(nav instanceof HTMLElement)) {
-         return;
-       }
-       const toggles = nav.querySelectorAll('.dropdown-toggle');
-       if (toggles.length === 0) {
-         return;
-       }
-       const existing = controllerRegistry.get(nav);
-       if (existing) {
-         return;
-       }
-       const controller = createController(nav);
-       if (!controller) {
-         controllerRegistry.delete(nav);
-         controllerContainers.delete(nav);
-       }
-     });
+     navContainers.forEach((nav) => {});

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:269:9
-       if (!(nav instanceof HTMLElement)) {
+       if (nav instanceof HTMLElement) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:269:9
-       if (!(nav instanceof HTMLElement)) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:269:9
-       if (!(nav instanceof HTMLElement)) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:269:40
-       if (!(nav instanceof HTMLElement)) {
-         return;
-       }
+       if (!(nav instanceof HTMLElement)) {}

[NoCoverage] StringLiteral
src/js/modules/menu-controller.mjs:272:42
-       const toggles = nav.querySelectorAll('.dropdown-toggle');
+       const toggles = nav.querySelectorAll("");

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:273:9
-       if (toggles.length === 0) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:273:9
-       if (toggles.length === 0) {
+       if (false) {

[NoCoverage] EqualityOperator
src/js/modules/menu-controller.mjs:273:9
-       if (toggles.length === 0) {
+       if (toggles.length !== 0) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:273:31
-       if (toggles.length === 0) {
-         return;
-       }
+       if (toggles.length === 0) {}

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:277:9
-       if (existing) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:277:9
-       if (existing) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:277:19
-       if (existing) {
-         return;
-       }
+       if (existing) {}

[NoCoverage] BooleanLiteral
src/js/modules/menu-controller.mjs:281:9
-       if (!controller) {
+       if (controller) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:281:9
-       if (!controller) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:281:9
-       if (!controller) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:281:22
-       if (!controller) {
-         controllerRegistry.delete(nav);
-         controllerContainers.delete(nav);
-       }
+       if (!controller) {}

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:288:48
-   export function __resetMenuControllerForTest() {
-     Array.from(controllerContainers).forEach((nav) => {
-       const state = controllerRegistry.get(nav);
-       destroyController(state);
-     });
-     activeControllers.clear();
-   }
+   export function __resetMenuControllerForTest() {}

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:289:53
-     Array.from(controllerContainers).forEach((nav) => {
-       const state = controllerRegistry.get(nav);
-       destroyController(state);
-     });
+     Array.from(controllerContainers).forEach((nav) => {});

[NoCoverage] BlockStatement
src/js/modules/menu-controller.mjs:296:47
-   export function __getMenuControllerSnapshot() {
-     const controllers = Array.from(activeControllers).map((state) => ({
-       containerId: state.container.id || null,
-       expandedId: state.expandedId,
-       toggleCount: state.toggles.length,
-     }));
-     return {
-       controllerCount: controllers.length,
-       controllers,
-     };
-   }
+   export function __getMenuControllerSnapshot() {}

[NoCoverage] ArrowFunction
src/js/modules/menu-controller.mjs:297:57
-     const controllers = Array.from(activeControllers).map((state) => ({
-       containerId: state.container.id || null,
-       expandedId: state.expandedId,
-       toggleCount: state.toggles.length,
-     }));
+     const controllers = Array.from(activeControllers).map(() => undefined);

[NoCoverage] ObjectLiteral
src/js/modules/menu-controller.mjs:297:69
-     const controllers = Array.from(activeControllers).map((state) => ({
-       containerId: state.container.id || null,
-       expandedId: state.expandedId,
-       toggleCount: state.toggles.length,
-     }));
+     const controllers = Array.from(activeControllers).map((state) => ({}));

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:298:18
-       containerId: state.container.id || null,
+       containerId: true,

[NoCoverage] ConditionalExpression
src/js/modules/menu-controller.mjs:298:18
-       containerId: state.container.id || null,
+       containerId: false,

[NoCoverage] LogicalOperator
src/js/modules/menu-controller.mjs:298:18
-       containerId: state.container.id || null,
+       containerId: state.container.id && null,

[NoCoverage] ObjectLiteral
src/js/modules/menu-controller.mjs:302:10
-     return {
-       controllerCount: controllers.length,
-       controllers,
-     };
+     return {};

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:3:100
-   function createNotificationElement(message, primaryButtonText, secondaryButtonText, primaryAction) {
-     const notification = document.createElement('div');
-     notification.className = 'notification-toast';
-     notification.setAttribute('role', 'alert');
-     notification.setAttribute('aria-live', 'polite');
-     notification.innerHTML = `
-           <div class="notification-content">
-               <p>${message}</p>
-               <div class="notification-actions">
-                   <button class="primary-action">${primaryButtonText}</button>
-                   <button class="secondary-action">${secondaryButtonText}</button>
-               </div>
-           </div>
-       `;
-     notification.querySelector('.primary-action').addEventListener('click', () => {
-       try {
-         primaryAction();
-       } catch (err) {
-         console.error('Primary action failed:', err);
-       }
-       notification.remove();
-     });
-     notification.querySelector('.secondary-action').addEventListener('click', () => {
-       notification.remove();
-     });
-     return notification;
-   }
+   function createNotificationElement(message, primaryButtonText, secondaryButtonText, primaryAction) {}

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:4:47
-     const notification = document.createElement('div');
+     const notification = document.createElement("");

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:5:28
-     notification.className = 'notification-toast';
+     notification.className = "";

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:6:29
-     notification.setAttribute('role', 'alert');
+     notification.setAttribute("", 'alert');

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:6:37
-     notification.setAttribute('role', 'alert');
+     notification.setAttribute('role', "");

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:7:29
-     notification.setAttribute('aria-live', 'polite');
+     notification.setAttribute("", 'polite');

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:7:42
-     notification.setAttribute('aria-live', 'polite');
+     notification.setAttribute('aria-live', "");

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:9:28
-     notification.innerHTML = `
-           <div class="notification-content">
-               <p>${message}</p>
-               <div class="notification-actions">
-                   <button class="primary-action">${primaryButtonText}</button>
-                   <button class="secondary-action">${secondaryButtonText}</button>
-               </div>
-           </div>
-       `;
+     notification.innerHTML = ``;

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:19:30
-     notification.querySelector('.primary-action').addEventListener('click', () => {
+     notification.querySelector("").addEventListener('click', () => {

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:19:66
-     notification.querySelector('.primary-action').addEventListener('click', () => {
+     notification.querySelector('.primary-action').addEventListener("", () => {

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:19:81
-     notification.querySelector('.primary-action').addEventListener('click', () => {
-       try {
-         primaryAction();
-       } catch (err) {
-         console.error('Primary action failed:', err);
-       }
-       notification.remove();
-     });
+     notification.querySelector('.primary-action').addEventListener('click', () => {});

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:20:9
-       try {
-         primaryAction();
-       } catch (err) {
+       try {} catch (err) {

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:22:19
-       } catch (err) {
-         console.error('Primary action failed:', err);
-       }
+       } catch (err) {}

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:23:21
-         console.error('Primary action failed:', err);
+         console.error("", err);
