[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:28:30
-     notification.querySelector('.secondary-action').addEventListener('click', () => {
+     notification.querySelector("").addEventListener('click', () => {

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:28:68
-     notification.querySelector('.secondary-action').addEventListener('click', () => {
+     notification.querySelector('.secondary-action').addEventListener("", () => {

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:28:83
-     notification.querySelector('.secondary-action').addEventListener('click', () => {
-       notification.remove();
-     });
+     notification.querySelector('.secondary-action').addEventListener('click', () => {});

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:35:48
-   function showNotification(notificationElement) {
-     const existingNotification = document.querySelector('.notification-toast');
-     if (existingNotification) {
-       existingNotification.remove();
-     }
-     document.body.appendChild(notificationElement);
-     setTimeout(() => {
-       if (document.body.contains(notificationElement)) {
-         notificationElement.remove();
-       }
-     }, 5 * 60 * 1000);
-   }
+   function showNotification(notificationElement) {}

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:36:55
-     const existingNotification = document.querySelector('.notification-toast');
+     const existingNotification = document.querySelector("");

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:37:7
-     if (existingNotification) {
+     if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:37:7
-     if (existingNotification) {
+     if (false) {

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:37:29
-     if (existingNotification) {
-       existingNotification.remove();
-     }
+     if (existingNotification) {}

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:41:20
-     setTimeout(() => {
-       if (document.body.contains(notificationElement)) {
-         notificationElement.remove();
-       }
-     }, 5 * 60 * 1000);
+     setTimeout(() => {}, 5 * 60 * 1000);

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:42:9
-       if (document.body.contains(notificationElement)) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:42:9
-       if (document.body.contains(notificationElement)) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:42:54
-       if (document.body.contains(notificationElement)) {
-         notificationElement.remove();
-       }
+       if (document.body.contains(notificationElement)) {}

[NoCoverage] ArithmeticOperator
src/js/modules/notifications.mjs:45:6
-     }, 5 * 60 * 1000);
+     }, 5 * 60 / 1000);

[NoCoverage] ArithmeticOperator
src/js/modules/notifications.mjs:45:6
-     }, 5 * 60 * 1000);
+     }, 5 / 60 * 1000);

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:48:23
-   function safeReload() {
-     try {
-       if (typeof window === 'undefined') return;
-       const ua = window.navigator && window.navigator.userAgent || '';
-       // Avoid jsdom virtual console noise: jsdom advertises itself in UA
-       if (/jsdom/i.test(ua)) return;
-       const reloadFn = window.location && window.location.reload;
-       if (typeof reloadFn === 'function') {
-         reloadFn.call(window.location);
-       }
-     } catch {}
-   }
+   function safeReload() {}

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:49:7
-     try {
-       if (typeof window === 'undefined') return;
-       const ua = window.navigator && window.navigator.userAgent || '';
-       // Avoid jsdom virtual console noise: jsdom advertises itself in UA
-       if (/jsdom/i.test(ua)) return;
-       const reloadFn = window.location && window.location.reload;
-       if (typeof reloadFn === 'function') {
-         reloadFn.call(window.location);
-       }
-     } catch {}
+     try {} catch {}

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:50:9
-       if (typeof window === 'undefined') return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:50:9
-       if (typeof window === 'undefined') return;
+       if (false) return;

[NoCoverage] EqualityOperator
src/js/modules/notifications.mjs:50:9
-       if (typeof window === 'undefined') return;
+       if (typeof window !== 'undefined') return;

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:50:27
-       if (typeof window === 'undefined') return;
+       if (typeof window === "") return;

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:51:16
-       const ua = window.navigator && window.navigator.userAgent || '';
+       const ua = true;

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:51:16
-       const ua = window.navigator && window.navigator.userAgent || '';
+       const ua = false;

[NoCoverage] LogicalOperator
src/js/modules/notifications.mjs:51:16
-       const ua = window.navigator && window.navigator.userAgent || '';
+       const ua = window.navigator && window.navigator.userAgent && '';

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:51:16
-       const ua = window.navigator && window.navigator.userAgent || '';
+       const ua = false || '';

[NoCoverage] LogicalOperator
src/js/modules/notifications.mjs:51:16
-       const ua = window.navigator && window.navigator.userAgent || '';
+       const ua = window.navigator || window.navigator.userAgent || '';

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:51:66
-       const ua = window.navigator && window.navigator.userAgent || '';
+       const ua = window.navigator && window.navigator.userAgent || "Stryker was here!";

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:53:9
-       if (/jsdom/i.test(ua)) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:53:9
-       if (/jsdom/i.test(ua)) return;
+       if (false) return;

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:54:22
-       const reloadFn = window.location && window.location.reload;
+       const reloadFn = true;

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:54:22
-       const reloadFn = window.location && window.location.reload;
+       const reloadFn = false;

[NoCoverage] LogicalOperator
src/js/modules/notifications.mjs:54:22
-       const reloadFn = window.location && window.location.reload;
+       const reloadFn = window.location || window.location.reload;

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:55:9
-       if (typeof reloadFn === 'function') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:55:9
-       if (typeof reloadFn === 'function') {
+       if (false) {

[NoCoverage] EqualityOperator
src/js/modules/notifications.mjs:55:9
-       if (typeof reloadFn === 'function') {
+       if (typeof reloadFn !== 'function') {

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:55:29
-       if (typeof reloadFn === 'function') {
+       if (typeof reloadFn === "") {

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:55:41
-       if (typeof reloadFn === 'function') {
-         reloadFn.call(window.location);
-       }
+       if (typeof reloadFn === 'function') {}

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:61:65
-   export function showUpdateNotification(serviceWorker, message = 'Una versión está disponible') {
+   export function showUpdateNotification(serviceWorker, message = "") {

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:61:96
-   export function showUpdateNotification(serviceWorker, message = 'Una versión está disponible') {
-     const notification = createNotificationElement(
-       message,
-       'Actualizar ahora',
-       'Después',
-       () => {
-         if (serviceWorker) {
-           serviceWorker.postMessage({ type: 'SKIP_WAITING' });
-         } else {
-           safeReload();
-         }
-       }
-     );
-     showNotification(notification);
-   }
+   export function showUpdateNotification(serviceWorker, message = 'Una versión está disponible') {}

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:64:5
-       'Actualizar ahora',
+       "",

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:65:5
-       'Después',
+       "",

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:66:11
-       () => {
-         if (serviceWorker) {
-           serviceWorker.postMessage({ type: 'SKIP_WAITING' });
-         } else {
-           safeReload();
-         }
-       }
+       () => {}

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:67:11
-         if (serviceWorker) {
+         if (true) {

[NoCoverage] ConditionalExpression
src/js/modules/notifications.mjs:67:11
-         if (serviceWorker) {
+         if (false) {

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:67:26
-         if (serviceWorker) {
-           serviceWorker.postMessage({ type: 'SKIP_WAITING' });
-         } else {
+         if (serviceWorker) {} else {

[NoCoverage] ObjectLiteral
src/js/modules/notifications.mjs:68:35
-           serviceWorker.postMessage({ type: 'SKIP_WAITING' });
+           serviceWorker.postMessage({});

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:68:43
-           serviceWorker.postMessage({ type: 'SKIP_WAITING' });
+           serviceWorker.postMessage({ type: "" });

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:69:14
-         } else {
-           safeReload();
-         }
+         } else {}

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:77:49
-   export function showServiceWorkerError(message) {
-     const notification = createNotificationElement(
-       message,
-       'Reload',
-       'Dismiss',
-       () => safeReload()
-     );
-     showNotification(notification);
-   }
+   export function showServiceWorkerError(message) {}

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:80:5
-       'Reload',
+       "",

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:81:5
-       'Dismiss',
+       "",

[NoCoverage] ArrowFunction
src/js/modules/notifications.mjs:82:5
-       () => safeReload()
+       () => undefined

[NoCoverage] BlockStatement
src/js/modules/notifications.mjs:87:55
-   export function showConnectivityNotification(message) {
-     const notification = createNotificationElement(
-       message,
-       'Retry',
-       'Dismiss',
-       () => safeReload()
-     );
-     showNotification(notification);
-   }
+   export function showConnectivityNotification(message) {}

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:90:5
-       'Retry',
+       "",

[NoCoverage] StringLiteral
src/js/modules/notifications.mjs:91:5
-       'Dismiss',
+       "",

[NoCoverage] ArrowFunction
src/js/modules/notifications.mjs:92:5
-       () => safeReload()
+       () => undefined

[NoCoverage] StringLiteral
src/js/script.mjs:20:37
-   const normaliseAssetPath = (value = '') => {
+   const normaliseAssetPath = (value = "Stryker was here!") => {

[NoCoverage] MethodExpression
src/js/script.mjs:24:21
-       const trimmed = value.startsWith('/') ? value.slice(1) : value;
+       const trimmed = value.endsWith('/') ? value.slice(1) : value;

[NoCoverage] StringLiteral
src/js/script.mjs:24:38
-       const trimmed = value.startsWith('/') ? value.slice(1) : value;
+       const trimmed = value.startsWith("") ? value.slice(1) : value;

[NoCoverage] MethodExpression
src/js/script.mjs:24:45
-       const trimmed = value.startsWith('/') ? value.slice(1) : value;
+       const trimmed = value.startsWith('/') ? value : value;

[NoCoverage] StringLiteral
src/js/script.mjs:25:12
-       return `/${trimmed}`;
+       return ``;

[NoCoverage] ObjectLiteral
src/js/script.mjs:33:30
-       return cfimg(normalised, { ...CFIMG_THUMB, ...extraOpts });
+       return cfimg(normalised, {});

[NoCoverage] ArrowFunction
src/js/script.mjs:42:14
-           .map(width => `${cfimg(normalised, { ...CFIMG_THUMB, width, ...extraOpts })} ${width}w`)
+           .map(() => undefined)

[NoCoverage] StringLiteral
src/js/script.mjs:42:23
-           .map(width => `${cfimg(normalised, { ...CFIMG_THUMB, width, ...extraOpts })} ${width}w`)
+           .map(width => ``)

[NoCoverage] ObjectLiteral
src/js/script.mjs:42:44
-           .map(width => `${cfimg(normalised, { ...CFIMG_THUMB, width, ...extraOpts })} ${width}w`)
+           .map(width => `${cfimg(normalised, {})} ${width}w`)

[NoCoverage] StringLiteral
src/js/script.mjs:43:15
-           .join(', ');
+           .join("");

[NoCoverage] BlockStatement
src/js/script.mjs:48:36
-   const encodeStaticPath = (path) => {
-       if (!path) {
-           return '';
-       }
-       try {
-           return encodeURI(path);
-       } catch (_err) {
-           return path;
-       }
-   };
+   const encodeStaticPath = (path) => {};

[NoCoverage] BooleanLiteral
src/js/script.mjs:49:9
-       if (!path) {
+       if (path) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:49:9
-       if (!path) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:49:9
-       if (!path) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:49:16
-       if (!path) {
-           return '';
-       }
+       if (!path) {}

[NoCoverage] StringLiteral
src/js/script.mjs:50:16
-           return '';
+           return "Stryker was here!";

[NoCoverage] BlockStatement
src/js/script.mjs:52:9
-       try {
-           return encodeURI(path);
-       } catch (_err) {
+       try {} catch (_err) {

[NoCoverage] BlockStatement
src/js/script.mjs:54:20
-       } catch (_err) {
-           return path;
-       }
+       } catch (_err) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:60:9
-       if (!assetPath) {
+       if (assetPath) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:60:9
-       if (!assetPath) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:60:9
-       if (!assetPath) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:60:21
-       if (!assetPath) {
-           return '';
-       }
+       if (!assetPath) {}

[NoCoverage] StringLiteral
src/js/script.mjs:61:16
-           return '';
+           return "Stryker was here!";

[NoCoverage] BlockStatement
src/js/script.mjs:64:58
-       const normaliseDescriptor = (descriptorCandidate) => {
-           if (typeof descriptorCandidate === 'string') {
-               const trimmed = descriptorCandidate.trim();
-               return trimmed ? trimmed : '';
-           }
-           if (typeof descriptorCandidate === 'number' && Number.isFinite(descriptorCandidate)) {
-               return `${descriptorCandidate}w`;
-           }
-           return '';
-       };
+       const normaliseDescriptor = (descriptorCandidate) => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:65:13
-           if (typeof descriptorCandidate === 'string') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:65:13
-           if (typeof descriptorCandidate === 'string') {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:65:13
-           if (typeof descriptorCandidate === 'string') {
+           if (typeof descriptorCandidate !== 'string') {

[NoCoverage] StringLiteral
src/js/script.mjs:65:44
-           if (typeof descriptorCandidate === 'string') {
+           if (typeof descriptorCandidate === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:65:54
-           if (typeof descriptorCandidate === 'string') {
-               const trimmed = descriptorCandidate.trim();
-               return trimmed ? trimmed : '';
-           }
+           if (typeof descriptorCandidate === 'string') {}

[NoCoverage] MethodExpression
src/js/script.mjs:66:29
-               const trimmed = descriptorCandidate.trim();
+               const trimmed = descriptorCandidate;

[NoCoverage] StringLiteral
src/js/script.mjs:67:40
-               return trimmed ? trimmed : '';
+               return trimmed ? trimmed : "Stryker was here!";

[NoCoverage] ConditionalExpression
src/js/script.mjs:69:13
-           if (typeof descriptorCandidate === 'number' && Number.isFinite(descriptorCandidate)) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:69:13
-           if (typeof descriptorCandidate === 'number' && Number.isFinite(descriptorCandidate)) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:69:13
-           if (typeof descriptorCandidate === 'number' && Number.isFinite(descriptorCandidate)) {
+           if (typeof descriptorCandidate === 'number' || Number.isFinite(descriptorCandidate)) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:69:13
-           if (typeof descriptorCandidate === 'number' && Number.isFinite(descriptorCandidate)) {
+           if (true && Number.isFinite(descriptorCandidate)) {

[NoCoverage] EqualityOperator
src/js/script.mjs:69:13
-           if (typeof descriptorCandidate === 'number' && Number.isFinite(descriptorCandidate)) {
+           if (typeof descriptorCandidate !== 'number' && Number.isFinite(descriptorCandidate)) {

[NoCoverage] StringLiteral
src/js/script.mjs:69:44
-           if (typeof descriptorCandidate === 'number' && Number.isFinite(descriptorCandidate)) {
+           if (typeof descriptorCandidate === "" && Number.isFinite(descriptorCandidate)) {

[NoCoverage] BlockStatement
src/js/script.mjs:69:94
-           if (typeof descriptorCandidate === 'number' && Number.isFinite(descriptorCandidate)) {
-               return `${descriptorCandidate}w`;
-           }
+           if (typeof descriptorCandidate === 'number' && Number.isFinite(descriptorCandidate)) {}

[NoCoverage] StringLiteral
src/js/script.mjs:70:20
-               return `${descriptorCandidate}w`;
+               return ``;

[NoCoverage] StringLiteral
src/js/script.mjs:72:16
-           return '';
+           return "Stryker was here!";

[NoCoverage] BlockStatement
src/js/script.mjs:75:35
-       const buildEntry = (entry) => {
-           if (typeof entry === 'string') {
-               const normalised = normaliseAssetPath(entry);
-               return encodeStaticPath(normalised);
-           }
-   
-           if (entry && typeof entry === 'object') {
-               const srcCandidate = entry.src || entry.path || entry.url || '';
-               const src = normaliseAssetPath(srcCandidate);
-               if (!src) {
-                   return '';
-               }
-   
-               const descriptorKey = STATIC_SRC_DESCRIPTOR_KEYS.find(key => key in entry);
-               const descriptor = descriptorKey ? normaliseDescriptor(entry[descriptorKey]) : normaliseDescriptor(entry.width);
-               const encodedSrc = encodeStaticPath(src);
-               return descriptor ? `${encodedSrc} ${descriptor}` : encodedSrc;
-           }
-   
-           return '';
-       };
+       const buildEntry = (entry) => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:76:13
-           if (typeof entry === 'string') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:76:13
-           if (typeof entry === 'string') {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:76:13
-           if (typeof entry === 'string') {
+           if (typeof entry !== 'string') {

[NoCoverage] StringLiteral
src/js/script.mjs:76:30
-           if (typeof entry === 'string') {
+           if (typeof entry === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:76:40
-           if (typeof entry === 'string') {
-               const normalised = normaliseAssetPath(entry);
-               return encodeStaticPath(normalised);
-           }
+           if (typeof entry === 'string') {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:81:13
-           if (entry && typeof entry === 'object') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:81:13
-           if (entry && typeof entry === 'object') {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:81:13
-           if (entry && typeof entry === 'object') {
+           if (entry || typeof entry === 'object') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:81:22
-           if (entry && typeof entry === 'object') {
+           if (entry && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:81:22
-           if (entry && typeof entry === 'object') {
+           if (entry && typeof entry !== 'object') {

[NoCoverage] StringLiteral
src/js/script.mjs:81:39
-           if (entry && typeof entry === 'object') {
+           if (entry && typeof entry === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:81:49
-           if (entry && typeof entry === 'object') {
-               const srcCandidate = entry.src || entry.path || entry.url || '';
-               const src = normaliseAssetPath(srcCandidate);
-               if (!src) {
-                   return '';
-               }
-   
-               const descriptorKey = STATIC_SRC_DESCRIPTOR_KEYS.find(key => key in entry);
-               const descriptor = descriptorKey ? normaliseDescriptor(entry[descriptorKey]) : normaliseDescriptor(entry.width);
-               const encodedSrc = encodeStaticPath(src);
-               return descriptor ? `${encodedSrc} ${descriptor}` : encodedSrc;
-           }
+           if (entry && typeof entry === 'object') {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:82:34
-               const srcCandidate = entry.src || entry.path || entry.url || '';
+               const srcCandidate = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:82:34
-               const srcCandidate = entry.src || entry.path || entry.url || '';
+               const srcCandidate = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:82:34
-               const srcCandidate = entry.src || entry.path || entry.url || '';
+               const srcCandidate = (entry.src || entry.path || entry.url) && '';

[NoCoverage] ConditionalExpression
src/js/script.mjs:82:34
-               const srcCandidate = entry.src || entry.path || entry.url || '';
+               const srcCandidate = false || '';

[NoCoverage] LogicalOperator
src/js/script.mjs:82:34
-               const srcCandidate = entry.src || entry.path || entry.url || '';
+               const srcCandidate = (entry.src || entry.path) && entry.url || '';

[NoCoverage] ConditionalExpression
src/js/script.mjs:82:34
-               const srcCandidate = entry.src || entry.path || entry.url || '';
+               const srcCandidate = false || entry.url || '';

[NoCoverage] LogicalOperator
src/js/script.mjs:82:34
-               const srcCandidate = entry.src || entry.path || entry.url || '';
+               const srcCandidate = entry.src && entry.path || entry.url || '';

[NoCoverage] StringLiteral
src/js/script.mjs:82:74
-               const srcCandidate = entry.src || entry.path || entry.url || '';
+               const srcCandidate = entry.src || entry.path || entry.url || "Stryker was here!";

[NoCoverage] BooleanLiteral
src/js/script.mjs:84:17
-               if (!src) {
+               if (src) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:84:17
-               if (!src) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:84:17
-               if (!src) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:84:23
-               if (!src) {
-                   return '';
-               }
+               if (!src) {}

[NoCoverage] StringLiteral
src/js/script.mjs:85:24
-                   return '';
+                   return "Stryker was here!";

[NoCoverage] ArrowFunction
src/js/script.mjs:88:67
-               const descriptorKey = STATIC_SRC_DESCRIPTOR_KEYS.find(key => key in entry);
+               const descriptorKey = STATIC_SRC_DESCRIPTOR_KEYS.find(() => undefined);

[NoCoverage] StringLiteral
src/js/script.mjs:91:33
-               return descriptor ? `${encodedSrc} ${descriptor}` : encodedSrc;
+               return descriptor ? `` : encodedSrc;

[NoCoverage] StringLiteral
src/js/script.mjs:94:16
-           return '';
+           return "Stryker was here!";

[NoCoverage] ConditionalExpression
src/js/script.mjs:97:9
-       if (Array.isArray(assetPath)) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:97:9
-       if (Array.isArray(assetPath)) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:97:35
-       if (Array.isArray(assetPath)) {
-           return assetPath
-               .map(buildEntry)
-               .filter(Boolean)
-               .join(', ');
-       }
+       if (Array.isArray(assetPath)) {}

[NoCoverage] MethodExpression
src/js/script.mjs:98:16
-           return assetPath
-               .map(buildEntry)
-               .filter(Boolean)
+           return assetPath.map(buildEntry)

[NoCoverage] StringLiteral
src/js/script.mjs:101:19
-               .join(', ');
+               .join("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:104:9
-       if (assetPath && typeof assetPath === 'object') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:104:9
-       if (assetPath && typeof assetPath === 'object') {
+       if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:104:9
-       if (assetPath && typeof assetPath === 'object') {
+       if (assetPath || typeof assetPath === 'object') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:104:22
-       if (assetPath && typeof assetPath === 'object') {
+       if (assetPath && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:104:22
-       if (assetPath && typeof assetPath === 'object') {
+       if (assetPath && typeof assetPath !== 'object') {

[NoCoverage] StringLiteral
src/js/script.mjs:104:43
-       if (assetPath && typeof assetPath === 'object') {
+       if (assetPath && typeof assetPath === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:104:53
-       if (assetPath && typeof assetPath === 'object') {
-           if (typeof assetPath.srcset === 'string') {
-               const trimmed = assetPath.srcset.trim();
-               if (trimmed) {
-                   return trimmed;
-               }
-           }
-   
-           if (Array.isArray(assetPath.variants)) {
-               return assetPath.variants
-                   .map(buildEntry)
-                   .filter(Boolean)
-                   .join(', ');
-           }
-   
-           return buildEntry(assetPath);
-       }
+       if (assetPath && typeof assetPath === 'object') {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:105:13
-           if (typeof assetPath.srcset === 'string') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:105:13
-           if (typeof assetPath.srcset === 'string') {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:105:13
-           if (typeof assetPath.srcset === 'string') {
+           if (typeof assetPath.srcset !== 'string') {

[NoCoverage] StringLiteral
src/js/script.mjs:105:41
-           if (typeof assetPath.srcset === 'string') {
+           if (typeof assetPath.srcset === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:105:51
-           if (typeof assetPath.srcset === 'string') {
-               const trimmed = assetPath.srcset.trim();
-               if (trimmed) {
-                   return trimmed;
-               }
-           }
+           if (typeof assetPath.srcset === 'string') {}

[NoCoverage] MethodExpression
src/js/script.mjs:106:29
-               const trimmed = assetPath.srcset.trim();
+               const trimmed = assetPath.srcset;

[NoCoverage] ConditionalExpression
src/js/script.mjs:107:17
-               if (trimmed) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:107:17
-               if (trimmed) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:107:26
-               if (trimmed) {
-                   return trimmed;
-               }
+               if (trimmed) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:112:13
-           if (Array.isArray(assetPath.variants)) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:112:13
-           if (Array.isArray(assetPath.variants)) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:112:48
-           if (Array.isArray(assetPath.variants)) {
-               return assetPath.variants
-                   .map(buildEntry)
-                   .filter(Boolean)
-                   .join(', ');
-           }
+           if (Array.isArray(assetPath.variants)) {}

[NoCoverage] MethodExpression
src/js/script.mjs:113:20
-               return assetPath.variants
-                   .map(buildEntry)
-                   .filter(Boolean)
+               return assetPath.variants.map(buildEntry)

[NoCoverage] StringLiteral
src/js/script.mjs:116:23
-                   .join(', ');
+                   .join("");
