[NoCoverage] BlockStatement
src/js/script.mjs:126:36
-   const isAvifAsset = (assetPath) => {
-       if (typeof assetPath !== 'string') {
-           return false;
-       }
-       const trimmed = assetPath.trim();
-       if (!trimmed) {
-           return false;
-       }
-       return /\.avif(?:[?#].*)?$/i.test(trimmed);
-   };
+   const isAvifAsset = (assetPath) => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:127:9
-       if (typeof assetPath !== 'string') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:127:9
-       if (typeof assetPath !== 'string') {
+       if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:127:9
-       if (typeof assetPath !== 'string') {
+       if (typeof assetPath === 'string') {

[NoCoverage] StringLiteral
src/js/script.mjs:127:30
-       if (typeof assetPath !== 'string') {
+       if (typeof assetPath !== "") {

[NoCoverage] BlockStatement
src/js/script.mjs:127:40
-       if (typeof assetPath !== 'string') {
-           return false;
-       }
+       if (typeof assetPath !== 'string') {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:128:16
-           return false;
+           return true;

[NoCoverage] MethodExpression
src/js/script.mjs:130:21
-       const trimmed = assetPath.trim();
+       const trimmed = assetPath;

[NoCoverage] BooleanLiteral
src/js/script.mjs:131:9
-       if (!trimmed) {
+       if (trimmed) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:131:9
-       if (!trimmed) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:131:9
-       if (!trimmed) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:131:19
-       if (!trimmed) {
-           return false;
-       }
+       if (!trimmed) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:132:16
-           return false;
+           return true;

[NoCoverage] Regex
src/js/script.mjs:134:12
-       return /\.avif(?:[?#].*)?$/i.test(trimmed);
+       return /\.avif(?:[?#].*)?/i.test(trimmed);

[NoCoverage] Regex
src/js/script.mjs:134:12
-       return /\.avif(?:[?#].*)?$/i.test(trimmed);
+       return /\.avif(?:[?#].*)$/i.test(trimmed);

[NoCoverage] Regex
src/js/script.mjs:134:12
-       return /\.avif(?:[?#].*)?$/i.test(trimmed);
+       return /\.avif(?:[^?#].*)?$/i.test(trimmed);

[NoCoverage] Regex
src/js/script.mjs:134:12
-       return /\.avif(?:[?#].*)?$/i.test(trimmed);
+       return /\.avif(?:[?#].)?$/i.test(trimmed);

[NoCoverage] ConditionalExpression
src/js/script.mjs:142:9
-       if (Array.isArray(assetPath)) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:142:9
-       if (Array.isArray(assetPath)) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:142:35
-       if (Array.isArray(assetPath)) {
-           const staticSrcset = buildStaticSrcset(assetPath);
-           if (staticSrcset && /\.avif/i.test(staticSrcset)) {
-               return staticSrcset;
-           }
-       }
+       if (Array.isArray(assetPath)) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:144:13
-           if (staticSrcset && /\.avif/i.test(staticSrcset)) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:144:13
-           if (staticSrcset && /\.avif/i.test(staticSrcset)) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:144:13
-           if (staticSrcset && /\.avif/i.test(staticSrcset)) {
+           if (staticSrcset || /\.avif/i.test(staticSrcset)) {

[NoCoverage] BlockStatement
src/js/script.mjs:144:59
-           if (staticSrcset && /\.avif/i.test(staticSrcset)) {
-               return staticSrcset;
-           }
+           if (staticSrcset && /\.avif/i.test(staticSrcset)) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:149:9
-       if (assetPath && typeof assetPath === 'object' && !Array.isArray(assetPath)) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:149:9
-       if (assetPath && typeof assetPath === 'object' && !Array.isArray(assetPath)) {
+       if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:149:9
-       if (assetPath && typeof assetPath === 'object' && !Array.isArray(assetPath)) {
+       if (assetPath && typeof assetPath === 'object' || !Array.isArray(assetPath)) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:149:9
-       if (assetPath && typeof assetPath === 'object' && !Array.isArray(assetPath)) {
+       if (true && !Array.isArray(assetPath)) {

[NoCoverage] LogicalOperator
src/js/script.mjs:149:9
-       if (assetPath && typeof assetPath === 'object' && !Array.isArray(assetPath)) {
+       if (assetPath || typeof assetPath === 'object' && !Array.isArray(assetPath)) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:149:22
-       if (assetPath && typeof assetPath === 'object' && !Array.isArray(assetPath)) {
+       if (assetPath && true && !Array.isArray(assetPath)) {

[NoCoverage] EqualityOperator
src/js/script.mjs:149:22
-       if (assetPath && typeof assetPath === 'object' && !Array.isArray(assetPath)) {
+       if (assetPath && typeof assetPath !== 'object' && !Array.isArray(assetPath)) {

[NoCoverage] StringLiteral
src/js/script.mjs:149:43
-       if (assetPath && typeof assetPath === 'object' && !Array.isArray(assetPath)) {
+       if (assetPath && typeof assetPath === "" && !Array.isArray(assetPath)) {

[NoCoverage] BooleanLiteral
src/js/script.mjs:149:55
-       if (assetPath && typeof assetPath === 'object' && !Array.isArray(assetPath)) {
+       if (assetPath && typeof assetPath === 'object' && Array.isArray(assetPath)) {

[NoCoverage] BlockStatement
src/js/script.mjs:149:82
-       if (assetPath && typeof assetPath === 'object' && !Array.isArray(assetPath)) {
-           const srcsetFromObject = buildStaticSrcset(assetPath);
-           if (srcsetFromObject && /\.avif/i.test(srcsetFromObject)) {
-               return srcsetFromObject;
-           }
-   
-           const srcCandidate = assetPath.src || assetPath.path || assetPath.url || '';
-           if (isAvifAsset(srcCandidate)) {
-               return buildStaticSrcset(srcCandidate);
-           }
-       }
+       if (assetPath && typeof assetPath === 'object' && !Array.isArray(assetPath)) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:151:13
-           if (srcsetFromObject && /\.avif/i.test(srcsetFromObject)) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:151:13
-           if (srcsetFromObject && /\.avif/i.test(srcsetFromObject)) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:151:13
-           if (srcsetFromObject && /\.avif/i.test(srcsetFromObject)) {
+           if (srcsetFromObject || /\.avif/i.test(srcsetFromObject)) {

[NoCoverage] BlockStatement
src/js/script.mjs:151:67
-           if (srcsetFromObject && /\.avif/i.test(srcsetFromObject)) {
-               return srcsetFromObject;
-           }
+           if (srcsetFromObject && /\.avif/i.test(srcsetFromObject)) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:155:30
-           const srcCandidate = assetPath.src || assetPath.path || assetPath.url || '';
+           const srcCandidate = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:155:30
-           const srcCandidate = assetPath.src || assetPath.path || assetPath.url || '';
+           const srcCandidate = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:155:30
-           const srcCandidate = assetPath.src || assetPath.path || assetPath.url || '';
+           const srcCandidate = (assetPath.src || assetPath.path || assetPath.url) && '';

[NoCoverage] ConditionalExpression
src/js/script.mjs:155:30
-           const srcCandidate = assetPath.src || assetPath.path || assetPath.url || '';
+           const srcCandidate = false || '';

[NoCoverage] LogicalOperator
src/js/script.mjs:155:30
-           const srcCandidate = assetPath.src || assetPath.path || assetPath.url || '';
+           const srcCandidate = (assetPath.src || assetPath.path) && assetPath.url || '';

[NoCoverage] ConditionalExpression
src/js/script.mjs:155:30
-           const srcCandidate = assetPath.src || assetPath.path || assetPath.url || '';
+           const srcCandidate = false || assetPath.url || '';

[NoCoverage] LogicalOperator
src/js/script.mjs:155:30
-           const srcCandidate = assetPath.src || assetPath.path || assetPath.url || '';
+           const srcCandidate = assetPath.src && assetPath.path || assetPath.url || '';

[NoCoverage] StringLiteral
src/js/script.mjs:155:82
-           const srcCandidate = assetPath.src || assetPath.path || assetPath.url || '';
+           const srcCandidate = assetPath.src || assetPath.path || assetPath.url || "Stryker was here!";

[NoCoverage] ConditionalExpression
src/js/script.mjs:156:13
-           if (isAvifAsset(srcCandidate)) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:156:13
-           if (isAvifAsset(srcCandidate)) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:156:40
-           if (isAvifAsset(srcCandidate)) {
-               return buildStaticSrcset(srcCandidate);
-           }
+           if (isAvifAsset(srcCandidate)) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:161:9
-       if (isAvifAsset(assetPath)) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:161:9
-       if (isAvifAsset(assetPath)) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:161:33
-       if (isAvifAsset(assetPath)) {
-           return buildStaticSrcset(assetPath);
-       }
+       if (isAvifAsset(assetPath)) {}

[NoCoverage] ObjectLiteral
src/js/script.mjs:165:37
-       return buildCfSrcset(assetPath, { format: 'avif' }, widths);
+       return buildCfSrcset(assetPath, {}, widths);

[NoCoverage] StringLiteral
src/js/script.mjs:165:47
-       return buildCfSrcset(assetPath, { format: 'avif' }, widths);
+       return buildCfSrcset(assetPath, { format: "" }, widths);

[NoCoverage] BooleanLiteral
src/js/script.mjs:180:68
-   function writeSharedProductData(products, metadata = {}, { force = false } = {}) {
+   function writeSharedProductData(products, metadata = {}, { force = true } = {}) {

[NoCoverage] BlockStatement
src/js/script.mjs:181:35
-       if (!Array.isArray(products)) {
-           return null;
-       }
+       if (!Array.isArray(products)) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:198:33
-               (!payloadVersion && !existingVersion) ||
+               (!payloadVersion && existingVersion) ||

[NoCoverage] BlockStatement
src/js/script.mjs:228:36
-   function safeReadLocalStorage(key) {
-       if (typeof window === 'undefined') {
-           return null;
-       }
-   
-       try {
-           const storage = window.localStorage ?? globalThis.localStorage ?? null;
-           if (!storage) {
-               return null;
-           }
-           return storage.getItem(key);
-       } catch (error) {
-           console.warn('Unable to access localStorage for key', key, error);
-           return null;
-       }
-   }
+   function safeReadLocalStorage(key) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:229:9
-       if (typeof window === 'undefined') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:229:9
-       if (typeof window === 'undefined') {
+       if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:229:9
-       if (typeof window === 'undefined') {
+       if (typeof window !== 'undefined') {

[NoCoverage] StringLiteral
src/js/script.mjs:229:27
-       if (typeof window === 'undefined') {
+       if (typeof window === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:229:40
-       if (typeof window === 'undefined') {
-           return null;
-       }
+       if (typeof window === 'undefined') {}

[NoCoverage] BlockStatement
src/js/script.mjs:233:9
-       try {
-           const storage = window.localStorage ?? globalThis.localStorage ?? null;
-           if (!storage) {
-               return null;
-           }
-           return storage.getItem(key);
-       } catch (error) {
+       try {} catch (error) {

[NoCoverage] LogicalOperator
src/js/script.mjs:234:25
-           const storage = window.localStorage ?? globalThis.localStorage ?? null;
+           const storage = (window.localStorage ?? globalThis.localStorage) && null;

[NoCoverage] LogicalOperator
src/js/script.mjs:234:25
-           const storage = window.localStorage ?? globalThis.localStorage ?? null;
+           const storage = window.localStorage && globalThis.localStorage ?? null;

[NoCoverage] BooleanLiteral
src/js/script.mjs:235:13
-           if (!storage) {
+           if (storage) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:235:13
-           if (!storage) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:235:13
-           if (!storage) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:235:23
-           if (!storage) {
-               return null;
-           }
+           if (!storage) {}

[NoCoverage] BlockStatement
src/js/script.mjs:239:21
-       } catch (error) {
-           console.warn('Unable to access localStorage for key', key, error);
-           return null;
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:240:22
-           console.warn('Unable to access localStorage for key', key, error);
+           console.warn("", key, error);

[NoCoverage] BlockStatement
src/js/script.mjs:245:40
-   function shouldRegisterServiceWorker() {
-       if (typeof window === 'undefined') {
-           return false;
-       }
-   
-       const disabledFlag = safeReadLocalStorage('ebano-sw-disabled');
-       if (disabledFlag === 'true') {
-           console.info('Service worker registration skipped by kill-switch flag.');
-           return false;
-       }
-   
-       const hostname = window.location?.hostname ?? '';
-       const isLocalhost = LOCALHOST_HOSTNAMES.has(hostname);
-       if (isLocalhost) {
-           const enableLocalFlag = safeReadLocalStorage('ebano-sw-enable-local');
-           const query = window.location?.search ?? '';
-           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);
-           if (enableLocalFlag === 'true' || queryEnables) {
-               return true;
-           }
-           console.info('Service worker registration skipped on localhost. Set localStorage ebano-sw-enable-local=true to override.');
-           return false;
-       }
-   
-       return true;
-   }
+   function shouldRegisterServiceWorker() {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:246:9
-       if (typeof window === 'undefined') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:246:9
-       if (typeof window === 'undefined') {
+       if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:246:9
-       if (typeof window === 'undefined') {
+       if (typeof window !== 'undefined') {

[NoCoverage] StringLiteral
src/js/script.mjs:246:27
-       if (typeof window === 'undefined') {
+       if (typeof window === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:246:40
-       if (typeof window === 'undefined') {
-           return false;
-       }
+       if (typeof window === 'undefined') {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:247:16
-           return false;
+           return true;

[NoCoverage] StringLiteral
src/js/script.mjs:250:47
-       const disabledFlag = safeReadLocalStorage('ebano-sw-disabled');
+       const disabledFlag = safeReadLocalStorage("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:251:9
-       if (disabledFlag === 'true') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:251:9
-       if (disabledFlag === 'true') {
+       if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:251:9
-       if (disabledFlag === 'true') {
+       if (disabledFlag !== 'true') {

[NoCoverage] StringLiteral
src/js/script.mjs:251:26
-       if (disabledFlag === 'true') {
+       if (disabledFlag === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:251:34
-       if (disabledFlag === 'true') {
-           console.info('Service worker registration skipped by kill-switch flag.');
-           return false;
-       }
+       if (disabledFlag === 'true') {}

[NoCoverage] StringLiteral
src/js/script.mjs:252:22
-           console.info('Service worker registration skipped by kill-switch flag.');
+           console.info("");

[NoCoverage] BooleanLiteral
src/js/script.mjs:253:16
-           return false;
+           return true;

[NoCoverage] LogicalOperator
src/js/script.mjs:256:22
-       const hostname = window.location?.hostname ?? '';
+       const hostname = window.location?.hostname && '';

[NoCoverage] OptionalChaining
src/js/script.mjs:256:22
-       const hostname = window.location?.hostname ?? '';
+       const hostname = window.location.hostname ?? '';

[NoCoverage] StringLiteral
src/js/script.mjs:256:51
-       const hostname = window.location?.hostname ?? '';
+       const hostname = window.location?.hostname ?? "Stryker was here!";

[NoCoverage] ConditionalExpression
src/js/script.mjs:258:9
-       if (isLocalhost) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:258:9
-       if (isLocalhost) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:258:22
-       if (isLocalhost) {
-           const enableLocalFlag = safeReadLocalStorage('ebano-sw-enable-local');
-           const query = window.location?.search ?? '';
-           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);
-           if (enableLocalFlag === 'true' || queryEnables) {
-               return true;
-           }
-           console.info('Service worker registration skipped on localhost. Set localStorage ebano-sw-enable-local=true to override.');
-           return false;
-       }
+       if (isLocalhost) {}

[NoCoverage] StringLiteral
src/js/script.mjs:259:54
-           const enableLocalFlag = safeReadLocalStorage('ebano-sw-enable-local');
+           const enableLocalFlag = safeReadLocalStorage("");

[NoCoverage] LogicalOperator
src/js/script.mjs:260:23
-           const query = window.location?.search ?? '';
+           const query = window.location?.search && '';

[NoCoverage] OptionalChaining
src/js/script.mjs:260:23
-           const query = window.location?.search ?? '';
+           const query = window.location.search ?? '';

[NoCoverage] StringLiteral
src/js/script.mjs:260:50
-           const query = window.location?.search ?? '';
+           const query = window.location?.search ?? "Stryker was here!";

[NoCoverage] ConditionalExpression
src/js/script.mjs:261:30
-           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);
+           const queryEnables = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:261:30
-           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);
+           const queryEnables = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:261:30
-           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);
+           const queryEnables = typeof query === 'string' || /(?:^|[?&])sw=on(?:&|$)/i.test(query);

[NoCoverage] ConditionalExpression
src/js/script.mjs:261:30
-           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);
+           const queryEnables = true && /(?:^|[?&])sw=on(?:&|$)/i.test(query);

[NoCoverage] EqualityOperator
src/js/script.mjs:261:30
-           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);
+           const queryEnables = typeof query !== 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);

[NoCoverage] StringLiteral
src/js/script.mjs:261:47
-           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);
+           const queryEnables = typeof query === "" && /(?:^|[?&])sw=on(?:&|$)/i.test(query);

[NoCoverage] Regex
src/js/script.mjs:261:59
-           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);
+           const queryEnables = typeof query === 'string' && /(?:[?&])sw=on(?:&|$)/i.test(query);

[NoCoverage] Regex
src/js/script.mjs:261:59
-           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);
+           const queryEnables = typeof query === 'string' && /(?:^|[^?&])sw=on(?:&|$)/i.test(query);

[NoCoverage] Regex
src/js/script.mjs:261:59
-           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&|$)/i.test(query);
+           const queryEnables = typeof query === 'string' && /(?:^|[?&])sw=on(?:&)/i.test(query);

[NoCoverage] ConditionalExpression
src/js/script.mjs:262:13
-           if (enableLocalFlag === 'true' || queryEnables) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:262:13
-           if (enableLocalFlag === 'true' || queryEnables) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:262:13
-           if (enableLocalFlag === 'true' || queryEnables) {
+           if (enableLocalFlag === 'true' && queryEnables) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:262:13
-           if (enableLocalFlag === 'true' || queryEnables) {
+           if (false || queryEnables) {

[NoCoverage] EqualityOperator
src/js/script.mjs:262:13
-           if (enableLocalFlag === 'true' || queryEnables) {
+           if (enableLocalFlag !== 'true' || queryEnables) {

[NoCoverage] StringLiteral
src/js/script.mjs:262:33
-           if (enableLocalFlag === 'true' || queryEnables) {
+           if (enableLocalFlag === "" || queryEnables) {

[NoCoverage] BlockStatement
src/js/script.mjs:262:57
-           if (enableLocalFlag === 'true' || queryEnables) {
-               return true;
-           }
+           if (enableLocalFlag === 'true' || queryEnables) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:263:20
-               return true;
+               return false;

[NoCoverage] StringLiteral
src/js/script.mjs:265:22
-           console.info('Service worker registration skipped on localhost. Set localStorage ebano-sw-enable-local=true to override.');
+           console.info("");

[NoCoverage] BooleanLiteral
src/js/script.mjs:266:16
-           return false;
+           return true;

[NoCoverage] BooleanLiteral
src/js/script.mjs:269:12
-       return true;
+       return false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:276:9
-       if (!('serviceWorker' in navigator)) {
+       if ('serviceWorker' in navigator) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:276:9
-       if (!('serviceWorker' in navigator)) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:276:9
-       if (!('serviceWorker' in navigator)) {
+       if (false) {

[NoCoverage] StringLiteral
src/js/script.mjs:276:11
-       if (!('serviceWorker' in navigator)) {
+       if (!("" in navigator)) {

[NoCoverage] BlockStatement
src/js/script.mjs:276:42
-       if (!('serviceWorker' in navigator)) {
-           console.warn('Service workers are not supported in this browser');
-           return;
-       }
+       if (!('serviceWorker' in navigator)) {}

[NoCoverage] StringLiteral
src/js/script.mjs:277:22
-           console.warn('Service workers are not supported in this browser');
+           console.warn("");

[NoCoverage] BooleanLiteral
src/js/script.mjs:281:9
-       if (!shouldRegisterServiceWorker()) {
+       if (shouldRegisterServiceWorker()) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:281:9
-       if (!shouldRegisterServiceWorker()) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:281:9
-       if (!shouldRegisterServiceWorker()) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:281:41
-       if (!shouldRegisterServiceWorker()) {
-           return;
-       }
+       if (!shouldRegisterServiceWorker()) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:285:9
-       if (serviceWorkerRegistrationSetup) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:285:9
-       if (serviceWorkerRegistrationSetup) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:285:41
-       if (serviceWorkerRegistrationSetup) {
-           return;
-       }
+       if (serviceWorkerRegistrationSetup) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:289:38
-       serviceWorkerRegistrationSetup = true;
+       serviceWorkerRegistrationSetup = false;

[NoCoverage] BlockStatement
src/js/script.mjs:291:43
-       const startRegistration = async () => {
-           if (document.readyState !== 'complete') {
-               return;
-           }
-   
-           window.removeEventListener('load', startRegistration);
-   
-           try {
-               await initializeServiceWorker();
-           } catch (error) {
-               console.error('Service Worker initialization failed:', error);
-               showServiceWorkerError('Failed to initialize service worker. Some features may not work offline.');
-           }
-       };
+       const startRegistration = async () => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:292:13
-           if (document.readyState !== 'complete') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:292:13
-           if (document.readyState !== 'complete') {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:292:13
-           if (document.readyState !== 'complete') {
+           if (document.readyState === 'complete') {

[NoCoverage] StringLiteral
src/js/script.mjs:292:37
-           if (document.readyState !== 'complete') {
+           if (document.readyState !== "") {

[NoCoverage] BlockStatement
src/js/script.mjs:292:49
-           if (document.readyState !== 'complete') {
-               return;
-           }
+           if (document.readyState !== 'complete') {}

[NoCoverage] StringLiteral
src/js/script.mjs:296:36
-           window.removeEventListener('load', startRegistration);
+           window.removeEventListener("", startRegistration);

[NoCoverage] BlockStatement
src/js/script.mjs:298:13
-           try {
-               await initializeServiceWorker();
-           } catch (error) {
+           try {} catch (error) {

[NoCoverage] BlockStatement
src/js/script.mjs:300:25
-           } catch (error) {
-               console.error('Service Worker initialization failed:', error);
-               showServiceWorkerError('Failed to initialize service worker. Some features may not work offline.');
-           }
+           } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:301:27
-               console.error('Service Worker initialization failed:', error);
+               console.error("", error);

[NoCoverage] StringLiteral
src/js/script.mjs:302:36
-               showServiceWorkerError('Failed to initialize service worker. Some features may not work offline.');
+               showServiceWorkerError("");

[NoCoverage] StringLiteral
src/js/script.mjs:306:29
-       window.addEventListener('load', startRegistration);
+       window.addEventListener("", startRegistration);

[NoCoverage] BlockStatement
src/js/script.mjs:310:52
-   function __resetServiceWorkerRegistrationForTest() {
-       serviceWorkerRegistrationSetup = false;
-   }
+   function __resetServiceWorkerRegistrationForTest() {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:311:38
-       serviceWorkerRegistrationSetup = false;
+       serviceWorkerRegistrationSetup = true;

[NoCoverage] BlockStatement
src/js/script.mjs:315:42
-   async function initializeServiceWorker() {
-       try {
-           const registration = await navigator.serviceWorker.register(
-               SERVICE_WORKER_CONFIG.path,
-               { scope: SERVICE_WORKER_CONFIG.scope }
-           );
-   
-           console.log('ServiceWorker registered successfully:', registration.scope);
-   
-           // Set up update handling
-           setupUpdateHandling(registration);
-   
-           // Set up periodic update checks
-           setupPeriodicUpdateCheck(registration);
-   
-           // Handle controller changes
-           setupControllerChangeHandling();
-   
-           // Set up offline/online detection
-           setupConnectivityHandling();
-   
-       } catch (error) {
-           console.error('ServiceWorker registration failed:', error);
-           throw error;
-       }
-   }
+   async function initializeServiceWorker() {}

[NoCoverage] BlockStatement
src/js/script.mjs:316:9
-       try {
-           const registration = await navigator.serviceWorker.register(
-               SERVICE_WORKER_CONFIG.path,
-               { scope: SERVICE_WORKER_CONFIG.scope }
-           );
-   
-           console.log('ServiceWorker registered successfully:', registration.scope);
-   
-           // Set up update handling
-           setupUpdateHandling(registration);
-   
-           // Set up periodic update checks
-           setupPeriodicUpdateCheck(registration);
-   
-           // Handle controller changes
-           setupControllerChangeHandling();
-   
-           // Set up offline/online detection
-           setupConnectivityHandling();
-   
-       } catch (error) {
+       try {} catch (error) {
