[NoCoverage] ObjectLiteral
src/js/script.mjs:319:13
-               { scope: SERVICE_WORKER_CONFIG.scope }
+               {}

[NoCoverage] StringLiteral
src/js/script.mjs:322:21
-           console.log('ServiceWorker registered successfully:', registration.scope);
+           console.log("", registration.scope);

[NoCoverage] BlockStatement
src/js/script.mjs:336:21
-       } catch (error) {
-           console.error('ServiceWorker registration failed:', error);
-           throw error;
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:337:23
-           console.error('ServiceWorker registration failed:', error);
+           console.error("", error);

[NoCoverage] BlockStatement
src/js/script.mjs:343:44
-   function setupUpdateHandling(registration) {
-       registration.addEventListener('updatefound', () => {
-           const newWorker = registration.installing;
-           newWorker.addEventListener('statechange', () => {
-               if (newWorker.state === 'installed' && navigator.serviceWorker.controller) {
-                   // Immediately activate the new service worker without a prompt
-                   newWorker.postMessage({ type: 'SKIP_WAITING' });
-               }
-           });
-       });
-   }
+   function setupUpdateHandling(registration) {}

[NoCoverage] StringLiteral
src/js/script.mjs:344:35
-       registration.addEventListener('updatefound', () => {
+       registration.addEventListener("", () => {

[NoCoverage] BlockStatement
src/js/script.mjs:344:56
-       registration.addEventListener('updatefound', () => {
-           const newWorker = registration.installing;
-           newWorker.addEventListener('statechange', () => {
-               if (newWorker.state === 'installed' && navigator.serviceWorker.controller) {
-                   // Immediately activate the new service worker without a prompt
-                   newWorker.postMessage({ type: 'SKIP_WAITING' });
-               }
-           });
-       });
+       registration.addEventListener('updatefound', () => {});

[NoCoverage] StringLiteral
src/js/script.mjs:346:36
-           newWorker.addEventListener('statechange', () => {
+           newWorker.addEventListener("", () => {

[NoCoverage] BlockStatement
src/js/script.mjs:346:57
-           newWorker.addEventListener('statechange', () => {
-               if (newWorker.state === 'installed' && navigator.serviceWorker.controller) {
-                   // Immediately activate the new service worker without a prompt
-                   newWorker.postMessage({ type: 'SKIP_WAITING' });
-               }
-           });
+           newWorker.addEventListener('statechange', () => {});

[NoCoverage] ConditionalExpression
src/js/script.mjs:347:17
-               if (newWorker.state === 'installed' && navigator.serviceWorker.controller) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:347:17
-               if (newWorker.state === 'installed' && navigator.serviceWorker.controller) {
+               if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:347:17
-               if (newWorker.state === 'installed' && navigator.serviceWorker.controller) {
+               if (newWorker.state === 'installed' || navigator.serviceWorker.controller) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:347:17
-               if (newWorker.state === 'installed' && navigator.serviceWorker.controller) {
+               if (true && navigator.serviceWorker.controller) {

[NoCoverage] EqualityOperator
src/js/script.mjs:347:17
-               if (newWorker.state === 'installed' && navigator.serviceWorker.controller) {
+               if (newWorker.state !== 'installed' && navigator.serviceWorker.controller) {

[NoCoverage] StringLiteral
src/js/script.mjs:347:37
-               if (newWorker.state === 'installed' && navigator.serviceWorker.controller) {
+               if (newWorker.state === "" && navigator.serviceWorker.controller) {

[NoCoverage] BlockStatement
src/js/script.mjs:347:88
-               if (newWorker.state === 'installed' && navigator.serviceWorker.controller) {
-                   // Immediately activate the new service worker without a prompt
-                   newWorker.postMessage({ type: 'SKIP_WAITING' });
-               }
+               if (newWorker.state === 'installed' && navigator.serviceWorker.controller) {}

[NoCoverage] ObjectLiteral
src/js/script.mjs:349:39
-                   newWorker.postMessage({ type: 'SKIP_WAITING' });
+                   newWorker.postMessage({});

[NoCoverage] StringLiteral
src/js/script.mjs:349:47
-                   newWorker.postMessage({ type: 'SKIP_WAITING' });
+                   newWorker.postMessage({ type: "" });

[NoCoverage] BlockStatement
src/js/script.mjs:357:49
-   function setupPeriodicUpdateCheck(registration) {
-       // Initial check
-       checkForUpdates(registration);
-   
-       // Set up periodic checks
-       setInterval(() => {
-           checkForUpdates(registration);
-       }, SERVICE_WORKER_CONFIG.updateCheckInterval);
-   }
+   function setupPeriodicUpdateCheck(registration) {}

[NoCoverage] BlockStatement
src/js/script.mjs:362:23
-       setInterval(() => {
-           checkForUpdates(registration);
-       }, SERVICE_WORKER_CONFIG.updateCheckInterval);
+       setInterval(() => {}, SERVICE_WORKER_CONFIG.updateCheckInterval);

[NoCoverage] BlockStatement
src/js/script.mjs:368:46
-   async function checkForUpdates(registration) {
-       try {
-           await registration.update();
-   
-           // Check if product data needs updating
-           const response = await fetch('/data/product_data.json', { cache: 'no-store', headers: { 'Accept': 'application/json' } });
-   
-           if (response.ok) {
-               const data = await response.json();
-               const currentVersion = data.version;
-               const storedVersion = localStorage.getItem('productDataVersion');
-   
-               if (currentVersion !== storedVersion) {
-                   registration.active?.postMessage({
-                       type: 'INVALIDATE_PRODUCT_CACHE'
-                   });
-   
-                   localStorage.setItem('productDataVersion', currentVersion);
-                   showUpdateNotification(null, 'New product data available');
-               }
-           }
-       } catch (error) {
-           console.warn('Update check failed:', error);
-       }
-   }
+   async function checkForUpdates(registration) {}

[NoCoverage] BlockStatement
src/js/script.mjs:369:9
-       try {
-           await registration.update();
-   
-           // Check if product data needs updating
-           const response = await fetch('/data/product_data.json', { cache: 'no-store', headers: { 'Accept': 'application/json' } });
-   
-           if (response.ok) {
-               const data = await response.json();
-               const currentVersion = data.version;
-               const storedVersion = localStorage.getItem('productDataVersion');
-   
-               if (currentVersion !== storedVersion) {
-                   registration.active?.postMessage({
-                       type: 'INVALIDATE_PRODUCT_CACHE'
-                   });
-   
-                   localStorage.setItem('productDataVersion', currentVersion);
-                   showUpdateNotification(null, 'New product data available');
-               }
-           }
-       } catch (error) {
+       try {} catch (error) {

[NoCoverage] StringLiteral
src/js/script.mjs:373:38
-           const response = await fetch('/data/product_data.json', { cache: 'no-store', headers: { 'Accept': 'application/json' } });
+           const response = await fetch("", { cache: 'no-store', headers: { 'Accept': 'application/json' } });

[NoCoverage] ObjectLiteral
src/js/script.mjs:373:65
-           const response = await fetch('/data/product_data.json', { cache: 'no-store', headers: { 'Accept': 'application/json' } });
+           const response = await fetch('/data/product_data.json', {});

[NoCoverage] StringLiteral
src/js/script.mjs:373:74
-           const response = await fetch('/data/product_data.json', { cache: 'no-store', headers: { 'Accept': 'application/json' } });
+           const response = await fetch('/data/product_data.json', { cache: "", headers: { 'Accept': 'application/json' } });

[NoCoverage] ObjectLiteral
src/js/script.mjs:373:95
-           const response = await fetch('/data/product_data.json', { cache: 'no-store', headers: { 'Accept': 'application/json' } });
+           const response = await fetch('/data/product_data.json', { cache: 'no-store', headers: {} });

[NoCoverage] StringLiteral
src/js/script.mjs:373:107
-           const response = await fetch('/data/product_data.json', { cache: 'no-store', headers: { 'Accept': 'application/json' } });
+           const response = await fetch('/data/product_data.json', { cache: 'no-store', headers: { 'Accept': "" } });

[NoCoverage] ConditionalExpression
src/js/script.mjs:375:13
-           if (response.ok) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:375:13
-           if (response.ok) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:375:26
-           if (response.ok) {
-               const data = await response.json();
-               const currentVersion = data.version;
-               const storedVersion = localStorage.getItem('productDataVersion');
-   
-               if (currentVersion !== storedVersion) {
-                   registration.active?.postMessage({
-                       type: 'INVALIDATE_PRODUCT_CACHE'
-                   });
-   
-                   localStorage.setItem('productDataVersion', currentVersion);
-                   showUpdateNotification(null, 'New product data available');
-               }
-           }
+           if (response.ok) {}

[NoCoverage] StringLiteral
src/js/script.mjs:378:56
-               const storedVersion = localStorage.getItem('productDataVersion');
+               const storedVersion = localStorage.getItem("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:380:17
-               if (currentVersion !== storedVersion) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:380:17
-               if (currentVersion !== storedVersion) {
+               if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:380:17
-               if (currentVersion !== storedVersion) {
+               if (currentVersion === storedVersion) {

[NoCoverage] BlockStatement
src/js/script.mjs:380:51
-               if (currentVersion !== storedVersion) {
-                   registration.active?.postMessage({
-                       type: 'INVALIDATE_PRODUCT_CACHE'
-                   });
-   
-                   localStorage.setItem('productDataVersion', currentVersion);
-                   showUpdateNotification(null, 'New product data available');
-               }
+               if (currentVersion !== storedVersion) {}

[NoCoverage] OptionalChaining
src/js/script.mjs:381:17
-                   registration.active?.postMessage({
+                   registration.active.postMessage({

[NoCoverage] ObjectLiteral
src/js/script.mjs:381:50
-                   registration.active?.postMessage({
-                       type: 'INVALIDATE_PRODUCT_CACHE'
-                   });
+                   registration.active?.postMessage({});

[NoCoverage] StringLiteral
src/js/script.mjs:382:27
-                       type: 'INVALIDATE_PRODUCT_CACHE'
+                       type: ""

[NoCoverage] StringLiteral
src/js/script.mjs:385:38
-                   localStorage.setItem('productDataVersion', currentVersion);
+                   localStorage.setItem("", currentVersion);

[NoCoverage] StringLiteral
src/js/script.mjs:386:46
-                   showUpdateNotification(null, 'New product data available');
+                   showUpdateNotification(null, "");

[NoCoverage] BlockStatement
src/js/script.mjs:389:21
-       } catch (error) {
-           console.warn('Update check failed:', error);
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:390:22
-           console.warn('Update check failed:', error);
+           console.warn("", error);

[NoCoverage] BlockStatement
src/js/script.mjs:395:42
-   function setupControllerChangeHandling() {
-       let refreshing = false;
-       navigator.serviceWorker.addEventListener('controllerchange', () => {
-           if (!refreshing) {
-               refreshing = true;
-               window.location.reload();
-           }
-       });
-   }
+   function setupControllerChangeHandling() {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:396:22
-       let refreshing = false;
+       let refreshing = true;

[NoCoverage] StringLiteral
src/js/script.mjs:397:46
-       navigator.serviceWorker.addEventListener('controllerchange', () => {
+       navigator.serviceWorker.addEventListener("", () => {

[NoCoverage] BlockStatement
src/js/script.mjs:397:72
-       navigator.serviceWorker.addEventListener('controllerchange', () => {
-           if (!refreshing) {
-               refreshing = true;
-               window.location.reload();
-           }
-       });
+       navigator.serviceWorker.addEventListener('controllerchange', () => {});

[NoCoverage] BooleanLiteral
src/js/script.mjs:398:13
-           if (!refreshing) {
+           if (refreshing) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:398:13
-           if (!refreshing) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:398:13
-           if (!refreshing) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:398:26
-           if (!refreshing) {
-               refreshing = true;
-               window.location.reload();
-           }
+           if (!refreshing) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:399:26
-               refreshing = true;
+               refreshing = false;

[NoCoverage] BlockStatement
src/js/script.mjs:406:38
-   function setupConnectivityHandling() {
-       const offlineIndicator = document.getElementById('offline-indicator');
-       if (!offlineIndicator) {
-           return;
-       }
-       const updateOnlineStatus = () => {
-           const hidden = navigator.onLine;
-           offlineIndicator.classList.toggle(UTILITY_CLASSES.hidden, hidden);
-           offlineIndicator.classList.toggle(UTILITY_CLASSES.block, !hidden);
-   
-           if (!hidden) {
-               showConnectivityNotification('You are currently offline. Some features may be limited.');
-           }
-       };
-   
-       window.addEventListener('online', updateOnlineStatus);
-       window.addEventListener('offline', updateOnlineStatus);
-   
-       if (!navigator.onLine) {
-           updateOnlineStatus();
-       }
-   }
+   function setupConnectivityHandling() {}

[NoCoverage] StringLiteral
src/js/script.mjs:407:54
-       const offlineIndicator = document.getElementById('offline-indicator');
+       const offlineIndicator = document.getElementById("");

[NoCoverage] BooleanLiteral
src/js/script.mjs:408:9
-       if (!offlineIndicator) {
+       if (offlineIndicator) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:408:9
-       if (!offlineIndicator) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:408:9
-       if (!offlineIndicator) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:408:28
-       if (!offlineIndicator) {
-           return;
-       }
+       if (!offlineIndicator) {}

[NoCoverage] BlockStatement
src/js/script.mjs:411:38
-       const updateOnlineStatus = () => {
-           const hidden = navigator.onLine;
-           offlineIndicator.classList.toggle(UTILITY_CLASSES.hidden, hidden);
-           offlineIndicator.classList.toggle(UTILITY_CLASSES.block, !hidden);
-   
-           if (!hidden) {
-               showConnectivityNotification('You are currently offline. Some features may be limited.');
-           }
-       };
+       const updateOnlineStatus = () => {};

[NoCoverage] BooleanLiteral
src/js/script.mjs:414:66
-           offlineIndicator.classList.toggle(UTILITY_CLASSES.block, !hidden);
+           offlineIndicator.classList.toggle(UTILITY_CLASSES.block, hidden);

[NoCoverage] BooleanLiteral
src/js/script.mjs:416:13
-           if (!hidden) {
+           if (hidden) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:416:13
-           if (!hidden) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:416:13
-           if (!hidden) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:416:22
-           if (!hidden) {
-               showConnectivityNotification('You are currently offline. Some features may be limited.');
-           }
+           if (!hidden) {}

[NoCoverage] StringLiteral
src/js/script.mjs:417:42
-               showConnectivityNotification('You are currently offline. Some features may be limited.');
+               showConnectivityNotification("");

[NoCoverage] StringLiteral
src/js/script.mjs:421:29
-       window.addEventListener('online', updateOnlineStatus);
+       window.addEventListener("", updateOnlineStatus);

[NoCoverage] StringLiteral
src/js/script.mjs:422:29
-       window.addEventListener('offline', updateOnlineStatus);
+       window.addEventListener("", updateOnlineStatus);

[NoCoverage] BooleanLiteral
src/js/script.mjs:424:9
-       if (!navigator.onLine) {
+       if (navigator.onLine) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:424:9
-       if (!navigator.onLine) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:424:9
-       if (!navigator.onLine) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:424:28
-       if (!navigator.onLine) {
-           updateOnlineStatus();
-       }
+       if (!navigator.onLine) {}

[NoCoverage] BlockStatement
src/js/script.mjs:431:32
-   function __loadNotifications() {
-       if (!__notificationsModulePromise) {
-           __notificationsModulePromise = import('./modules/notifications.mjs');
-       }
-       return __notificationsModulePromise;
-   }
+   function __loadNotifications() {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:432:9
-       if (!__notificationsModulePromise) {
+       if (__notificationsModulePromise) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:432:9
-       if (!__notificationsModulePromise) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:432:9
-       if (!__notificationsModulePromise) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:432:40
-       if (!__notificationsModulePromise) {
-           __notificationsModulePromise = import('./modules/notifications.mjs');
-       }
+       if (!__notificationsModulePromise) {}

[NoCoverage] StringLiteral
src/js/script.mjs:433:47
-           __notificationsModulePromise = import('./modules/notifications.mjs');
+           __notificationsModulePromise = import("");

[NoCoverage] StringLiteral
src/js/script.mjs:438:58
-   function showUpdateNotification(serviceWorker, message = 'Una versión está disponible') {
+   function showUpdateNotification(serviceWorker, message = "") {

[NoCoverage] BlockStatement
src/js/script.mjs:438:89
-   function showUpdateNotification(serviceWorker, message = 'Una versión está disponible') {
-       __loadNotifications().then((m) => m.showUpdateNotification(serviceWorker, message));
-   }
+   function showUpdateNotification(serviceWorker, message = 'Una versión está disponible') {}

[NoCoverage] ArrowFunction
src/js/script.mjs:439:32
-       __loadNotifications().then((m) => m.showUpdateNotification(serviceWorker, message));
+       __loadNotifications().then(() => undefined);

[NoCoverage] BlockStatement
src/js/script.mjs:442:42
-   function showServiceWorkerError(message) {
-       __loadNotifications().then((m) => m.showServiceWorkerError(message));
-   }
+   function showServiceWorkerError(message) {}

[NoCoverage] ArrowFunction
src/js/script.mjs:443:32
-       __loadNotifications().then((m) => m.showServiceWorkerError(message));
+       __loadNotifications().then(() => undefined);

[NoCoverage] BlockStatement
src/js/script.mjs:446:48
-   function showConnectivityNotification(message) {
-       __loadNotifications().then((m) => m.showConnectivityNotification(message));
-   }
+   function showConnectivityNotification(message) {}

[NoCoverage] ArrowFunction
src/js/script.mjs:447:32
-       __loadNotifications().then((m) => m.showConnectivityNotification(message));
+       __loadNotifications().then(() => undefined);

[NoCoverage] BlockStatement
src/js/script.mjs:451:71
-   if (typeof navigator !== 'undefined' && 'serviceWorker' in navigator) {
-       registerServiceWorker();
-   }
+   if (typeof navigator !== 'undefined' && 'serviceWorker' in navigator) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:457:38
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:457:38
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => false;

[NoCoverage] LogicalOperator
src/js/script.mjs:457:38
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => typeof value === 'object' && value !== null && typeof value === 'function';

[NoCoverage] ConditionalExpression
src/js/script.mjs:457:39
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => (false) || typeof value === 'function';

[NoCoverage] LogicalOperator
src/js/script.mjs:457:39
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => (typeof value === 'object' || value !== null) || typeof value === 'function';

[NoCoverage] ConditionalExpression
src/js/script.mjs:457:39
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => (true && value !== null) || typeof value === 'function';

[NoCoverage] EqualityOperator
src/js/script.mjs:457:39
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => (typeof value !== 'object' && value !== null) || typeof value === 'function';

[NoCoverage] StringLiteral
src/js/script.mjs:457:56
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => (typeof value === "" && value !== null) || typeof value === 'function';

[NoCoverage] ConditionalExpression
src/js/script.mjs:457:68
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => (typeof value === 'object' && true) || typeof value === 'function';

[NoCoverage] EqualityOperator
src/js/script.mjs:457:68
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => (typeof value === 'object' && value === null) || typeof value === 'function';

[NoCoverage] ConditionalExpression
src/js/script.mjs:457:87
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || false;

[NoCoverage] EqualityOperator
src/js/script.mjs:457:87
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value !== 'function';

[NoCoverage] StringLiteral
src/js/script.mjs:457:104
-   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === 'function';
+   const isCacheableObject = (value) => (typeof value === 'object' && value !== null) || typeof value === "";

[NoCoverage] ObjectLiteral
src/js/script.mjs:459:32
-   const createCacheNode = () => ({
-       map: new Map(),
-       weakMap: new WeakMap(),
-       hasValue: false,
-       value: undefined
-   });
+   const createCacheNode = () => ({});

[NoCoverage] BooleanLiteral
src/js/script.mjs:462:15
-       hasValue: false,
+       hasValue: true,

[NoCoverage] ConditionalExpression
src/js/script.mjs:467:9
-       if (typeof fn !== 'function') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:467:9
-       if (typeof fn !== 'function') {
+       if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:467:9
-       if (typeof fn !== 'function') {
+       if (typeof fn === 'function') {

[NoCoverage] StringLiteral
src/js/script.mjs:467:23
-       if (typeof fn !== 'function') {
+       if (typeof fn !== "") {

[NoCoverage] BlockStatement
src/js/script.mjs:467:35
-       if (typeof fn !== 'function') {
-           throw new TypeError('Expected a function to memoize');
-       }
+       if (typeof fn !== 'function') {}

[NoCoverage] StringLiteral
src/js/script.mjs:468:29
-           throw new TypeError('Expected a function to memoize');
+           throw new TypeError("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:471:9
-       if (!Number.isFinite(cacheSize) || cacheSize < 0) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:471:9
-       if (!Number.isFinite(cacheSize) || cacheSize < 0) {
+       if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:471:9
-       if (!Number.isFinite(cacheSize) || cacheSize < 0) {
+       if (!Number.isFinite(cacheSize) && cacheSize < 0) {

[NoCoverage] BooleanLiteral
src/js/script.mjs:471:9
-       if (!Number.isFinite(cacheSize) || cacheSize < 0) {
+       if (Number.isFinite(cacheSize) || cacheSize < 0) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:471:40
-       if (!Number.isFinite(cacheSize) || cacheSize < 0) {
+       if (!Number.isFinite(cacheSize) || false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:471:40
-       if (!Number.isFinite(cacheSize) || cacheSize < 0) {
+       if (!Number.isFinite(cacheSize) || cacheSize <= 0) {

[NoCoverage] EqualityOperator
src/js/script.mjs:471:40
-       if (!Number.isFinite(cacheSize) || cacheSize < 0) {
+       if (!Number.isFinite(cacheSize) || cacheSize >= 0) {

[NoCoverage] BlockStatement
src/js/script.mjs:471:55
-       if (!Number.isFinite(cacheSize) || cacheSize < 0) {
-           cacheSize = 0;
-       }
+       if (!Number.isFinite(cacheSize) || cacheSize < 0) {}

[NoCoverage] ArrayDeclaration
src/js/script.mjs:476:17
-       const lru = [];
+       const lru = ["Stryker was here"];

[NoCoverage] BlockStatement
src/js/script.mjs:478:29
-       const touch = (node) => {
-           const index = lru.indexOf(node);
-           if (index !== -1) {
-               lru.splice(index, 1);
-           }
-           if (cacheSize > 0) {
-               lru.push(node);
-           }
-       };
+       const touch = (node) => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:480:13
-           if (index !== -1) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:480:13
-           if (index !== -1) {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:480:13
-           if (index !== -1) {
+           if (index === -1) {

[NoCoverage] UnaryOperator
src/js/script.mjs:480:23
-           if (index !== -1) {
+           if (index !== +1) {

[NoCoverage] BlockStatement
src/js/script.mjs:480:27
-           if (index !== -1) {
-               lru.splice(index, 1);
-           }
+           if (index !== -1) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:483:13
-           if (cacheSize > 0) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:483:13
-           if (cacheSize > 0) {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:483:13
-           if (cacheSize > 0) {
+           if (cacheSize >= 0) {

[NoCoverage] EqualityOperator
src/js/script.mjs:483:13
-           if (cacheSize > 0) {
+           if (cacheSize <= 0) {

[NoCoverage] BlockStatement
src/js/script.mjs:483:28
-           if (cacheSize > 0) {
-               lru.push(node);
-           }
+           if (cacheSize > 0) {}

[NoCoverage] BlockStatement
src/js/script.mjs:488:33
-       const evictIfNeeded = () => {
-           if (cacheSize === 0) {
-               return;
-           }
-           while (lru.length > cacheSize) {
-               const oldest = lru.shift();
-               if (!oldest) {
-                   continue;
-               }
-               oldest.hasValue = false;
-               oldest.value = undefined;
-           }
-       };
+       const evictIfNeeded = () => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:489:13
-           if (cacheSize === 0) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:489:13
-           if (cacheSize === 0) {
+           if (false) {
