[NoCoverage] EqualityOperator
src/js/script.mjs:489:13
-           if (cacheSize === 0) {
+           if (cacheSize !== 0) {

[NoCoverage] BlockStatement
src/js/script.mjs:489:30
-           if (cacheSize === 0) {
-               return;
-           }
+           if (cacheSize === 0) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:492:16
-           while (lru.length > cacheSize) {
+           while (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:492:16
-           while (lru.length > cacheSize) {
+           while (lru.length >= cacheSize) {

[NoCoverage] EqualityOperator
src/js/script.mjs:492:16
-           while (lru.length > cacheSize) {
+           while (lru.length <= cacheSize) {

[NoCoverage] BlockStatement
src/js/script.mjs:492:40
-           while (lru.length > cacheSize) {
-               const oldest = lru.shift();
-               if (!oldest) {
-                   continue;
-               }
-               oldest.hasValue = false;
-               oldest.value = undefined;
-           }
+           while (lru.length > cacheSize) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:494:17
-               if (!oldest) {
+               if (oldest) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:494:17
-               if (!oldest) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:494:17
-               if (!oldest) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:494:26
-               if (!oldest) {
-                   continue;
-               }
+               if (!oldest) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:497:31
-               oldest.hasValue = false;
+               oldest.hasValue = true;

[NoCoverage] BlockStatement
src/js/script.mjs:502:41
-       const getChildNode = (node, arg) => {
-           const useWeakMap = isCacheableObject(arg);
-           if (useWeakMap) {
-               let next = node.weakMap.get(arg);
-               if (!next) {
-                   next = createCacheNode();
-                   node.weakMap.set(arg, next);
-               }
-               return next;
-           }
-           if (!node.map.has(arg)) {
-               node.map.set(arg, createCacheNode());
-           }
-           return node.map.get(arg);
-       };
+       const getChildNode = (node, arg) => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:504:13
-           if (useWeakMap) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:504:13
-           if (useWeakMap) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:504:25
-           if (useWeakMap) {
-               let next = node.weakMap.get(arg);
-               if (!next) {
-                   next = createCacheNode();
-                   node.weakMap.set(arg, next);
-               }
-               return next;
-           }
+           if (useWeakMap) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:506:17
-               if (!next) {
+               if (next) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:506:17
-               if (!next) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:506:17
-               if (!next) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:506:24
-               if (!next) {
-                   next = createCacheNode();
-                   node.weakMap.set(arg, next);
-               }
+               if (!next) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:512:13
-           if (!node.map.has(arg)) {
+           if (node.map.has(arg)) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:512:13
-           if (!node.map.has(arg)) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:512:13
-           if (!node.map.has(arg)) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:512:33
-           if (!node.map.has(arg)) {
-               node.map.set(arg, createCacheNode());
-           }
+           if (!node.map.has(arg)) {}

[NoCoverage] BlockStatement
src/js/script.mjs:518:25
-       return (...args) => {
-           if (cacheSize === 0) {
-               return fn(...args);
-           }
-           let node = root;
-           for (let i = 0; i < args.length; i += 1) {
-               node = getChildNode(node, args[i]);
-           }
-           if (node.hasValue) {
-               touch(node);
-               return node.value;
-           }
-           const result = fn(...args);
-           node.value = result;
-           node.hasValue = true;
-           touch(node);
-           evictIfNeeded();
-           return result;
-       };
+       return (...args) => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:519:13
-           if (cacheSize === 0) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:519:13
-           if (cacheSize === 0) {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:519:13
-           if (cacheSize === 0) {
+           if (cacheSize !== 0) {

[NoCoverage] BlockStatement
src/js/script.mjs:519:30
-           if (cacheSize === 0) {
-               return fn(...args);
-           }
+           if (cacheSize === 0) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:523:25
-           for (let i = 0; i < args.length; i += 1) {
+           for (let i = 0; false; i += 1) {

[NoCoverage] EqualityOperator
src/js/script.mjs:523:25
-           for (let i = 0; i < args.length; i += 1) {
+           for (let i = 0; i <= args.length; i += 1) {

[NoCoverage] EqualityOperator
src/js/script.mjs:523:25
-           for (let i = 0; i < args.length; i += 1) {
+           for (let i = 0; i >= args.length; i += 1) {

[NoCoverage] AssignmentOperator
src/js/script.mjs:523:42
-           for (let i = 0; i < args.length; i += 1) {
+           for (let i = 0; i < args.length; i -= 1) {

[NoCoverage] BlockStatement
src/js/script.mjs:523:50
-           for (let i = 0; i < args.length; i += 1) {
-               node = getChildNode(node, args[i]);
-           }
+           for (let i = 0; i < args.length; i += 1) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:526:13
-           if (node.hasValue) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:526:13
-           if (node.hasValue) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:526:28
-           if (node.hasValue) {
-               touch(node);
-               return node.value;
-           }
+           if (node.hasValue) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:532:25
-           node.hasValue = true;
+           node.hasValue = false;

[NoCoverage] BlockStatement
src/js/script.mjs:539:35
-   const debounce = (func, delay) => {
-       let timeoutId;
-       return (...args) => {
-           clearTimeout(timeoutId);
-           timeoutId = setTimeout(() => func(...args), delay);
-       };
-   };
+   const debounce = (func, delay) => {};

[NoCoverage] BlockStatement
src/js/script.mjs:541:25
-       return (...args) => {
-           clearTimeout(timeoutId);
-           timeoutId = setTimeout(() => func(...args), delay);
-       };
+       return (...args) => {};

[NoCoverage] ArrowFunction
src/js/script.mjs:543:32
-           timeoutId = setTimeout(() => func(...args), delay);
+           timeoutId = setTimeout(() => undefined, delay);

[NoCoverage] BlockStatement
src/js/script.mjs:547:45
-   const scheduleIdle = (fn, timeout = 500) => {
-       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {
-           const handle = window.requestIdleCallback(fn, { timeout });
-           return { type: 'idle', handle };
-       }
-       const handle = setTimeout(fn, 0);
-       return { type: 'timeout', handle };
-   };
+   const scheduleIdle = (fn, timeout = 500) => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:548:9
-       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:548:9
-       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {
+       if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:548:9
-       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {
+       if (typeof window !== 'undefined' || typeof window.requestIdleCallback === 'function') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:548:9
-       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {
+       if (true && typeof window.requestIdleCallback === 'function') {

[NoCoverage] EqualityOperator
src/js/script.mjs:548:9
-       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {
+       if (typeof window === 'undefined' && typeof window.requestIdleCallback === 'function') {

[NoCoverage] StringLiteral
src/js/script.mjs:548:27
-       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {
+       if (typeof window !== "" && typeof window.requestIdleCallback === 'function') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:548:42
-       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {
+       if (typeof window !== 'undefined' && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:548:42
-       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {
+       if (typeof window !== 'undefined' && typeof window.requestIdleCallback !== 'function') {

[NoCoverage] StringLiteral
src/js/script.mjs:548:80
-       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {
+       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:548:92
-       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {
-           const handle = window.requestIdleCallback(fn, { timeout });
-           return { type: 'idle', handle };
-       }
+       if (typeof window !== 'undefined' && typeof window.requestIdleCallback === 'function') {}

[NoCoverage] ObjectLiteral
src/js/script.mjs:549:55
-           const handle = window.requestIdleCallback(fn, { timeout });
+           const handle = window.requestIdleCallback(fn, {});

[NoCoverage] ObjectLiteral
src/js/script.mjs:550:16
-           return { type: 'idle', handle };
+           return {};

[NoCoverage] StringLiteral
src/js/script.mjs:550:24
-           return { type: 'idle', handle };
+           return { type: "", handle };

[NoCoverage] ObjectLiteral
src/js/script.mjs:553:12
-       return { type: 'timeout', handle };
+       return {};

[NoCoverage] StringLiteral
src/js/script.mjs:553:20
-       return { type: 'timeout', handle };
+       return { type: "", handle };

[NoCoverage] BlockStatement
src/js/script.mjs:556:40
-   const cancelScheduledIdle = (token) => {
-       if (!token) return;
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
-           window.cancelIdleCallback(token.handle);
-       } else if (token.type === 'timeout') {
-           clearTimeout(token.handle);
-       }
-   };
+   const cancelScheduledIdle = (token) => {};

[NoCoverage] BooleanLiteral
src/js/script.mjs:557:9
-       if (!token) return;
+       if (token) return;

[NoCoverage] ConditionalExpression
src/js/script.mjs:557:9
-       if (!token) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/js/script.mjs:557:9
-       if (!token) return;
+       if (false) return;

[NoCoverage] ConditionalExpression
src/js/script.mjs:558:9
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:558:9
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:558:9
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (token.type === 'idle' && typeof window !== 'undefined' || typeof window.cancelIdleCallback === 'function') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:558:9
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (true && typeof window.cancelIdleCallback === 'function') {

[NoCoverage] LogicalOperator
src/js/script.mjs:558:9
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (token.type === 'idle' || typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:558:9
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (true && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {

[NoCoverage] EqualityOperator
src/js/script.mjs:558:9
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (token.type !== 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {

[NoCoverage] StringLiteral
src/js/script.mjs:558:24
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (token.type === "" && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:558:34
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (token.type === 'idle' && true && typeof window.cancelIdleCallback === 'function') {

[NoCoverage] EqualityOperator
src/js/script.mjs:558:34
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (token.type === 'idle' && typeof window === 'undefined' && typeof window.cancelIdleCallback === 'function') {

[NoCoverage] StringLiteral
src/js/script.mjs:558:52
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (token.type === 'idle' && typeof window !== "" && typeof window.cancelIdleCallback === 'function') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:558:67
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (token.type === 'idle' && typeof window !== 'undefined' && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:558:67
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback !== 'function') {

[NoCoverage] StringLiteral
src/js/script.mjs:558:104
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
+       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:558:116
-       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {
-           window.cancelIdleCallback(token.handle);
-       } else if (token.type === 'timeout') {
+       if (token.type === 'idle' && typeof window !== 'undefined' && typeof window.cancelIdleCallback === 'function') {} else if (token.type === 'timeout') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:560:16
-       } else if (token.type === 'timeout') {
+       } else if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:560:16
-       } else if (token.type === 'timeout') {
+       } else if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:560:16
-       } else if (token.type === 'timeout') {
+       } else if (token.type !== 'timeout') {

[NoCoverage] StringLiteral
src/js/script.mjs:560:31
-       } else if (token.type === 'timeout') {
+       } else if (token.type === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:560:42
-       } else if (token.type === 'timeout') {
-           clearTimeout(token.handle);
-       }
+       } else if (token.type === 'timeout') {}

[NoCoverage] StringLiteral
src/js/script.mjs:567:22
-       if (!str) return '';
+       if (!str) return "Stryker was here!";

[NoCoverage] BlockStatement
src/js/script.mjs:574:13
-       } catch {
-           return String(str).toLowerCase();
-       }
+       } catch {}

[NoCoverage] MethodExpression
src/js/script.mjs:575:16
-           return String(str).toLowerCase();
+           return String(str).toUpperCase();

[NoCoverage] StringLiteral
src/js/script.mjs:587:95
-       const rawName = hasValidShape && typeof product.name === 'string' ? product.name.trim() : '';
+       const rawName = hasValidShape && typeof product.name === 'string' ? product.name.trim() : "Stryker was here!";

[NoCoverage] MethodExpression
src/js/script.mjs:588:81
-       const rawCategory = hasValidShape && typeof product.category === 'string' ? product.category.trim() : '';
+       const rawCategory = hasValidShape && typeof product.category === 'string' ? product.category : '';

[NoCoverage] StringLiteral
src/js/script.mjs:590:53
-       const safeName = rawName.length > 0 ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index + 1}`;
+       const safeName = rawName.length > 0 ? rawName : ``;

[NoCoverage] ArithmeticOperator
src/js/script.mjs:590:87
-       const safeName = rawName.length > 0 ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index + 1}`;
+       const safeName = rawName.length > 0 ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index - 1}`;

[NoCoverage] StringLiteral
src/js/script.mjs:603:56
-       const suffix = needsFallbackSuffix ? `-${index}` : '';
+       const suffix = needsFallbackSuffix ? `-${index}` : "Stryker was here!";

[NoCoverage] BlockStatement
src/js/script.mjs:618:50
-           if (typeof localStorage === 'undefined') {
-               return null;
-           }
+           if (typeof localStorage === 'undefined') {}

[NoCoverage] BlockStatement
src/js/script.mjs:622:21
-       } catch (error) {
-           console.warn('Unable to read stored product data version:', error);
-           return null;
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:623:22
-           console.warn('Unable to read stored product data version:', error);
+           console.warn("", error);

[NoCoverage] BlockStatement
src/js/script.mjs:629:19
-       if (!version) {
-           return;
-       }
+       if (!version) {}

[NoCoverage] BlockStatement
src/js/script.mjs:633:50
-           if (typeof localStorage === 'undefined') {
-               return;
-           }
+           if (typeof localStorage === 'undefined') {}

[NoCoverage] BlockStatement
src/js/script.mjs:637:21
-       } catch (error) {
-           console.warn('Unable to persist product data version:', error);
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:638:22
-           console.warn('Unable to persist product data version:', error);
+           console.warn("", error);

[NoCoverage] BlockStatement
src/js/script.mjs:643:42
-       if (typeof document === 'undefined') {
-           return null;
-       }
+       if (typeof document === 'undefined') {}

[NoCoverage] BlockStatement
src/js/script.mjs:652:23
-           if (!payload) {
-               return null;
-           }
+           if (!payload) {}

[NoCoverage] BlockStatement
src/js/script.mjs:656:22
-           if (!parsed) {
-               return null;
-           }
+           if (!parsed) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:662:13
-           if (Array.isArray(parsed.products)) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:662:13
-           if (Array.isArray(parsed.products)) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:662:45
-           if (Array.isArray(parsed.products)) {
-               return { ...parsed, initialProducts: parsed.products };
-           }
+           if (Array.isArray(parsed.products)) {}

[NoCoverage] ObjectLiteral
src/js/script.mjs:663:20
-               return { ...parsed, initialProducts: parsed.products };
+               return {};

[NoCoverage] BlockStatement
src/js/script.mjs:666:21
-       } catch (error) {
-           log('warn', 'inline_product_parse_failure', { error: error.message });
-           return null;
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:667:13
-           log('warn', 'inline_product_parse_failure', { error: error.message });
+           log("", 'inline_product_parse_failure', { error: error.message });

[NoCoverage] StringLiteral
src/js/script.mjs:667:21
-           log('warn', 'inline_product_parse_failure', { error: error.message });
+           log('warn', "", { error: error.message });

[NoCoverage] ObjectLiteral
src/js/script.mjs:667:53
-           log('warn', 'inline_product_parse_failure', { error: error.message });
+           log('warn', 'inline_product_parse_failure', {});

[NoCoverage] BlockStatement
src/js/script.mjs:673:50
-       if (!product || typeof product !== 'object') {
-           return null;
-       }
+       if (!product || typeof product !== 'object') {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:677:50
-       const id = typeof product.id === 'string' && product.id.trim().length > 0
+       const id = typeof product.id === 'string' && true

[NoCoverage] EqualityOperator
src/js/script.mjs:677:50
-       const id = typeof product.id === 'string' && product.id.trim().length > 0
+       const id = typeof product.id === 'string' && product.id.trim().length >= 0

[NoCoverage] EqualityOperator
src/js/script.mjs:677:50
-       const id = typeof product.id === 'string' && product.id.trim().length > 0
+       const id = typeof product.id === 'string' && product.id.trim().length <= 0

[NoCoverage] MethodExpression
src/js/script.mjs:677:50
-       const id = typeof product.id === 'string' && product.id.trim().length > 0
+       const id = typeof product.id === 'string' && product.id.length > 0

[NoCoverage] MethodExpression
src/js/script.mjs:678:11
-           ? product.id.trim()
+           ? product.id

[NoCoverage] StringLiteral
src/js/script.mjs:689:11
-           : `${DEFAULT_PRODUCT_NAME_PREFIX} ${index + 1}`;
+           : ``;

[NoCoverage] ArithmeticOperator
src/js/script.mjs:689:45
-           : `${DEFAULT_PRODUCT_NAME_PREFIX} ${index + 1}`;
+           : `${DEFAULT_PRODUCT_NAME_PREFIX} ${index - 1}`;

[NoCoverage] ConditionalExpression
src/js/script.mjs:692:66
-       const safeCategory = typeof product.category === 'string' && product.category.trim().length > 0
+       const safeCategory = typeof product.category === 'string' && true

[NoCoverage] EqualityOperator
src/js/script.mjs:692:66
-       const safeCategory = typeof product.category === 'string' && product.category.trim().length > 0
+       const safeCategory = typeof product.category === 'string' && product.category.trim().length >= 0

[NoCoverage] EqualityOperator
src/js/script.mjs:692:66
-       const safeCategory = typeof product.category === 'string' && product.category.trim().length > 0
+       const safeCategory = typeof product.category === 'string' && product.category.trim().length <= 0

[NoCoverage] MethodExpression
src/js/script.mjs:692:66
-       const safeCategory = typeof product.category === 'string' && product.category.trim().length > 0
+       const safeCategory = typeof product.category === 'string' && product.category.length > 0

[NoCoverage] ArrayDeclaration
src/js/script.mjs:711:39
-   const transformProducts = (products = []) => products
+   const transformProducts = (products = ["Stryker was here"]) => products

[NoCoverage] BlockStatement
src/js/script.mjs:717:19
-       if (existing) {
-           return existing;
-       }
+       if (existing) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:721:24
-       if (!inlineData || !Array.isArray(inlineData.initialProducts)) {
+       if (!inlineData || Array.isArray(inlineData.initialProducts)) {

[NoCoverage] ObjectLiteral
src/js/script.mjs:725:49
-       return ensureSharedProductData(transformed, {
-           version: inlineData.version || null,
-           source: 'inline',
-           isPartial: true,
-           total: typeof inlineData.totalProducts === 'number' ? inlineData.totalProducts : transformed.length
-       });
+       return ensureSharedProductData(transformed, {});

[NoCoverage] ConditionalExpression
src/js/script.mjs:726:18
-           version: inlineData.version || null,
+           version: true,

[NoCoverage] ConditionalExpression
src/js/script.mjs:726:18
-           version: inlineData.version || null,
+           version: false,

[NoCoverage] LogicalOperator
src/js/script.mjs:726:18
-           version: inlineData.version || null,
+           version: inlineData.version && null,

[NoCoverage] StringLiteral
src/js/script.mjs:727:17
-           source: 'inline',
+           source: "",

[NoCoverage] BooleanLiteral
src/js/script.mjs:728:20
-           isPartial: true,
+           isPartial: false,

[NoCoverage] ConditionalExpression
src/js/script.mjs:729:16
-           total: typeof inlineData.totalProducts === 'number' ? inlineData.totalProducts : transformed.length
+           total: true ? inlineData.totalProducts : transformed.length

[NoCoverage] ConditionalExpression
src/js/script.mjs:729:16
-           total: typeof inlineData.totalProducts === 'number' ? inlineData.totalProducts : transformed.length
+           total: false ? inlineData.totalProducts : transformed.length

[NoCoverage] EqualityOperator
src/js/script.mjs:729:16
-           total: typeof inlineData.totalProducts === 'number' ? inlineData.totalProducts : transformed.length
+           total: typeof inlineData.totalProducts !== 'number' ? inlineData.totalProducts : transformed.length

[NoCoverage] StringLiteral
src/js/script.mjs:729:52
-           total: typeof inlineData.totalProducts === 'number' ? inlineData.totalProducts : transformed.length
+           total: typeof inlineData.totalProducts === "" ? inlineData.totalProducts : transformed.length

[NoCoverage] BlockStatement
src/js/script.mjs:746:83
-       if (parsed.origin !== window.location.origin || parsed.protocol !== 'https:') {
-           throw new Error('Invalid request URL: only same-origin HTTPS requests are allowed');
-       }
+       if (parsed.origin !== window.location.origin || parsed.protocol !== 'https:') {}

[NoCoverage] StringLiteral
src/js/script.mjs:747:25
-           throw new Error('Invalid request URL: only same-origin HTTPS requests are allowed');
+           throw new Error("");

[NoCoverage] ArrayDeclaration
src/js/script.mjs:809:64
-           const transformed = transformProducts(data.products || []);
+           const transformed = transformProducts(data.products || ["Stryker was here"]);

[NoCoverage] BlockStatement
src/js/script.mjs:816:27
-           if (data.version) {
-               setStoredProductVersion(data.version);
-           }
+           if (data.version) {}

[NoCoverage] BlockStatement
src/js/script.mjs:844:29
-           if (key === 'text') {
-               element.textContent = value;
-           } else {
+           if (key === 'text') {} else {

[NoCoverage] BooleanLiteral
src/js/script.mjs:860:67
-   const createProductPicture = ({ imagePath, avifPath, alt, eager = false }) => {
+   const createProductPicture = ({ imagePath, avifPath, alt, eager = true }) => {

[NoCoverage] ArrayDeclaration
src/js/script.mjs:862:29
-       const pictureChildren = [];
+       const pictureChildren = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/js/script.mjs:864:9
-       if (avifSrcset) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:864:9
-       if (avifSrcset) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:864:21
-       if (avifSrcset) {
-           pictureChildren.push(createSafeElement('source', {
-               type: 'image/avif',
-               srcset: avifSrcset,
-               sizes
-           }));
-       }
+       if (avifSrcset) {}

[NoCoverage] StringLiteral
src/js/script.mjs:865:48
-           pictureChildren.push(createSafeElement('source', {
+           pictureChildren.push(createSafeElement("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:865:58
-           pictureChildren.push(createSafeElement('source', {
-               type: 'image/avif',
-               srcset: avifSrcset,
-               sizes
-           }));
+           pictureChildren.push(createSafeElement('source', {}));

[NoCoverage] StringLiteral
src/js/script.mjs:866:19
-               type: 'image/avif',
+               type: "",

[NoCoverage] ConditionalExpression
src/js/script.mjs:871:25
-       const fallbackSrc = buildCfSrc(imagePath, { width: 320 }) || normaliseAssetPath(imagePath);
+       const fallbackSrc = true;
