[NoCoverage] ConditionalExpression
src/js/script.mjs:871:25
-       const fallbackSrc = buildCfSrc(imagePath, { width: 320 }) || normaliseAssetPath(imagePath);
+       const fallbackSrc = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:871:25
-       const fallbackSrc = buildCfSrc(imagePath, { width: 320 }) || normaliseAssetPath(imagePath);
+       const fallbackSrc = buildCfSrc(imagePath, {
+     width: 320
+   }) && normaliseAssetPath(imagePath);

[NoCoverage] ObjectLiteral
src/js/script.mjs:871:47
-       const fallbackSrc = buildCfSrc(imagePath, { width: 320 }) || normaliseAssetPath(imagePath);
+       const fallbackSrc = buildCfSrc(imagePath, {}) || normaliseAssetPath(imagePath);

[NoCoverage] ObjectLiteral
src/js/script.mjs:873:22
-       const imgAttrs = {
-           src: fallbackSrc || '',
-           alt: alt || '',
-           class: 'card-img-top product-thumb',
-           loading: eager ? 'eager' : 'lazy',
-           fetchpriority: eager ? 'high' : 'auto',
-           decoding: 'async',
-           width: '400',
-           height: '400',
-           sizes
-       };
+       const imgAttrs = {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:874:14
-           src: fallbackSrc || '',
+           src: true,

[NoCoverage] ConditionalExpression
src/js/script.mjs:874:14
-           src: fallbackSrc || '',
+           src: false,

[NoCoverage] LogicalOperator
src/js/script.mjs:874:14
-           src: fallbackSrc || '',
+           src: fallbackSrc && '',

[NoCoverage] StringLiteral
src/js/script.mjs:874:29
-           src: fallbackSrc || '',
+           src: fallbackSrc || "Stryker was here!",

[NoCoverage] ConditionalExpression
src/js/script.mjs:875:14
-           alt: alt || '',
+           alt: true,

[NoCoverage] ConditionalExpression
src/js/script.mjs:875:14
-           alt: alt || '',
+           alt: false,

[NoCoverage] LogicalOperator
src/js/script.mjs:875:14
-           alt: alt || '',
+           alt: alt && '',

[NoCoverage] StringLiteral
src/js/script.mjs:875:21
-           alt: alt || '',
+           alt: alt || "Stryker was here!",

[NoCoverage] StringLiteral
src/js/script.mjs:876:16
-           class: 'card-img-top product-thumb',
+           class: "",

[NoCoverage] StringLiteral
src/js/script.mjs:877:26
-           loading: eager ? 'eager' : 'lazy',
+           loading: eager ? "" : 'lazy',

[NoCoverage] StringLiteral
src/js/script.mjs:877:36
-           loading: eager ? 'eager' : 'lazy',
+           loading: eager ? 'eager' : "",

[NoCoverage] StringLiteral
src/js/script.mjs:878:32
-           fetchpriority: eager ? 'high' : 'auto',
+           fetchpriority: eager ? "" : 'auto',

[NoCoverage] StringLiteral
src/js/script.mjs:878:41
-           fetchpriority: eager ? 'high' : 'auto',
+           fetchpriority: eager ? 'high' : "",

[NoCoverage] StringLiteral
src/js/script.mjs:879:19
-           decoding: 'async',
+           decoding: "",

[NoCoverage] StringLiteral
src/js/script.mjs:880:16
-           width: '400',
+           width: "",

[NoCoverage] StringLiteral
src/js/script.mjs:881:17
-           height: '400',
+           height: "",

[NoCoverage] ConditionalExpression
src/js/script.mjs:884:9
-       if (fallbackSrcset) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:884:9
-       if (fallbackSrcset) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:884:25
-       if (fallbackSrcset) {
-           imgAttrs.srcset = fallbackSrcset;
-       }
+       if (fallbackSrcset) {}

[NoCoverage] StringLiteral
src/js/script.mjs:887:42
-       const imgElement = createSafeElement('img', imgAttrs);
+       const imgElement = createSafeElement("", imgAttrs);

[NoCoverage] StringLiteral
src/js/script.mjs:889:30
-       return createSafeElement('picture', {}, pictureChildren);
+       return createSafeElement("", {}, pictureChildren);

[NoCoverage] BlockStatement
src/js/script.mjs:896:21
-       if (avifSrcset) {
-           sources.push(createSafeElement('source', {
-               type: 'image/avif',
-               srcset: avifSrcset,
-               sizes
-           }));
-       }
+       if (avifSrcset) {}

[NoCoverage] StringLiteral
src/js/script.mjs:897:40
-           sources.push(createSafeElement('source', {
+           sources.push(createSafeElement("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:897:50
-           sources.push(createSafeElement('source', {
-               type: 'image/avif',
-               srcset: avifSrcset,
-               sizes
-           }));
+           sources.push(createSafeElement('source', {}));

[NoCoverage] StringLiteral
src/js/script.mjs:898:19
-               type: 'image/avif',
+               type: "",

[NoCoverage] StringLiteral
src/js/script.mjs:907:21
-           alt: alt || '',
+           alt: alt || "Stryker was here!",

[NoCoverage] BlockStatement
src/js/script.mjs:915:25
-       if (fallbackSrcset) {
-           imgAttrs.srcset = fallbackSrcset;
-       }
+       if (fallbackSrcset) {}

[NoCoverage] BlockStatement
src/js/script.mjs:932:12
-       } else {
-           console.error('Contenedor de productos no encontrado');
-       }
+       } else {}

[NoCoverage] StringLiteral
src/js/script.mjs:933:23
-           console.error('Contenedor de productos no encontrado');
+           console.error("");

[NoCoverage] BlockStatement
src/js/script.mjs:941:9
-   } catch {
-       cart = [];
-   }
+   } catch {}

[NoCoverage] ArrayDeclaration
src/js/script.mjs:942:12
-       cart = [];
+       cart = ["Stryker was here"];

[NoCoverage] BlockStatement
src/js/script.mjs:965:21
-       } catch (error) {
-           console.error('Error al guardar el carrito:', error);
-           showErrorMessage('Error al guardar el carrito. Tus cambios podrían no persistir.');
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:966:23
-           console.error('Error al guardar el carrito:', error);
+           console.error("", error);

[NoCoverage] StringLiteral
src/js/script.mjs:967:26
-           showErrorMessage('Error al guardar el carrito. Tus cambios podrían no persistir.');
+           showErrorMessage("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:971:40
-   const logPerformanceMetrics = (perf = (typeof window !== 'undefined' ? window.performance : undefined)) => {
+   const logPerformanceMetrics = (perf = (true ? window.performance : undefined)) => {

[NoCoverage] ConditionalExpression
src/js/script.mjs:971:40
-   const logPerformanceMetrics = (perf = (typeof window !== 'undefined' ? window.performance : undefined)) => {
+   const logPerformanceMetrics = (perf = (false ? window.performance : undefined)) => {

[NoCoverage] EqualityOperator
src/js/script.mjs:971:40
-   const logPerformanceMetrics = (perf = (typeof window !== 'undefined' ? window.performance : undefined)) => {
+   const logPerformanceMetrics = (perf = (typeof window === 'undefined' ? window.performance : undefined)) => {

[NoCoverage] StringLiteral
src/js/script.mjs:971:58
-   const logPerformanceMetrics = (perf = (typeof window !== 'undefined' ? window.performance : undefined)) => {
+   const logPerformanceMetrics = (perf = (typeof window !== "" ? window.performance : undefined)) => {

[NoCoverage] StringLiteral
src/js/script.mjs:972:20
-       let fcpValue = 'unavailable';
+       let fcpValue = "";

[NoCoverage] StringLiteral
src/js/script.mjs:973:33
-       let domContentLoadedValue = 'unavailable';
+       let domContentLoadedValue = "";

[NoCoverage] StringLiteral
src/js/script.mjs:974:25
-       let loadTimeValue = 'unavailable';
+       let loadTimeValue = "";

[NoCoverage] BlockStatement
src/js/script.mjs:976:9
-       try {
-           if (!perf || typeof perf.getEntriesByType !== 'function') {
-               return;
-           }
-   
-           const paintEntries = perf.getEntriesByType('paint') || [];
-           const navigationEntries = perf.getEntriesByType('navigation') || [];
-   
-           const fcpEntry = paintEntries.find(entry => entry?.name === 'first-contentful-paint') || paintEntries[0];
-           if (fcpEntry && typeof fcpEntry.startTime === 'number') {
-               fcpValue = fcpEntry.startTime;
-           }
-   
-           const navigationEntry = navigationEntries[0];
-           if (navigationEntry && typeof navigationEntry.domContentLoadedEventEnd === 'number') {
-               domContentLoadedValue = navigationEntry.domContentLoadedEventEnd;
-           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === 'number') {
-               domContentLoadedValue = perf.timing.domContentLoadedEventEnd;
-           }
-   
-           if (navigationEntry && typeof navigationEntry.loadEventEnd === 'number') {
-               loadTimeValue = navigationEntry.loadEventEnd;
-           } else if (perf.timing && typeof perf.timing.loadEventEnd === 'number') {
-               loadTimeValue = perf.timing.loadEventEnd;
-           }
-       } catch (error) {
+       try {} catch (error) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:977:13
-           if (!perf || typeof perf.getEntriesByType !== 'function') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:977:13
-           if (!perf || typeof perf.getEntriesByType !== 'function') {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:977:13
-           if (!perf || typeof perf.getEntriesByType !== 'function') {
+           if (!perf && typeof perf.getEntriesByType !== 'function') {

[NoCoverage] BooleanLiteral
src/js/script.mjs:977:13
-           if (!perf || typeof perf.getEntriesByType !== 'function') {
+           if (perf || typeof perf.getEntriesByType !== 'function') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:977:22
-           if (!perf || typeof perf.getEntriesByType !== 'function') {
+           if (!perf || false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:977:22
-           if (!perf || typeof perf.getEntriesByType !== 'function') {
+           if (!perf || typeof perf.getEntriesByType === 'function') {

[NoCoverage] StringLiteral
src/js/script.mjs:977:55
-           if (!perf || typeof perf.getEntriesByType !== 'function') {
+           if (!perf || typeof perf.getEntriesByType !== "") {

[NoCoverage] BlockStatement
src/js/script.mjs:977:67
-           if (!perf || typeof perf.getEntriesByType !== 'function') {
-               return;
-           }
+           if (!perf || typeof perf.getEntriesByType !== 'function') {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:981:30
-           const paintEntries = perf.getEntriesByType('paint') || [];
+           const paintEntries = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:981:30
-           const paintEntries = perf.getEntriesByType('paint') || [];
+           const paintEntries = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:981:30
-           const paintEntries = perf.getEntriesByType('paint') || [];
+           const paintEntries = perf.getEntriesByType('paint') && [];

[NoCoverage] StringLiteral
src/js/script.mjs:981:52
-           const paintEntries = perf.getEntriesByType('paint') || [];
+           const paintEntries = perf.getEntriesByType("") || [];

[NoCoverage] ArrayDeclaration
src/js/script.mjs:981:64
-           const paintEntries = perf.getEntriesByType('paint') || [];
+           const paintEntries = perf.getEntriesByType('paint') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/js/script.mjs:982:35
-           const navigationEntries = perf.getEntriesByType('navigation') || [];
+           const navigationEntries = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:982:35
-           const navigationEntries = perf.getEntriesByType('navigation') || [];
+           const navigationEntries = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:982:35
-           const navigationEntries = perf.getEntriesByType('navigation') || [];
+           const navigationEntries = perf.getEntriesByType('navigation') && [];

[NoCoverage] StringLiteral
src/js/script.mjs:982:57
-           const navigationEntries = perf.getEntriesByType('navigation') || [];
+           const navigationEntries = perf.getEntriesByType("") || [];

[NoCoverage] ArrayDeclaration
src/js/script.mjs:982:74
-           const navigationEntries = perf.getEntriesByType('navigation') || [];
+           const navigationEntries = perf.getEntriesByType('navigation') || ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/js/script.mjs:984:26
-           const fcpEntry = paintEntries.find(entry => entry?.name === 'first-contentful-paint') || paintEntries[0];
+           const fcpEntry = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:984:26
-           const fcpEntry = paintEntries.find(entry => entry?.name === 'first-contentful-paint') || paintEntries[0];
+           const fcpEntry = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:984:26
-           const fcpEntry = paintEntries.find(entry => entry?.name === 'first-contentful-paint') || paintEntries[0];
+           const fcpEntry = paintEntries.find(entry => entry?.name === 'first-contentful-paint') && paintEntries[0];

[NoCoverage] ArrowFunction
src/js/script.mjs:984:44
-           const fcpEntry = paintEntries.find(entry => entry?.name === 'first-contentful-paint') || paintEntries[0];
+           const fcpEntry = paintEntries.find(() => undefined) || paintEntries[0];

[NoCoverage] ConditionalExpression
src/js/script.mjs:984:53
-           const fcpEntry = paintEntries.find(entry => entry?.name === 'first-contentful-paint') || paintEntries[0];
+           const fcpEntry = paintEntries.find(entry => true) || paintEntries[0];

[NoCoverage] ConditionalExpression
src/js/script.mjs:984:53
-           const fcpEntry = paintEntries.find(entry => entry?.name === 'first-contentful-paint') || paintEntries[0];
+           const fcpEntry = paintEntries.find(entry => false) || paintEntries[0];

[NoCoverage] EqualityOperator
src/js/script.mjs:984:53
-           const fcpEntry = paintEntries.find(entry => entry?.name === 'first-contentful-paint') || paintEntries[0];
+           const fcpEntry = paintEntries.find(entry => entry?.name !== 'first-contentful-paint') || paintEntries[0];

[NoCoverage] OptionalChaining
src/js/script.mjs:984:53
-           const fcpEntry = paintEntries.find(entry => entry?.name === 'first-contentful-paint') || paintEntries[0];
+           const fcpEntry = paintEntries.find(entry => entry.name === 'first-contentful-paint') || paintEntries[0];

[NoCoverage] StringLiteral
src/js/script.mjs:984:69
-           const fcpEntry = paintEntries.find(entry => entry?.name === 'first-contentful-paint') || paintEntries[0];
+           const fcpEntry = paintEntries.find(entry => entry?.name === "") || paintEntries[0];

[NoCoverage] ConditionalExpression
src/js/script.mjs:985:13
-           if (fcpEntry && typeof fcpEntry.startTime === 'number') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:985:13
-           if (fcpEntry && typeof fcpEntry.startTime === 'number') {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:985:13
-           if (fcpEntry && typeof fcpEntry.startTime === 'number') {
+           if (fcpEntry || typeof fcpEntry.startTime === 'number') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:985:25
-           if (fcpEntry && typeof fcpEntry.startTime === 'number') {
+           if (fcpEntry && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:985:25
-           if (fcpEntry && typeof fcpEntry.startTime === 'number') {
+           if (fcpEntry && typeof fcpEntry.startTime !== 'number') {

[NoCoverage] StringLiteral
src/js/script.mjs:985:55
-           if (fcpEntry && typeof fcpEntry.startTime === 'number') {
+           if (fcpEntry && typeof fcpEntry.startTime === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:985:65
-           if (fcpEntry && typeof fcpEntry.startTime === 'number') {
-               fcpValue = fcpEntry.startTime;
-           }
+           if (fcpEntry && typeof fcpEntry.startTime === 'number') {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:990:13
-           if (navigationEntry && typeof navigationEntry.domContentLoadedEventEnd === 'number') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:990:13
-           if (navigationEntry && typeof navigationEntry.domContentLoadedEventEnd === 'number') {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:990:13
-           if (navigationEntry && typeof navigationEntry.domContentLoadedEventEnd === 'number') {
+           if (navigationEntry || typeof navigationEntry.domContentLoadedEventEnd === 'number') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:990:32
-           if (navigationEntry && typeof navigationEntry.domContentLoadedEventEnd === 'number') {
+           if (navigationEntry && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:990:32
-           if (navigationEntry && typeof navigationEntry.domContentLoadedEventEnd === 'number') {
+           if (navigationEntry && typeof navigationEntry.domContentLoadedEventEnd !== 'number') {

[NoCoverage] StringLiteral
src/js/script.mjs:990:84
-           if (navigationEntry && typeof navigationEntry.domContentLoadedEventEnd === 'number') {
+           if (navigationEntry && typeof navigationEntry.domContentLoadedEventEnd === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:990:94
-           if (navigationEntry && typeof navigationEntry.domContentLoadedEventEnd === 'number') {
-               domContentLoadedValue = navigationEntry.domContentLoadedEventEnd;
-           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === 'number') {
+           if (navigationEntry && typeof navigationEntry.domContentLoadedEventEnd === 'number') {} else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === 'number') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:992:20
-           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === 'number') {
+           } else if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:992:20
-           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === 'number') {
+           } else if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:992:20
-           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === 'number') {
+           } else if (perf.timing || typeof perf.timing.domContentLoadedEventEnd === 'number') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:992:35
-           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === 'number') {
+           } else if (perf.timing && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:992:35
-           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === 'number') {
+           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd !== 'number') {

[NoCoverage] StringLiteral
src/js/script.mjs:992:83
-           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === 'number') {
+           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:992:93
-           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === 'number') {
-               domContentLoadedValue = perf.timing.domContentLoadedEventEnd;
-           }
+           } else if (perf.timing && typeof perf.timing.domContentLoadedEventEnd === 'number') {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:996:13
-           if (navigationEntry && typeof navigationEntry.loadEventEnd === 'number') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:996:13
-           if (navigationEntry && typeof navigationEntry.loadEventEnd === 'number') {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:996:13
-           if (navigationEntry && typeof navigationEntry.loadEventEnd === 'number') {
+           if (navigationEntry || typeof navigationEntry.loadEventEnd === 'number') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:996:32
-           if (navigationEntry && typeof navigationEntry.loadEventEnd === 'number') {
+           if (navigationEntry && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:996:32
-           if (navigationEntry && typeof navigationEntry.loadEventEnd === 'number') {
+           if (navigationEntry && typeof navigationEntry.loadEventEnd !== 'number') {

[NoCoverage] StringLiteral
src/js/script.mjs:996:72
-           if (navigationEntry && typeof navigationEntry.loadEventEnd === 'number') {
+           if (navigationEntry && typeof navigationEntry.loadEventEnd === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:996:82
-           if (navigationEntry && typeof navigationEntry.loadEventEnd === 'number') {
-               loadTimeValue = navigationEntry.loadEventEnd;
-           } else if (perf.timing && typeof perf.timing.loadEventEnd === 'number') {
+           if (navigationEntry && typeof navigationEntry.loadEventEnd === 'number') {} else if (perf.timing && typeof perf.timing.loadEventEnd === 'number') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:998:20
-           } else if (perf.timing && typeof perf.timing.loadEventEnd === 'number') {
+           } else if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:998:20
-           } else if (perf.timing && typeof perf.timing.loadEventEnd === 'number') {
+           } else if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:998:20
-           } else if (perf.timing && typeof perf.timing.loadEventEnd === 'number') {
+           } else if (perf.timing || typeof perf.timing.loadEventEnd === 'number') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:998:35
-           } else if (perf.timing && typeof perf.timing.loadEventEnd === 'number') {
+           } else if (perf.timing && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:998:35
-           } else if (perf.timing && typeof perf.timing.loadEventEnd === 'number') {
+           } else if (perf.timing && typeof perf.timing.loadEventEnd !== 'number') {

[NoCoverage] StringLiteral
src/js/script.mjs:998:71
-           } else if (perf.timing && typeof perf.timing.loadEventEnd === 'number') {
+           } else if (perf.timing && typeof perf.timing.loadEventEnd === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:998:81
-           } else if (perf.timing && typeof perf.timing.loadEventEnd === 'number') {
-               loadTimeValue = perf.timing.loadEventEnd;
-           }
+           } else if (perf.timing && typeof perf.timing.loadEventEnd === 'number') {}

[NoCoverage] BlockStatement
src/js/script.mjs:1001:21
-       } catch (error) {
-           console.warn('Performance metrics unavailable:', error);
-       } finally {
+       } catch (error) {} finally {

[NoCoverage] StringLiteral
src/js/script.mjs:1002:22
-           console.warn('Performance metrics unavailable:', error);
+           console.warn("", error);

[NoCoverage] BlockStatement
src/js/script.mjs:1003:15
-       } finally {
-           console.log('First Contentful Paint:', fcpValue);
-           console.log('DOM Content Loaded:', domContentLoadedValue);
-           console.log('Load Time:', loadTimeValue);
-       }
+       } finally {}

[NoCoverage] StringLiteral
src/js/script.mjs:1004:21
-           console.log('First Contentful Paint:', fcpValue);
+           console.log("", fcpValue);

[NoCoverage] StringLiteral
src/js/script.mjs:1005:21
-           console.log('DOM Content Loaded:', domContentLoadedValue);
+           console.log("", domContentLoadedValue);

[NoCoverage] StringLiteral
src/js/script.mjs:1006:21
-           console.log('Load Time:', loadTimeValue);
+           console.log("", loadTimeValue);

[NoCoverage] BlockStatement
src/js/script.mjs:1084:32
-           if (isSubcategoryPage) {
-               adjustedImagePath = `../${(item.image_path || '').replace(/^\//, '')}`;
-           } else {
+           if (isSubcategoryPage) {} else {

[NoCoverage] StringLiteral
src/js/script.mjs:1085:33
-               adjustedImagePath = `../${(item.image_path || '').replace(/^\//, '')}`;
+               adjustedImagePath = ``;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1085:40
-               adjustedImagePath = `../${(item.image_path || '').replace(/^\//, '')}`;
+               adjustedImagePath = `../${(true).replace(/^\//, '')}`;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1085:40
-               adjustedImagePath = `../${(item.image_path || '').replace(/^\//, '')}`;
+               adjustedImagePath = `../${(false).replace(/^\//, '')}`;

[NoCoverage] LogicalOperator
src/js/script.mjs:1085:40
-               adjustedImagePath = `../${(item.image_path || '').replace(/^\//, '')}`;
+               adjustedImagePath = `../${(item.image_path && '').replace(/^\//, '')}`;

[NoCoverage] StringLiteral
src/js/script.mjs:1085:59
-               adjustedImagePath = `../${(item.image_path || '').replace(/^\//, '')}`;
+               adjustedImagePath = `../${(item.image_path || "Stryker was here!").replace(/^\//, '')}`;

[NoCoverage] Regex
src/js/script.mjs:1085:71
-               adjustedImagePath = `../${(item.image_path || '').replace(/^\//, '')}`;
+               adjustedImagePath = `../${(item.image_path || '').replace(/\//, '')}`;

[NoCoverage] StringLiteral
src/js/script.mjs:1085:78
-               adjustedImagePath = `../${(item.image_path || '').replace(/^\//, '')}`;
+               adjustedImagePath = `../${(item.image_path || '').replace(/^\//, "Stryker was here!")}`;

[NoCoverage] BlockStatement
src/js/script.mjs:1100:72
-               if (!fallbackImg.getAttribute('src') && adjustedImagePath) {
-                   fallbackImg.setAttribute('src', adjustedImagePath);
-               }
+               if (!fallbackImg.getAttribute('src') && adjustedImagePath) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1101:42
-                   fallbackImg.setAttribute('src', adjustedImagePath);
+                   fallbackImg.setAttribute("", adjustedImagePath);

[NoCoverage] BlockStatement
src/js/script.mjs:1103:57
-               if (Array.isArray(item.thumbnail_variants)) {
-                   const parts = item.thumbnail_variants
-                       .filter(v => v && v.url && v.width)
-                       .map(v => `${v.url} ${v.width}w`);
-                   if (parts.length) {
-                       fallbackImg.setAttribute('srcset', parts.join(', '));
-                       fallbackImg.setAttribute('sizes', '100px');
-                   }
-               } else if (!fallbackImg.getAttribute('sizes')) {
+               if (Array.isArray(item.thumbnail_variants)) {} else if (!fallbackImg.getAttribute('sizes')) {

[NoCoverage] MethodExpression
src/js/script.mjs:1104:31
-                   const parts = item.thumbnail_variants
-                       .filter(v => v && v.url && v.width)
+                   const parts = item.thumbnail_variants

[NoCoverage] ArrowFunction
src/js/script.mjs:1105:29
-                       .filter(v => v && v.url && v.width)
+                       .filter(() => undefined)

[NoCoverage] ConditionalExpression
src/js/script.mjs:1105:34
-                       .filter(v => v && v.url && v.width)
+                       .filter(v => true)

[NoCoverage] ConditionalExpression
src/js/script.mjs:1105:34
-                       .filter(v => v && v.url && v.width)
+                       .filter(v => false)

[NoCoverage] LogicalOperator
src/js/script.mjs:1105:34
-                       .filter(v => v && v.url && v.width)
+                       .filter(v => v && v.url || v.width)

[NoCoverage] ConditionalExpression
src/js/script.mjs:1105:34
-                       .filter(v => v && v.url && v.width)
+                       .filter(v => true && v.width)

[NoCoverage] LogicalOperator
src/js/script.mjs:1105:34
-                       .filter(v => v && v.url && v.width)
+                       .filter(v => v || v.url && v.width)

[NoCoverage] ArrowFunction
src/js/script.mjs:1106:26
-                       .map(v => `${v.url} ${v.width}w`);
+                       .map(() => undefined);

[NoCoverage] StringLiteral
src/js/script.mjs:1106:31
-                       .map(v => `${v.url} ${v.width}w`);
+                       .map(v => ``);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1107:21
-                   if (parts.length) {
+                   if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1107:21
-                   if (parts.length) {
+                   if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1107:35
-                   if (parts.length) {
-                       fallbackImg.setAttribute('srcset', parts.join(', '));
-                       fallbackImg.setAttribute('sizes', '100px');
-                   }
+                   if (parts.length) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1108:46
-                       fallbackImg.setAttribute('srcset', parts.join(', '));
+                       fallbackImg.setAttribute("", parts.join(', '));

[NoCoverage] StringLiteral
src/js/script.mjs:1108:67
-                       fallbackImg.setAttribute('srcset', parts.join(', '));
+                       fallbackImg.setAttribute('srcset', parts.join(""));

[NoCoverage] StringLiteral
src/js/script.mjs:1109:46
-                       fallbackImg.setAttribute('sizes', '100px');
+                       fallbackImg.setAttribute("", '100px');
