[NoCoverage] StringLiteral
src/js/script.mjs:1109:55
-                       fallbackImg.setAttribute('sizes', '100px');
+                       fallbackImg.setAttribute('sizes', "");

[NoCoverage] BlockStatement
src/js/script.mjs:1111:60
-               } else if (!fallbackImg.getAttribute('sizes')) {
-                   fallbackImg.setAttribute('sizes', '100px');
-               }
+               } else if (!fallbackImg.getAttribute('sizes')) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1112:42
-                   fallbackImg.setAttribute('sizes', '100px');
+                   fallbackImg.setAttribute("", '100px');

[NoCoverage] StringLiteral
src/js/script.mjs:1112:51
-                   fallbackImg.setAttribute('sizes', '100px');
+                   fallbackImg.setAttribute('sizes', "");

[NoCoverage] BlockStatement
src/js/script.mjs:1128:23
-       if (creditOption) {
-           if (total >= 30000) {
-               creditOption.classList.remove('d-none');
-           } else {
-               creditOption.classList.add('d-none');
-               const creditInput = creditOption.querySelector('input');
-               if (creditInput) {
-                   creditInput.checked = false;
-               }
-           }
-       }
+       if (creditOption) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1129:13
-           if (total >= 30000) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1129:13
-           if (total >= 30000) {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1129:13
-           if (total >= 30000) {
+           if (total > 30000) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1129:13
-           if (total >= 30000) {
+           if (total < 30000) {

[NoCoverage] BlockStatement
src/js/script.mjs:1129:29
-           if (total >= 30000) {
-               creditOption.classList.remove('d-none');
-           } else {
+           if (total >= 30000) {} else {

[NoCoverage] StringLiteral
src/js/script.mjs:1130:43
-               creditOption.classList.remove('d-none');
+               creditOption.classList.remove("");

[NoCoverage] BlockStatement
src/js/script.mjs:1131:16
-           } else {
-               creditOption.classList.add('d-none');
-               const creditInput = creditOption.querySelector('input');
-               if (creditInput) {
-                   creditInput.checked = false;
-               }
-           }
+           } else {}

[NoCoverage] StringLiteral
src/js/script.mjs:1132:40
-               creditOption.classList.add('d-none');
+               creditOption.classList.add("");

[NoCoverage] StringLiteral
src/js/script.mjs:1133:60
-               const creditInput = creditOption.querySelector('input');
+               const creditInput = creditOption.querySelector("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1134:17
-               if (creditInput) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1134:17
-               if (creditInput) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1134:30
-               if (creditInput) {
-                   creditInput.checked = false;
-               }
+               if (creditInput) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:1135:39
-                   creditInput.checked = false;
+                   creditInput.checked = true;

[NoCoverage] BlockStatement
src/js/script.mjs:1168:21
-       } catch (error) {
-           console.error('Error al agregar al carrito:', error);
-           showErrorMessage('Error al agregar el artículo al carrito. Por favor, intenta nuevamente.');
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1169:23
-           console.error('Error al agregar al carrito:', error);
+           console.error("", error);

[NoCoverage] StringLiteral
src/js/script.mjs:1170:26
-           showErrorMessage('Error al agregar el artículo al carrito. Por favor, intenta nuevamente.');
+           showErrorMessage("");

[NoCoverage] BlockStatement
src/js/script.mjs:1187:21
-       } catch (error) {
-           console.error('Error al eliminar del carrito:', error);
-           showErrorMessage('Error al eliminar el artículo del carrito. Por favor, intenta nuevamente.');
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1188:23
-           console.error('Error al eliminar del carrito:', error);
+           console.error("", error);

[NoCoverage] StringLiteral
src/js/script.mjs:1189:26
-           showErrorMessage('Error al eliminar el artículo del carrito. Por favor, intenta nuevamente.');
+           showErrorMessage("");

[NoCoverage] StringLiteral
src/js/script.mjs:1219:65
-                   setTimeout(() => quantityInput.classList.remove('quantity-changed'), 300);
+                   setTimeout(() => quantityInput.classList.remove(""), 300);

[NoCoverage] BlockStatement
src/js/script.mjs:1222:21
-       } catch (error) {
-           console.error('Error al actualizar cantidad:', error);
-           showErrorMessage('Error al actualizar la cantidad. Por favor, intenta nuevamente.');
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1223:23
-           console.error('Error al actualizar cantidad:', error);
+           console.error("", error);

[NoCoverage] StringLiteral
src/js/script.mjs:1224:26
-           showErrorMessage('Error al actualizar la cantidad. Por favor, intenta nuevamente.');
+           showErrorMessage("");

[NoCoverage] BlockStatement
src/js/script.mjs:1228:25
-   const emptyCart = () => {
-       try {
-           cart = [];
-           saveCart();
-           updateCartIcon();
-           renderCart();
-           if (typeof updateProductDisplay === 'function') {
-               updateProductDisplay();
-           }
-       } catch (error) {
-           console.error('Error al vaciar el carrito:', error);
-           showErrorMessage('Error al vaciar el carrito. Por favor, inténtelo de nuevo.');
-       }
-   };
+   const emptyCart = () => {};

[NoCoverage] BlockStatement
src/js/script.mjs:1229:9
-       try {
-           cart = [];
-           saveCart();
-           updateCartIcon();
-           renderCart();
-           if (typeof updateProductDisplay === 'function') {
-               updateProductDisplay();
-           }
-       } catch (error) {
+       try {} catch (error) {

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1230:16
-           cart = [];
+           cart = ["Stryker was here"];

[NoCoverage] ConditionalExpression
src/js/script.mjs:1234:13
-           if (typeof updateProductDisplay === 'function') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1234:13
-           if (typeof updateProductDisplay === 'function') {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1234:13
-           if (typeof updateProductDisplay === 'function') {
+           if (typeof updateProductDisplay !== 'function') {

[NoCoverage] StringLiteral
src/js/script.mjs:1234:45
-           if (typeof updateProductDisplay === 'function') {
+           if (typeof updateProductDisplay === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:1234:57
-           if (typeof updateProductDisplay === 'function') {
-               updateProductDisplay();
-           }
+           if (typeof updateProductDisplay === 'function') {}

[NoCoverage] BlockStatement
src/js/script.mjs:1237:21
-       } catch (error) {
-           console.error('Error al vaciar el carrito:', error);
-           showErrorMessage('Error al vaciar el carrito. Por favor, inténtelo de nuevo.');
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1238:23
-           console.error('Error al vaciar el carrito:', error);
+           console.error("", error);

[NoCoverage] StringLiteral
src/js/script.mjs:1239:26
-           showErrorMessage('Error al vaciar el carrito. Por favor, inténtelo de nuevo.');
+           showErrorMessage("");

[NoCoverage] BlockStatement
src/js/script.mjs:1247:49
-       window.addEventListener('error', (event) => {
-           const target = event.target || event.srcElement;
-           const isResourceError = !!(target && (
-               target.tagName === 'IMG' ||
-               target.tagName === 'SCRIPT' ||
-               target.tagName === 'LINK'
-           ));
-           const hasRuntimeError = !!event.error;
-   
-           // Ignore resource errors and non-runtime errors
-           if (isResourceError || !hasRuntimeError) {
-               console.warn('Ignored non-fatal error:', {
-                   tag: target && target.tagName,
-                   src: target && (target.src || target.href || target.currentSrc)
-               });
-               return;
-           }
-   
-           // Only show banner after the app is ready; otherwise just log
-           if (!window.__APP_READY__) {
-               console.error('Runtime error before app ready:', event.error);
-               return;
-           }
-           console.error('Unhandled JS error:', event.error);
-           showErrorMessage('Ocurrió un error inesperado. Por favor, recarga la página.');
-       });
+       window.addEventListener('error', (event) => {});

[NoCoverage] ConditionalExpression
src/js/script.mjs:1248:24
-           const target = event.target || event.srcElement;
+           const target = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1248:24
-           const target = event.target || event.srcElement;
+           const target = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1248:24
-           const target = event.target || event.srcElement;
+           const target = event.target && event.srcElement;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1249:33
-           const isResourceError = !!(target && (
-               target.tagName === 'IMG' ||
-               target.tagName === 'SCRIPT' ||
-               target.tagName === 'LINK'
-           ));
+           const isResourceError = !(target && (target.tagName === 'IMG' || target.tagName === 'SCRIPT' || target.tagName === 'LINK'));

[NoCoverage] BooleanLiteral
src/js/script.mjs:1249:34
-           const isResourceError = !!(target && (
-               target.tagName === 'IMG' ||
-               target.tagName === 'SCRIPT' ||
-               target.tagName === 'LINK'
-           ));
+           const isResourceError = !target && (target.tagName === 'IMG' || target.tagName === 'SCRIPT' || target.tagName === 'LINK');

[NoCoverage] ConditionalExpression
src/js/script.mjs:1249:36
-           const isResourceError = !!(target && (
-               target.tagName === 'IMG' ||
-               target.tagName === 'SCRIPT' ||
-               target.tagName === 'LINK'
-           ));
+           const isResourceError = !!(true);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1249:36
-           const isResourceError = !!(target && (
-               target.tagName === 'IMG' ||
-               target.tagName === 'SCRIPT' ||
-               target.tagName === 'LINK'
-           ));
+           const isResourceError = !!(false);

[NoCoverage] LogicalOperator
src/js/script.mjs:1249:36
-           const isResourceError = !!(target && (
-               target.tagName === 'IMG' ||
-               target.tagName === 'SCRIPT' ||
-               target.tagName === 'LINK'
-           ));
+           const isResourceError = !!(target || target.tagName === 'IMG' || target.tagName === 'SCRIPT' || target.tagName === 'LINK');

[NoCoverage] ConditionalExpression
src/js/script.mjs:1250:13
-               target.tagName === 'IMG' ||
-               target.tagName === 'SCRIPT' ||
-               target.tagName === 'LINK'
+               true

[NoCoverage] LogicalOperator
src/js/script.mjs:1250:13
-               target.tagName === 'IMG' ||
-               target.tagName === 'SCRIPT' ||
-               target.tagName === 'LINK'
+               (target.tagName === 'IMG' || target.tagName === 'SCRIPT') && target.tagName === 'LINK'

[NoCoverage] ConditionalExpression
src/js/script.mjs:1250:13
-               target.tagName === 'IMG' ||
-               target.tagName === 'SCRIPT' ||
+               false ||

[NoCoverage] LogicalOperator
src/js/script.mjs:1250:13
-               target.tagName === 'IMG' ||
-               target.tagName === 'SCRIPT' ||
+               target.tagName === 'IMG' && target.tagName === 'SCRIPT' ||

[NoCoverage] ConditionalExpression
src/js/script.mjs:1250:13
-               target.tagName === 'IMG' ||
+               false ||

[NoCoverage] EqualityOperator
src/js/script.mjs:1250:13
-               target.tagName === 'IMG' ||
+               target.tagName !== 'IMG' ||

[NoCoverage] StringLiteral
src/js/script.mjs:1250:32
-               target.tagName === 'IMG' ||
+               target.tagName === "" ||

[NoCoverage] ConditionalExpression
src/js/script.mjs:1251:13
-               target.tagName === 'SCRIPT' ||
+               false ||

[NoCoverage] EqualityOperator
src/js/script.mjs:1251:13
-               target.tagName === 'SCRIPT' ||
+               target.tagName !== 'SCRIPT' ||

[NoCoverage] StringLiteral
src/js/script.mjs:1251:32
-               target.tagName === 'SCRIPT' ||
+               target.tagName === "" ||

[NoCoverage] ConditionalExpression
src/js/script.mjs:1252:13
-               target.tagName === 'LINK'
+               false

[NoCoverage] EqualityOperator
src/js/script.mjs:1252:13
-               target.tagName === 'LINK'
+               target.tagName !== 'LINK'

[NoCoverage] StringLiteral
src/js/script.mjs:1252:32
-               target.tagName === 'LINK'
+               target.tagName === ""

[NoCoverage] BooleanLiteral
src/js/script.mjs:1254:33
-           const hasRuntimeError = !!event.error;
+           const hasRuntimeError = !event.error;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1254:34
-           const hasRuntimeError = !!event.error;
+           const hasRuntimeError = !event.error;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1257:13
-           if (isResourceError || !hasRuntimeError) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1257:13
-           if (isResourceError || !hasRuntimeError) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1257:13
-           if (isResourceError || !hasRuntimeError) {
+           if (isResourceError && !hasRuntimeError) {

[NoCoverage] BooleanLiteral
src/js/script.mjs:1257:32
-           if (isResourceError || !hasRuntimeError) {
+           if (isResourceError || hasRuntimeError) {

[NoCoverage] BlockStatement
src/js/script.mjs:1257:50
-           if (isResourceError || !hasRuntimeError) {
-               console.warn('Ignored non-fatal error:', {
-                   tag: target && target.tagName,
-                   src: target && (target.src || target.href || target.currentSrc)
-               });
-               return;
-           }
+           if (isResourceError || !hasRuntimeError) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1258:26
-               console.warn('Ignored non-fatal error:', {
+               console.warn("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1258:54
-               console.warn('Ignored non-fatal error:', {
-                   tag: target && target.tagName,
-                   src: target && (target.src || target.href || target.currentSrc)
-               });
+               console.warn('Ignored non-fatal error:', {});

[NoCoverage] ConditionalExpression
src/js/script.mjs:1259:22
-                   tag: target && target.tagName,
+                   tag: true,

[NoCoverage] ConditionalExpression
src/js/script.mjs:1259:22
-                   tag: target && target.tagName,
+                   tag: false,

[NoCoverage] LogicalOperator
src/js/script.mjs:1259:22
-                   tag: target && target.tagName,
+                   tag: target || target.tagName,

[NoCoverage] ConditionalExpression
src/js/script.mjs:1260:22
-                   src: target && (target.src || target.href || target.currentSrc)
+                   src: true

[NoCoverage] ConditionalExpression
src/js/script.mjs:1260:22
-                   src: target && (target.src || target.href || target.currentSrc)
+                   src: false

[NoCoverage] LogicalOperator
src/js/script.mjs:1260:22
-                   src: target && (target.src || target.href || target.currentSrc)
+                   src: target || target.src || target.href || target.currentSrc

[NoCoverage] ConditionalExpression
src/js/script.mjs:1260:33
-                   src: target && (target.src || target.href || target.currentSrc)
+                   src: target && (true)

[NoCoverage] LogicalOperator
src/js/script.mjs:1260:33
-                   src: target && (target.src || target.href || target.currentSrc)
+                   src: target && ((target.src || target.href) && target.currentSrc)

[NoCoverage] ConditionalExpression
src/js/script.mjs:1260:33
-                   src: target && (target.src || target.href || target.currentSrc)
+                   src: target && (false || target.currentSrc)

[NoCoverage] LogicalOperator
src/js/script.mjs:1260:33
-                   src: target && (target.src || target.href || target.currentSrc)
+                   src: target && (target.src && target.href || target.currentSrc)

[NoCoverage] BooleanLiteral
src/js/script.mjs:1266:13
-           if (!window.__APP_READY__) {
+           if (window.__APP_READY__) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1266:13
-           if (!window.__APP_READY__) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1266:13
-           if (!window.__APP_READY__) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1266:36
-           if (!window.__APP_READY__) {
-               console.error('Runtime error before app ready:', event.error);
-               return;
-           }
+           if (!window.__APP_READY__) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1267:27
-               console.error('Runtime error before app ready:', event.error);
+               console.error("", event.error);

[NoCoverage] StringLiteral
src/js/script.mjs:1270:23
-           console.error('Unhandled JS error:', event.error);
+           console.error("", event.error);

[NoCoverage] StringLiteral
src/js/script.mjs:1271:26
-           showErrorMessage('Ocurrió un error inesperado. Por favor, recarga la página.');
+           showErrorMessage("");

[NoCoverage] StringLiteral
src/js/script.mjs:1276:22
-           console.warn('CSP violation (logged only):', {
+           console.warn("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1276:54
-           console.warn('CSP violation (logged only):', {
-               blockedURI: e.blockedURI,
-               violatedDirective: e.violatedDirective,
-               sourceFile: e.sourceFile,
-           });
+           console.warn('CSP violation (logged only):', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1286:17
-       console.log('Initializing app...');
+       console.log("");

[NoCoverage] StringLiteral
src/js/script.mjs:1288:54
-       const productContainer = document.getElementById('product-container');
+       const productContainer = document.getElementById("");

[NoCoverage] StringLiteral
src/js/script.mjs:1289:49
-       const sortOptions = document.getElementById('sort-options');
+       const sortOptions = document.getElementById("");

[NoCoverage] StringLiteral
src/js/script.mjs:1290:51
-       const filterKeyword = document.getElementById('filter-keyword');
+       const filterKeyword = document.getElementById("");

[NoCoverage] StringLiteral
src/js/script.mjs:1291:54
-       const cartCountElement = document.getElementById('cart-count');
+       const cartCountElement = document.getElementById("");

[NoCoverage] StringLiteral
src/js/script.mjs:1292:54
-       const cartItemsElement = document.getElementById('cart-items');
+       const cartItemsElement = document.getElementById("");

[NoCoverage] StringLiteral
src/js/script.mjs:1293:54
-       const cartTotalElement = document.getElementById('cart-total');
+       const cartTotalElement = document.getElementById("");

[NoCoverage] ObjectLiteral
src/js/script.mjs:1295:31
-       const essentialElements = {
-           '#product-container': productContainer,
-           '#sort-options': sortOptions,
-           '#filter-keyword': filterKeyword,
-           '#cart-count': cartCountElement,
-           '#cart-items': cartItemsElement,
-           '#cart-total': cartTotalElement
-       };
+       const essentialElements = {};

[NoCoverage] MethodExpression
src/js/script.mjs:1304:30
-       const missingSelectors = Object.entries(essentialElements)
-           .filter(([, element]) => !element)
+       const missingSelectors = Object.entries(essentialElements)

[NoCoverage] ArrowFunction
src/js/script.mjs:1305:17
-           .filter(([, element]) => !element)
+           .filter(() => undefined)

[NoCoverage] BooleanLiteral
src/js/script.mjs:1305:34
-           .filter(([, element]) => !element)
+           .filter(([, element]) => element)

[NoCoverage] ArrowFunction
src/js/script.mjs:1306:14
-           .map(([selector]) => selector);
+           .map(() => undefined);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1308:9
-       if (missingSelectors.length) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1308:9
-       if (missingSelectors.length) {
+       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1308:34
-       if (missingSelectors.length) {
-           log('warn', 'init_app_missing_dom', {
-               missingSelectors,
-               location: typeof window !== 'undefined' ? window.location?.pathname : 'unknown'
-           });
-           return;
-       }
+       if (missingSelectors.length) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1309:13
-           log('warn', 'init_app_missing_dom', {
+           log("", 'init_app_missing_dom', {

[NoCoverage] StringLiteral
src/js/script.mjs:1309:21
-           log('warn', 'init_app_missing_dom', {
+           log('warn', "", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1309:45
-           log('warn', 'init_app_missing_dom', {
-               missingSelectors,
-               location: typeof window !== 'undefined' ? window.location?.pathname : 'unknown'
-           });
+           log('warn', 'init_app_missing_dom', {});

[NoCoverage] ConditionalExpression
src/js/script.mjs:1311:23
-               location: typeof window !== 'undefined' ? window.location?.pathname : 'unknown'
+               location: true ? window.location?.pathname : 'unknown'

[NoCoverage] ConditionalExpression
src/js/script.mjs:1311:23
-               location: typeof window !== 'undefined' ? window.location?.pathname : 'unknown'
+               location: false ? window.location?.pathname : 'unknown'

[NoCoverage] EqualityOperator
src/js/script.mjs:1311:23
-               location: typeof window !== 'undefined' ? window.location?.pathname : 'unknown'
+               location: typeof window === 'undefined' ? window.location?.pathname : 'unknown'

[NoCoverage] StringLiteral
src/js/script.mjs:1311:41
-               location: typeof window !== 'undefined' ? window.location?.pathname : 'unknown'
+               location: typeof window !== "" ? window.location?.pathname : 'unknown'

[NoCoverage] OptionalChaining
src/js/script.mjs:1311:55
-               location: typeof window !== 'undefined' ? window.location?.pathname : 'unknown'
+               location: typeof window !== 'undefined' ? window.location.pathname : 'unknown'

[NoCoverage] StringLiteral
src/js/script.mjs:1311:83
-               location: typeof window !== 'undefined' ? window.location?.pathname : 'unknown'
+               location: typeof window !== 'undefined' ? window.location?.pathname : ""

[NoCoverage] BlockStatement
src/js/script.mjs:1317:40
-       const ensureDiscountToggle = () => {
-           let toggle = document.getElementById('filter-discount');
-           if (toggle) return toggle;
-   
-           const filterSection = document.querySelector('section[aria-label*="filtrado"], section[aria-label*="Opciones de filtrado"]');
-           const filterSectionRow = filterSection ? filterSection.querySelector('.row') : null;
-           if (!filterSectionRow) return null;
-   
-           const col = createSafeElement('div', { class: 'col-12 mt-2' });
-           const formCheck = createSafeElement('div', { class: 'form-check form-switch' });
-           const input = createSafeElement('input', {
-               class: 'form-check-input',
-               type: 'checkbox',
-               id: 'filter-discount',
-               'aria-label': 'Mostrar solo productos con descuento'
-           });
-           const label = createSafeElement('label', { class: 'form-check-label', for: 'filter-discount' }, ['Solo productos con descuento']);
-           formCheck.appendChild(input);
-           formCheck.appendChild(label);
-           col.appendChild(formCheck);
-           filterSectionRow.appendChild(col);
-           return input;
-       };
+       const ensureDiscountToggle = () => {};

[NoCoverage] StringLiteral
src/js/script.mjs:1318:46
-           let toggle = document.getElementById('filter-discount');
+           let toggle = document.getElementById("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1319:13
-           if (toggle) return toggle;
+           if (true) return toggle;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1319:13
-           if (toggle) return toggle;
+           if (false) return toggle;

[NoCoverage] StringLiteral
src/js/script.mjs:1321:54
-           const filterSection = document.querySelector('section[aria-label*="filtrado"], section[aria-label*="Opciones de filtrado"]');
+           const filterSection = document.querySelector("");

[NoCoverage] StringLiteral
src/js/script.mjs:1322:78
-           const filterSectionRow = filterSection ? filterSection.querySelector('.row') : null;
+           const filterSectionRow = filterSection ? filterSection.querySelector("") : null;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1323:13
-           if (!filterSectionRow) return null;
+           if (filterSectionRow) return null;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1323:13
-           if (!filterSectionRow) return null;
+           if (true) return null;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1323:13
-           if (!filterSectionRow) return null;
+           if (false) return null;

[NoCoverage] StringLiteral
src/js/script.mjs:1325:39
-           const col = createSafeElement('div', { class: 'col-12 mt-2' });
+           const col = createSafeElement("", { class: 'col-12 mt-2' });

[NoCoverage] ObjectLiteral
src/js/script.mjs:1325:46
-           const col = createSafeElement('div', { class: 'col-12 mt-2' });
+           const col = createSafeElement('div', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1325:55
-           const col = createSafeElement('div', { class: 'col-12 mt-2' });
+           const col = createSafeElement('div', { class: "" });

[NoCoverage] StringLiteral
src/js/script.mjs:1326:45
-           const formCheck = createSafeElement('div', { class: 'form-check form-switch' });
+           const formCheck = createSafeElement("", { class: 'form-check form-switch' });

[NoCoverage] ObjectLiteral
src/js/script.mjs:1326:52
-           const formCheck = createSafeElement('div', { class: 'form-check form-switch' });
+           const formCheck = createSafeElement('div', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1326:61
-           const formCheck = createSafeElement('div', { class: 'form-check form-switch' });
+           const formCheck = createSafeElement('div', { class: "" });

[NoCoverage] StringLiteral
src/js/script.mjs:1327:41
-           const input = createSafeElement('input', {
+           const input = createSafeElement("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1327:50
-           const input = createSafeElement('input', {
-               class: 'form-check-input',
-               type: 'checkbox',
-               id: 'filter-discount',
-               'aria-label': 'Mostrar solo productos con descuento'
-           });
+           const input = createSafeElement('input', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1328:20
-               class: 'form-check-input',
+               class: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1329:19
-               type: 'checkbox',
+               type: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1330:17
-               id: 'filter-discount',
+               id: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1331:27
-               'aria-label': 'Mostrar solo productos con descuento'
+               'aria-label': ""

[NoCoverage] StringLiteral
src/js/script.mjs:1333:41
-           const label = createSafeElement('label', { class: 'form-check-label', for: 'filter-discount' }, ['Solo productos con descuento']);
+           const label = createSafeElement("", { class: 'form-check-label', for: 'filter-discount' }, ['Solo productos con descuento']);

[NoCoverage] ObjectLiteral
src/js/script.mjs:1333:50
-           const label = createSafeElement('label', { class: 'form-check-label', for: 'filter-discount' }, ['Solo productos con descuento']);
+           const label = createSafeElement('label', {}, ['Solo productos con descuento']);
