[NoCoverage] StringLiteral
src/js/script.mjs:1333:59
-           const label = createSafeElement('label', { class: 'form-check-label', for: 'filter-discount' }, ['Solo productos con descuento']);
+           const label = createSafeElement('label', { class: "", for: 'filter-discount' }, ['Solo productos con descuento']);

[NoCoverage] StringLiteral
src/js/script.mjs:1333:84
-           const label = createSafeElement('label', { class: 'form-check-label', for: 'filter-discount' }, ['Solo productos con descuento']);
+           const label = createSafeElement('label', { class: 'form-check-label', for: "" }, ['Solo productos con descuento']);

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1333:105
-           const label = createSafeElement('label', { class: 'form-check-label', for: 'filter-discount' }, ['Solo productos con descuento']);
+           const label = createSafeElement('label', { class: 'form-check-label', for: 'filter-discount' }, []);

[NoCoverage] StringLiteral
src/js/script.mjs:1333:106
-           const label = createSafeElement('label', { class: 'form-check-label', for: 'filter-discount' }, ['Solo productos con descuento']);
+           const label = createSafeElement('label', { class: 'form-check-label', for: 'filter-discount' }, [""]);

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1344:20
-       let products = [];
+       let products = ["Stryker was here"];

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1345:28
-       let filteredProducts = [];
+       let filteredProducts = ["Stryker was here"];

[NoCoverage] BooleanLiteral
src/js/script.mjs:1351:29
-       let userHasInteracted = false;
+       let userHasInteracted = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1352:16
-       let cart = JSON.parse(localStorage.getItem('cart')) || [];
+       let cart = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1352:16
-       let cart = JSON.parse(localStorage.getItem('cart')) || [];
+       let cart = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1352:16
-       let cart = JSON.parse(localStorage.getItem('cart')) || [];
+       let cart = JSON.parse(localStorage.getItem('cart')) && [];

[NoCoverage] StringLiteral
src/js/script.mjs:1352:48
-       let cart = JSON.parse(localStorage.getItem('cart')) || [];
+       let cart = JSON.parse(localStorage.getItem("")) || [];

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1352:60
-       let cart = JSON.parse(localStorage.getItem('cart')) || [];
+       let cart = JSON.parse(localStorage.getItem('cart')) || ["Stryker was here"];

[NoCoverage] BlockStatement
src/js/script.mjs:1354:38
-       const updateOnlineStatus = () => {
-           const offlineIndicator = document.getElementById('offline-indicator');
-           if (offlineIndicator) {
-               const hidden = navigator.onLine;
-               offlineIndicator.classList.toggle(UTILITY_CLASSES.hidden, hidden);
-               offlineIndicator.classList.toggle(UTILITY_CLASSES.block, !hidden);
-           }
-           if (!navigator.onLine) {
-               console.log('App is offline. Using cached data if available.');
-           }
-       };
+       const updateOnlineStatus = () => {};

[NoCoverage] StringLiteral
src/js/script.mjs:1355:58
-           const offlineIndicator = document.getElementById('offline-indicator');
+           const offlineIndicator = document.getElementById("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1356:13
-           if (offlineIndicator) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1356:13
-           if (offlineIndicator) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1356:31
-           if (offlineIndicator) {
-               const hidden = navigator.onLine;
-               offlineIndicator.classList.toggle(UTILITY_CLASSES.hidden, hidden);
-               offlineIndicator.classList.toggle(UTILITY_CLASSES.block, !hidden);
-           }
+           if (offlineIndicator) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:1359:70
-               offlineIndicator.classList.toggle(UTILITY_CLASSES.block, !hidden);
+               offlineIndicator.classList.toggle(UTILITY_CLASSES.block, hidden);

[NoCoverage] BooleanLiteral
src/js/script.mjs:1361:13
-           if (!navigator.onLine) {
+           if (navigator.onLine) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1361:13
-           if (!navigator.onLine) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1361:13
-           if (!navigator.onLine) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1361:32
-           if (!navigator.onLine) {
-               console.log('App is offline. Using cached data if available.');
-           }
+           if (!navigator.onLine) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1362:25
-               console.log('App is offline. Using cached data if available.');
+               console.log("");

[NoCoverage] BlockStatement
src/js/script.mjs:1366:27
-       function initFooter() {
-           const yearSpan = document.getElementById('current-year');
-           if (yearSpan) {
-               yearSpan.textContent = new Date().getFullYear();
-           }
-       }
+       function initFooter() {}

[NoCoverage] StringLiteral
src/js/script.mjs:1367:50
-           const yearSpan = document.getElementById('current-year');
+           const yearSpan = document.getElementById("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1368:13
-           if (yearSpan) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1368:13
-           if (yearSpan) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1368:23
-           if (yearSpan) {
-               yearSpan.textContent = new Date().getFullYear();
-           }
+           if (yearSpan) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1373:35
-       const DEFAULT_CURRENCY_CODE = 'CLP';
+       const DEFAULT_CURRENCY_CODE = "";

[NoCoverage] BooleanLiteral
src/js/script.mjs:1374:37
-       let hasLoggedCurrencyFallback = false;
+       let hasLoggedCurrencyFallback = true;

[NoCoverage] BlockStatement
src/js/script.mjs:1376:53
-       const normalizeCurrencyCode = (currencyCode) => {
-           if (typeof currencyCode !== 'string') {
-               return DEFAULT_CURRENCY_CODE;
-           }
-           const trimmed = currencyCode.trim().toUpperCase();
-           if (/^[A-Z]{3}$/.test(trimmed)) {
-               return trimmed;
-           }
-           return DEFAULT_CURRENCY_CODE;
-       };
+       const normalizeCurrencyCode = (currencyCode) => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:1377:13
-           if (typeof currencyCode !== 'string') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1377:13
-           if (typeof currencyCode !== 'string') {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1377:13
-           if (typeof currencyCode !== 'string') {
+           if (typeof currencyCode === 'string') {

[NoCoverage] StringLiteral
src/js/script.mjs:1377:37
-           if (typeof currencyCode !== 'string') {
+           if (typeof currencyCode !== "") {

[NoCoverage] BlockStatement
src/js/script.mjs:1377:47
-           if (typeof currencyCode !== 'string') {
-               return DEFAULT_CURRENCY_CODE;
-           }
+           if (typeof currencyCode !== 'string') {}

[NoCoverage] MethodExpression
src/js/script.mjs:1380:25
-           const trimmed = currencyCode.trim().toUpperCase();
+           const trimmed = currencyCode.trim().toLowerCase();

[NoCoverage] MethodExpression
src/js/script.mjs:1380:25
-           const trimmed = currencyCode.trim().toUpperCase();
+           const trimmed = currencyCode.toUpperCase();

[NoCoverage] ConditionalExpression
src/js/script.mjs:1381:13
-           if (/^[A-Z]{3}$/.test(trimmed)) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1381:13
-           if (/^[A-Z]{3}$/.test(trimmed)) {
+           if (false) {

[NoCoverage] Regex
src/js/script.mjs:1381:13
-           if (/^[A-Z]{3}$/.test(trimmed)) {
+           if (/[A-Z]{3}$/.test(trimmed)) {

[NoCoverage] Regex
src/js/script.mjs:1381:13
-           if (/^[A-Z]{3}$/.test(trimmed)) {
+           if (/^[A-Z]{3}/.test(trimmed)) {

[NoCoverage] Regex
src/js/script.mjs:1381:13
-           if (/^[A-Z]{3}$/.test(trimmed)) {
+           if (/^[A-Z]$/.test(trimmed)) {

[NoCoverage] Regex
src/js/script.mjs:1381:13
-           if (/^[A-Z]{3}$/.test(trimmed)) {
+           if (/^[^A-Z]{3}$/.test(trimmed)) {

[NoCoverage] BlockStatement
src/js/script.mjs:1381:41
-           if (/^[A-Z]{3}$/.test(trimmed)) {
-               return trimmed;
-           }
+           if (/^[A-Z]{3}$/.test(trimmed)) {}

[NoCoverage] BlockStatement
src/js/script.mjs:1387:55
-       const createCurrencyFormatter = (currencyCode) => {
-           const fallbackCode = normalizeCurrencyCode(currencyCode);
-           try {
-               return new Intl.NumberFormat('es-CL', {
-                   style: 'currency',
-                   currency: fallbackCode,
-                   minimumFractionDigits: 0
-               });
-           } catch (error) {
-               if (!hasLoggedCurrencyFallback) {
-                   const message = (error && typeof error.message === 'string')
-                       ? error.message
-                       : 'Unknown currency formatter failure';
-                   console.warn('Falling back to CLP currency formatter', {
-                       currencyCode,
-                       message
-                   });
-                   hasLoggedCurrencyFallback = true;
-               }
-               return new Intl.NumberFormat('es-CL', {
-                   style: 'currency',
-                   currency: DEFAULT_CURRENCY_CODE,
-                   minimumFractionDigits: 0
-               });
-           }
-       };
+       const createCurrencyFormatter = (currencyCode) => {};

[NoCoverage] BlockStatement
src/js/script.mjs:1389:13
-           try {
-               return new Intl.NumberFormat('es-CL', {
-                   style: 'currency',
-                   currency: fallbackCode,
-                   minimumFractionDigits: 0
-               });
-           } catch (error) {
+           try {} catch (error) {

[NoCoverage] StringLiteral
src/js/script.mjs:1390:42
-               return new Intl.NumberFormat('es-CL', {
+               return new Intl.NumberFormat("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1390:51
-               return new Intl.NumberFormat('es-CL', {
-                   style: 'currency',
-                   currency: fallbackCode,
-                   minimumFractionDigits: 0
-               });
+               return new Intl.NumberFormat('es-CL', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1391:24
-                   style: 'currency',
+                   style: "",

[NoCoverage] BlockStatement
src/js/script.mjs:1395:25
-           } catch (error) {
-               if (!hasLoggedCurrencyFallback) {
-                   const message = (error && typeof error.message === 'string')
-                       ? error.message
-                       : 'Unknown currency formatter failure';
-                   console.warn('Falling back to CLP currency formatter', {
-                       currencyCode,
-                       message
-                   });
-                   hasLoggedCurrencyFallback = true;
-               }
-               return new Intl.NumberFormat('es-CL', {
-                   style: 'currency',
-                   currency: DEFAULT_CURRENCY_CODE,
-                   minimumFractionDigits: 0
-               });
-           }
+           } catch (error) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:1396:17
-               if (!hasLoggedCurrencyFallback) {
+               if (hasLoggedCurrencyFallback) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1396:17
-               if (!hasLoggedCurrencyFallback) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1396:17
-               if (!hasLoggedCurrencyFallback) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1396:45
-               if (!hasLoggedCurrencyFallback) {
-                   const message = (error && typeof error.message === 'string')
-                       ? error.message
-                       : 'Unknown currency formatter failure';
-                   console.warn('Falling back to CLP currency formatter', {
-                       currencyCode,
-                       message
-                   });
-                   hasLoggedCurrencyFallback = true;
-               }
+               if (!hasLoggedCurrencyFallback) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1397:34
-                   const message = (error && typeof error.message === 'string')
+                   const message = (true)

[NoCoverage] ConditionalExpression
src/js/script.mjs:1397:34
-                   const message = (error && typeof error.message === 'string')
+                   const message = (false)

[NoCoverage] LogicalOperator
src/js/script.mjs:1397:34
-                   const message = (error && typeof error.message === 'string')
+                   const message = (error || typeof error.message === 'string')

[NoCoverage] ConditionalExpression
src/js/script.mjs:1397:43
-                   const message = (error && typeof error.message === 'string')
+                   const message = (error && true)

[NoCoverage] EqualityOperator
src/js/script.mjs:1397:43
-                   const message = (error && typeof error.message === 'string')
+                   const message = (error && typeof error.message !== 'string')

[NoCoverage] StringLiteral
src/js/script.mjs:1397:68
-                   const message = (error && typeof error.message === 'string')
+                   const message = (error && typeof error.message === "")

[NoCoverage] StringLiteral
src/js/script.mjs:1399:23
-                       : 'Unknown currency formatter failure';
+                       : "";

[NoCoverage] StringLiteral
src/js/script.mjs:1400:30
-                   console.warn('Falling back to CLP currency formatter', {
+                   console.warn("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1400:72
-                   console.warn('Falling back to CLP currency formatter', {
-                       currencyCode,
-                       message
-                   });
+                   console.warn('Falling back to CLP currency formatter', {});

[NoCoverage] BooleanLiteral
src/js/script.mjs:1404:45
-                   hasLoggedCurrencyFallback = true;
+                   hasLoggedCurrencyFallback = false;

[NoCoverage] StringLiteral
src/js/script.mjs:1406:42
-               return new Intl.NumberFormat('es-CL', {
+               return new Intl.NumberFormat("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1406:51
-               return new Intl.NumberFormat('es-CL', {
-                   style: 'currency',
-                   currency: DEFAULT_CURRENCY_CODE,
-                   minimumFractionDigits: 0
-               });
+               return new Intl.NumberFormat('es-CL', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1407:24
-                   style: 'currency',
+                   style: "",

[NoCoverage] ConditionalExpression
src/js/script.mjs:1415:30
-           const numericPrice = Number(price) || 0;
+           const numericPrice = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1415:30
-           const numericPrice = Number(price) || 0;
+           const numericPrice = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1415:30
-           const numericPrice = Number(price) || 0;
+           const numericPrice = Number(price) && 0;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1416:33
-           const numericDiscount = Number(discount) || 0;
+           const numericDiscount = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1416:33
-           const numericDiscount = Number(discount) || 0;
+           const numericDiscount = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1416:33
-           const numericDiscount = Number(discount) || 0;
+           const numericDiscount = Number(discount) && 0;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1421:13
-           if (numericDiscount) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1421:13
-           if (numericDiscount) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1421:30
-           if (numericDiscount) {
-               const discountedPrice = Math.max(numericPrice - numericDiscount, 0);
-               const formattedDiscountedPrice = formatter.format(discountedPrice);
-   
-               return createSafeElement('div', { class: 'precio-container' }, [
-                   createSafeElement(
-                       'span',
-                       { class: 'precio-descuento', 'aria-label': 'Precio con descuento' },
-                       [formattedDiscountedPrice]
-                   ),
-                   createSafeElement(
-                       'span',
-                       { class: 'precio-original', 'aria-label': 'Precio original' },
-                       [
-                           createSafeElement(
-                               'span',
-                               { class: 'tachado' },
-                               [formattedPrice]
-                           )
-                       ]
-                   )
-               ]);
-           }
+           if (numericDiscount) {}

[NoCoverage] MethodExpression
src/js/script.mjs:1422:37
-               const discountedPrice = Math.max(numericPrice - numericDiscount, 0);
+               const discountedPrice = Math.min(numericPrice - numericDiscount, 0);

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1422:46
-               const discountedPrice = Math.max(numericPrice - numericDiscount, 0);
+               const discountedPrice = Math.max(numericPrice + numericDiscount, 0);

[NoCoverage] StringLiteral
src/js/script.mjs:1425:38
-               return createSafeElement('div', { class: 'precio-container' }, [
+               return createSafeElement("", { class: 'precio-container' }, [

[NoCoverage] ObjectLiteral
src/js/script.mjs:1425:45
-               return createSafeElement('div', { class: 'precio-container' }, [
+               return createSafeElement('div', {}, [

[NoCoverage] StringLiteral
src/js/script.mjs:1425:54
-               return createSafeElement('div', { class: 'precio-container' }, [
+               return createSafeElement('div', { class: "" }, [

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1425:76
-               return createSafeElement('div', { class: 'precio-container' }, [
-                   createSafeElement(
-                       'span',
-                       { class: 'precio-descuento', 'aria-label': 'Precio con descuento' },
-                       [formattedDiscountedPrice]
-                   ),
-                   createSafeElement(
-                       'span',
-                       { class: 'precio-original', 'aria-label': 'Precio original' },
-                       [
-                           createSafeElement(
-                               'span',
-                               { class: 'tachado' },
-                               [formattedPrice]
-                           )
-                       ]
-                   )
-               ]);
+               return createSafeElement('div', { class: 'precio-container' }, []);

[NoCoverage] StringLiteral
src/js/script.mjs:1427:21
-                       'span',
+                       "",

[NoCoverage] ObjectLiteral
src/js/script.mjs:1428:21
-                       { class: 'precio-descuento', 'aria-label': 'Precio con descuento' },
+                       {},

[NoCoverage] StringLiteral
src/js/script.mjs:1428:30
-                       { class: 'precio-descuento', 'aria-label': 'Precio con descuento' },
+                       { class: "", 'aria-label': 'Precio con descuento' },

[NoCoverage] StringLiteral
src/js/script.mjs:1428:64
-                       { class: 'precio-descuento', 'aria-label': 'Precio con descuento' },
+                       { class: 'precio-descuento', 'aria-label': "" },

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1429:21
-                       [formattedDiscountedPrice]
+                       []

[NoCoverage] StringLiteral
src/js/script.mjs:1432:21
-                       'span',
+                       "",

[NoCoverage] ObjectLiteral
src/js/script.mjs:1433:21
-                       { class: 'precio-original', 'aria-label': 'Precio original' },
+                       {},

[NoCoverage] StringLiteral
src/js/script.mjs:1433:30
-                       { class: 'precio-original', 'aria-label': 'Precio original' },
+                       { class: "", 'aria-label': 'Precio original' },

[NoCoverage] StringLiteral
src/js/script.mjs:1433:63
-                       { class: 'precio-original', 'aria-label': 'Precio original' },
+                       { class: 'precio-original', 'aria-label': "" },

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1434:21
-                       [
-                           createSafeElement(
-                               'span',
-                               { class: 'tachado' },
-                               [formattedPrice]
-                           )
-                       ]
+                       []

[NoCoverage] StringLiteral
src/js/script.mjs:1436:29
-                               'span',
+                               "",

[NoCoverage] ObjectLiteral
src/js/script.mjs:1437:29
-                               { class: 'tachado' },
+                               {},

[NoCoverage] StringLiteral
src/js/script.mjs:1437:38
-                               { class: 'tachado' },
+                               { class: "" },

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1438:29
-                               [formattedPrice]
+                               []

[NoCoverage] StringLiteral
src/js/script.mjs:1445:34
-           return createSafeElement('div', { class: 'precio-container' }, [
+           return createSafeElement("", { class: 'precio-container' }, [

[NoCoverage] ObjectLiteral
src/js/script.mjs:1445:41
-           return createSafeElement('div', { class: 'precio-container' }, [
+           return createSafeElement('div', {}, [

[NoCoverage] StringLiteral
src/js/script.mjs:1445:50
-           return createSafeElement('div', { class: 'precio-container' }, [
+           return createSafeElement('div', { class: "" }, [

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1445:72
-           return createSafeElement('div', { class: 'precio-container' }, [
-               createSafeElement(
-                   'span',
-                   { class: 'precio', 'aria-label': 'Precio' },
-                   [formattedPrice]
-               )
-           ]);
+           return createSafeElement('div', { class: 'precio-container' }, []);

[NoCoverage] StringLiteral
src/js/script.mjs:1447:17
-                   'span',
+                   "",

[NoCoverage] ObjectLiteral
src/js/script.mjs:1448:17
-                   { class: 'precio', 'aria-label': 'Precio' },
+                   {},

[NoCoverage] StringLiteral
src/js/script.mjs:1448:26
-                   { class: 'precio', 'aria-label': 'Precio' },
+                   { class: "", 'aria-label': 'Precio' },

[NoCoverage] StringLiteral
src/js/script.mjs:1448:50
-                   { class: 'precio', 'aria-label': 'Precio' },
+                   { class: 'precio', 'aria-label': "" },

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1449:17
-                   [formattedPrice]
+                   []

[NoCoverage] StringLiteral
src/js/script.mjs:1456:51
-           const quantityControl = createSafeElement('div', {
+           const quantityControl = createSafeElement("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1456:58
-           const quantityControl = createSafeElement('div', {
-               class: `quantity-control ${UTILITY_CLASSES.hidden}`,
-               role: 'group',
-               'aria-label': 'Seleccionar cantidad',
-               'aria-live': 'polite'
-           });
+           const quantityControl = createSafeElement('div', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1457:20
-               class: `quantity-control ${UTILITY_CLASSES.hidden}`,
+               class: ``,

[NoCoverage] StringLiteral
src/js/script.mjs:1458:19
-               role: 'group',
+               role: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1459:27
-               'aria-label': 'Seleccionar cantidad',
+               'aria-label': "",

[NoCoverage] StringLiteral
src/js/script.mjs:1460:26
-               'aria-live': 'polite'
+               'aria-live': ""

[NoCoverage] StringLiteral
src/js/script.mjs:1462:44
-           const minusBtn = createSafeElement('button', {
+           const minusBtn = createSafeElement("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1462:54
-           const minusBtn = createSafeElement('button', {
-               class: 'quantity-btn',
-               type: 'button',
-               'data-action': 'decrease',
-               'aria-label': 'Decrease quantity'
-           }, ['-']);
+           const minusBtn = createSafeElement('button', {}, ['-']);

[NoCoverage] StringLiteral
src/js/script.mjs:1463:20
-               class: 'quantity-btn',
+               class: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1464:19
-               type: 'button',
+               type: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1465:28
-               'data-action': 'decrease',
+               'data-action': "",

[NoCoverage] StringLiteral
src/js/script.mjs:1466:27
-               'aria-label': 'Decrease quantity'
+               'aria-label': ""

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1467:12
-           }, ['-']);
+           }, []);

[NoCoverage] StringLiteral
src/js/script.mjs:1467:13
-           }, ['-']);
+           }, [""]);

[NoCoverage] StringLiteral
src/js/script.mjs:1468:43
-           const plusBtn = createSafeElement('button', {
+           const plusBtn = createSafeElement("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1468:53
-           const plusBtn = createSafeElement('button', {
-               class: 'quantity-btn',
-               type: 'button',
-               'data-action': 'increase',
-               'aria-label': 'Increase quantity'
-           }, ['+']);
+           const plusBtn = createSafeElement('button', {}, ['+']);

[NoCoverage] StringLiteral
src/js/script.mjs:1469:20
-               class: 'quantity-btn',
+               class: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1470:19
-               type: 'button',
+               type: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1471:28
-               'data-action': 'increase',
+               'data-action': "",

[NoCoverage] StringLiteral
src/js/script.mjs:1472:27
-               'aria-label': 'Increase quantity'
+               'aria-label': ""

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1473:12
-           }, ['+']);
+           }, []);

[NoCoverage] StringLiteral
src/js/script.mjs:1473:13
-           }, ['+']);
+           }, [""]);

[NoCoverage] StringLiteral
src/js/script.mjs:1474:41
-           const input = createSafeElement('input', {
+           const input = createSafeElement("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1474:50
-           const input = createSafeElement('input', {
-               type: 'number',
-               class: 'quantity-input',
-               value: Math.max(getCartItemQuantity(product.id), 1),
-               min: '1',
-               max: '50',
-               'aria-label': 'Quantity',
-               'data-id': product.id
-           });
+           const input = createSafeElement('input', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1475:19
-               type: 'number',
+               type: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1476:20
-               class: 'quantity-input',
+               class: "",

[NoCoverage] MethodExpression
src/js/script.mjs:1477:20
-               value: Math.max(getCartItemQuantity(product.id), 1),
+               value: Math.min(getCartItemQuantity(product.id), 1),

[NoCoverage] StringLiteral
src/js/script.mjs:1478:18
-               min: '1',
+               min: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1479:18
-               max: '50',
+               max: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1480:27
-               'aria-label': 'Quantity',
+               'aria-label': "",

[NoCoverage] BooleanLiteral
src/js/script.mjs:1492:13
-           if (!actionArea) {
+           if (actionArea) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1492:13
-           if (!actionArea) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1492:13
-           if (!actionArea) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1492:26
-           if (!actionArea) {
-               return;
-           }
+           if (!actionArea) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1495:55
-           const addToCartBtn = actionArea.querySelector('.add-to-cart-btn');
+           const addToCartBtn = actionArea.querySelector("");
