[NoCoverage] StringLiteral
src/js/script.mjs:1496:58
-           const quantityControl = actionArea.querySelector('.quantity-control');
+           const quantityControl = actionArea.querySelector("");

[NoCoverage] OptionalChaining
src/js/script.mjs:1497:31
-           const quantityInput = quantityControl?.querySelector('.quantity-input');
+           const quantityInput = quantityControl.querySelector('.quantity-input');

[NoCoverage] StringLiteral
src/js/script.mjs:1497:62
-           const quantityInput = quantityControl?.querySelector('.quantity-input');
+           const quantityInput = quantityControl?.querySelector("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1498:26
-           const minusBtn = quantityControl?.querySelector('.quantity-btn[data-action="decrease"]') || quantityControl?.querySelector('.quantity-btn');
+           const minusBtn = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1498:26
-           const minusBtn = quantityControl?.querySelector('.quantity-btn[data-action="decrease"]') || quantityControl?.querySelector('.quantity-btn');
+           const minusBtn = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1498:26
-           const minusBtn = quantityControl?.querySelector('.quantity-btn[data-action="decrease"]') || quantityControl?.querySelector('.quantity-btn');
+           const minusBtn = quantityControl?.querySelector('.quantity-btn[data-action="decrease"]') && quantityControl?.querySelector('.quantity-btn');

[NoCoverage] OptionalChaining
src/js/script.mjs:1498:26
-           const minusBtn = quantityControl?.querySelector('.quantity-btn[data-action="decrease"]') || quantityControl?.querySelector('.quantity-btn');
+           const minusBtn = quantityControl.querySelector('.quantity-btn[data-action="decrease"]') || quantityControl?.querySelector('.quantity-btn');

[NoCoverage] StringLiteral
src/js/script.mjs:1498:57
-           const minusBtn = quantityControl?.querySelector('.quantity-btn[data-action="decrease"]') || quantityControl?.querySelector('.quantity-btn');
+           const minusBtn = quantityControl?.querySelector("") || quantityControl?.querySelector('.quantity-btn');

[NoCoverage] OptionalChaining
src/js/script.mjs:1498:101
-           const minusBtn = quantityControl?.querySelector('.quantity-btn[data-action="decrease"]') || quantityControl?.querySelector('.quantity-btn');
+           const minusBtn = quantityControl?.querySelector('.quantity-btn[data-action="decrease"]') || quantityControl.querySelector('.quantity-btn');

[NoCoverage] StringLiteral
src/js/script.mjs:1498:132
-           const minusBtn = quantityControl?.querySelector('.quantity-btn[data-action="decrease"]') || quantityControl?.querySelector('.quantity-btn');
+           const minusBtn = quantityControl?.querySelector('.quantity-btn[data-action="decrease"]') || quantityControl?.querySelector("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1499:25
-           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') || quantityControl?.querySelectorAll('.quantity-btn')?.[1];
+           const plusBtn = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1499:25
-           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') || quantityControl?.querySelectorAll('.quantity-btn')?.[1];
+           const plusBtn = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1499:25
-           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') || quantityControl?.querySelectorAll('.quantity-btn')?.[1];
+           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') && quantityControl?.querySelectorAll('.quantity-btn')?.[1];

[NoCoverage] OptionalChaining
src/js/script.mjs:1499:25
-           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') || quantityControl?.querySelectorAll('.quantity-btn')?.[1];
+           const plusBtn = quantityControl.querySelector('.quantity-btn[data-action="increase"]') || quantityControl?.querySelectorAll('.quantity-btn')?.[1];

[NoCoverage] StringLiteral
src/js/script.mjs:1499:56
-           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') || quantityControl?.querySelectorAll('.quantity-btn')?.[1];
+           const plusBtn = quantityControl?.querySelector("") || quantityControl?.querySelectorAll('.quantity-btn')?.[1];

[NoCoverage] OptionalChaining
src/js/script.mjs:1499:100
-           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') || quantityControl?.querySelectorAll('.quantity-btn')?.[1];
+           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') || quantityControl?.querySelectorAll('.quantity-btn')[1];

[NoCoverage] OptionalChaining
src/js/script.mjs:1499:100
-           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') || quantityControl?.querySelectorAll('.quantity-btn')?.[1];
+           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') || quantityControl.querySelectorAll('.quantity-btn')?.[1];

[NoCoverage] StringLiteral
src/js/script.mjs:1499:134
-           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') || quantityControl?.querySelectorAll('.quantity-btn')?.[1];
+           const plusBtn = quantityControl?.querySelector('.quantity-btn[data-action="increase"]') || quantityControl?.querySelectorAll("")?.[1];

[NoCoverage] BlockStatement
src/js/script.mjs:1501:51
-           const bind = (element, event, handler) => {
-               if (!element) {
-                   return;
-               }
-               if (element.dataset.listenerAttached === 'true') {
-                   return;
-               }
-               element.addEventListener(event, handler);
-               element.dataset.listenerAttached = 'true';
-           };
+           const bind = (element, event, handler) => {};

[NoCoverage] BooleanLiteral
src/js/script.mjs:1502:17
-               if (!element) {
+               if (element) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1502:17
-               if (!element) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1502:17
-               if (!element) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1502:27
-               if (!element) {
-                   return;
-               }
+               if (!element) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1505:17
-               if (element.dataset.listenerAttached === 'true') {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1505:17
-               if (element.dataset.listenerAttached === 'true') {
+               if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1505:17
-               if (element.dataset.listenerAttached === 'true') {
+               if (element.dataset.listenerAttached !== 'true') {

[NoCoverage] StringLiteral
src/js/script.mjs:1505:54
-               if (element.dataset.listenerAttached === 'true') {
+               if (element.dataset.listenerAttached === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:1505:62
-               if (element.dataset.listenerAttached === 'true') {
-                   return;
-               }
+               if (element.dataset.listenerAttached === 'true') {}

[NoCoverage] StringLiteral
src/js/script.mjs:1509:48
-               element.dataset.listenerAttached = 'true';
+               element.dataset.listenerAttached = "";

[NoCoverage] StringLiteral
src/js/script.mjs:1512:28
-           bind(addToCartBtn, 'click', () => {
+           bind(addToCartBtn, "", () => {

[NoCoverage] BlockStatement
src/js/script.mjs:1512:43
-           bind(addToCartBtn, 'click', () => {
-               addToCart(product, 1);
-               toggleActionArea(addToCartBtn, quantityControl, true);
-           });
+           bind(addToCartBtn, 'click', () => {});

[NoCoverage] BooleanLiteral
src/js/script.mjs:1514:61
-               toggleActionArea(addToCartBtn, quantityControl, true);
+               toggleActionArea(addToCartBtn, quantityControl, false);

[NoCoverage] StringLiteral
src/js/script.mjs:1517:24
-           bind(minusBtn, 'click', () => updateQuantity(product, -1));
+           bind(minusBtn, "", () => updateQuantity(product, -1));

[NoCoverage] ArrowFunction
src/js/script.mjs:1517:33
-           bind(minusBtn, 'click', () => updateQuantity(product, -1));
+           bind(minusBtn, 'click', () => undefined);

[NoCoverage] UnaryOperator
src/js/script.mjs:1517:63
-           bind(minusBtn, 'click', () => updateQuantity(product, -1));
+           bind(minusBtn, 'click', () => updateQuantity(product, +1));

[NoCoverage] StringLiteral
src/js/script.mjs:1518:23
-           bind(plusBtn, 'click', () => updateQuantity(product, 1));
+           bind(plusBtn, "", () => updateQuantity(product, 1));

[NoCoverage] ArrowFunction
src/js/script.mjs:1518:32
-           bind(plusBtn, 'click', () => updateQuantity(product, 1));
+           bind(plusBtn, 'click', () => undefined);

[NoCoverage] StringLiteral
src/js/script.mjs:1519:29
-           bind(quantityInput, 'change', (event) => {
+           bind(quantityInput, "", (event) => {

[NoCoverage] BlockStatement
src/js/script.mjs:1519:50
-           bind(quantityInput, 'change', (event) => {
-               const newQuantity = parseInt(event.target.value, 10);
-               if (!Number.isFinite(newQuantity)) {
-                   event.target.value = Math.max(getCartItemQuantity(product.id), 1);
-                   return;
-               }
-               const currentQuantity = getCartItemQuantity(product.id);
-               updateQuantity(product, newQuantity - currentQuantity);
-           });
+           bind(quantityInput, 'change', (event) => {});

[NoCoverage] BooleanLiteral
src/js/script.mjs:1521:17
-               if (!Number.isFinite(newQuantity)) {
+               if (Number.isFinite(newQuantity)) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1521:17
-               if (!Number.isFinite(newQuantity)) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1521:17
-               if (!Number.isFinite(newQuantity)) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1521:48
-               if (!Number.isFinite(newQuantity)) {
-                   event.target.value = Math.max(getCartItemQuantity(product.id), 1);
-                   return;
-               }
+               if (!Number.isFinite(newQuantity)) {}

[NoCoverage] MethodExpression
src/js/script.mjs:1522:38
-                   event.target.value = Math.max(getCartItemQuantity(product.id), 1);
+                   event.target.value = Math.min(getCartItemQuantity(product.id), 1);

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1526:37
-               updateQuantity(product, newQuantity - currentQuantity);
+               updateQuantity(product, newQuantity + currentQuantity);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1530:13
-           if (quantityInput) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1530:13
-           if (quantityInput) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1530:28
-           if (quantityInput) {
-               quantityInput.value = currentQuantity > 0 ? currentQuantity : 1;
-           }
+           if (quantityInput) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1531:35
-               quantityInput.value = currentQuantity > 0 ? currentQuantity : 1;
+               quantityInput.value = true ? currentQuantity : 1;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1531:35
-               quantityInput.value = currentQuantity > 0 ? currentQuantity : 1;
+               quantityInput.value = false ? currentQuantity : 1;

[NoCoverage] EqualityOperator
src/js/script.mjs:1531:35
-               quantityInput.value = currentQuantity > 0 ? currentQuantity : 1;
+               quantityInput.value = currentQuantity >= 0 ? currentQuantity : 1;

[NoCoverage] EqualityOperator
src/js/script.mjs:1531:35
-               quantityInput.value = currentQuantity > 0 ? currentQuantity : 1;
+               quantityInput.value = currentQuantity <= 0 ? currentQuantity : 1;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1533:57
-           toggleActionArea(addToCartBtn, quantityControl, currentQuantity > 0);
+           toggleActionArea(addToCartBtn, quantityControl, true);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1533:57
-           toggleActionArea(addToCartBtn, quantityControl, currentQuantity > 0);
+           toggleActionArea(addToCartBtn, quantityControl, false);

[NoCoverage] EqualityOperator
src/js/script.mjs:1533:57
-           toggleActionArea(addToCartBtn, quantityControl, currentQuantity > 0);
+           toggleActionArea(addToCartBtn, quantityControl, currentQuantity >= 0);

[NoCoverage] EqualityOperator
src/js/script.mjs:1533:57
-           toggleActionArea(addToCartBtn, quantityControl, currentQuantity > 0);
+           toggleActionArea(addToCartBtn, quantityControl, currentQuantity <= 0);

[NoCoverage] BlockStatement
src/js/script.mjs:1536:48
-       const getCartItemQuantity = (productId) => {
-           const item = cart.find(item => item.id === productId);
-           return item ? item.quantity : 0;
-       };
+       const getCartItemQuantity = (productId) => {};

[NoCoverage] ArrowFunction
src/js/script.mjs:1537:32
-           const item = cart.find(item => item.id === productId);
+           const item = cart.find(() => undefined);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1537:40
-           const item = cart.find(item => item.id === productId);
+           const item = cart.find(item => true);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1537:40
-           const item = cart.find(item => item.id === productId);
+           const item = cart.find(item => false);

[NoCoverage] EqualityOperator
src/js/script.mjs:1537:40
-           const item = cart.find(item => item.id === productId);
+           const item = cart.find(item => item.id !== productId);

[NoCoverage] BooleanLiteral
src/js/script.mjs:1541:57
-       const renderProducts = (productsToRender, { reset = false } = {}) => {
+       const renderProducts = (productsToRender, { reset = true } = {}) => {

[NoCoverage] BooleanLiteral
src/js/script.mjs:1542:13
-           if (!productContainer) {
+           if (productContainer) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1542:13
-           if (!productContainer) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1542:13
-           if (!productContainer) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1542:32
-           if (!productContainer) {
-               return 0;
-           }
+           if (!productContainer) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1545:13
-           if (reset) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1545:13
-           if (reset) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1545:20
-           if (reset) {
-               productContainer.innerHTML = '';
-           }
+           if (reset) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1546:42
-               productContainer.innerHTML = '';
+               productContainer.innerHTML = "Stryker was here!";

[NoCoverage] MethodExpression
src/js/script.mjs:1554:36
-               const productClasses = [
-                   'producto',
-                   'col-12',
-                   'col-sm-6',
-                   'col-md-4',
-                   'col-lg-3',
-                   'mb-4',
-                   !stock ? 'agotado' : '',
-                   UTILITY_CLASSES.contentVisible,
-                   UTILITY_CLASSES.containIntrinsic
-               ].filter(Boolean).join(' ');
+               const productClasses = ['producto', 'col-12', 'col-sm-6', 'col-md-4', 'col-lg-3', 'mb-4', !stock ? 'agotado' : '', UTILITY_CLASSES.contentVisible, UTILITY_CLASSES.containIntrinsic].join(' ');

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1554:36
-               const productClasses = [
-                   'producto',
-                   'col-12',
-                   'col-sm-6',
-                   'col-md-4',
-                   'col-lg-3',
-                   'mb-4',
-                   !stock ? 'agotado' : '',
-                   UTILITY_CLASSES.contentVisible,
-                   UTILITY_CLASSES.containIntrinsic
-               ].filter(Boolean).join(' ');
+               const productClasses = [].filter(Boolean).join(' ');

[NoCoverage] StringLiteral
src/js/script.mjs:1555:17
-                   'producto',
+                   "",

[NoCoverage] StringLiteral
src/js/script.mjs:1556:17
-                   'col-12',
+                   "",

[NoCoverage] StringLiteral
src/js/script.mjs:1557:17
-                   'col-sm-6',
+                   "",

[NoCoverage] StringLiteral
src/js/script.mjs:1558:17
-                   'col-md-4',
+                   "",

[NoCoverage] StringLiteral
src/js/script.mjs:1559:17
-                   'col-lg-3',
+                   "",

[NoCoverage] StringLiteral
src/js/script.mjs:1560:17
-                   'mb-4',
+                   "",

[NoCoverage] BooleanLiteral
src/js/script.mjs:1561:17
-                   !stock ? 'agotado' : '',
+                   stock ? 'agotado' : '',

[NoCoverage] StringLiteral
src/js/script.mjs:1561:26
-                   !stock ? 'agotado' : '',
+                   !stock ? "" : '',

[NoCoverage] StringLiteral
src/js/script.mjs:1561:38
-                   !stock ? 'agotado' : '',
+                   !stock ? 'agotado' : "Stryker was here!",

[NoCoverage] StringLiteral
src/js/script.mjs:1564:36
-               ].filter(Boolean).join(' ');
+               ].filter(Boolean).join("");

[NoCoverage] StringLiteral
src/js/script.mjs:1566:29
-               const titleId = `product-title-${id}`;
+               const titleId = ``;

[NoCoverage] StringLiteral
src/js/script.mjs:1567:54
-               const productElement = createSafeElement('article', {
+               const productElement = createSafeElement("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1567:65
-               const productElement = createSafeElement('article', {
-                   class: productClasses,
-                   'data-product-id': id,
-                   'aria-labelledby': titleId
-               });
+               const productElement = createSafeElement('article', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1573:51
-               const cardElement = createSafeElement('div', { class: 'card h-100' });
+               const cardElement = createSafeElement("", { class: 'card h-100' });

[NoCoverage] ObjectLiteral
src/js/script.mjs:1573:58
-               const cardElement = createSafeElement('div', { class: 'card h-100' });
+               const cardElement = createSafeElement('div', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1573:67
-               const cardElement = createSafeElement('div', { class: 'card h-100' });
+               const cardElement = createSafeElement('div', { class: "" });

[NoCoverage] ConditionalExpression
src/js/script.mjs:1575:17
-               if (discount && Number(discount) > 0) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1575:17
-               if (discount && Number(discount) > 0) {
+               if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1575:17
-               if (discount && Number(discount) > 0) {
+               if (discount || Number(discount) > 0) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1575:29
-               if (discount && Number(discount) > 0) {
+               if (discount && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1575:29
-               if (discount && Number(discount) > 0) {
+               if (discount && Number(discount) >= 0) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1575:29
-               if (discount && Number(discount) > 0) {
+               if (discount && Number(discount) <= 0) {

[NoCoverage] BlockStatement
src/js/script.mjs:1575:51
-               if (discount && Number(discount) > 0) {
-                   const pct = Math.round((Number(discount) / Number(price)) * 100);
-                   const badge = createSafeElement('span', { class: 'discount-badge badge bg-danger', 'aria-label': 'Producto en oferta' }, [`-${isFinite(pct) ? pct : 0}%`]);
-                   cardElement.appendChild(badge);
-               }
+               if (discount && Number(discount) > 0) {}

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1576:40
-                   const pct = Math.round((Number(discount) / Number(price)) * 100);
+                   const pct = Math.round(Number(discount) / Number(price) / 100);

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1576:41
-                   const pct = Math.round((Number(discount) / Number(price)) * 100);
+                   const pct = Math.round((Number(discount) * Number(price)) * 100);

[NoCoverage] StringLiteral
src/js/script.mjs:1577:49
-                   const badge = createSafeElement('span', { class: 'discount-badge badge bg-danger', 'aria-label': 'Producto en oferta' }, [`-${isFinite(pct) ? pct : 0}%`]);
+                   const badge = createSafeElement("", { class: 'discount-badge badge bg-danger', 'aria-label': 'Producto en oferta' }, [`-${isFinite(pct) ? pct : 0}%`]);

[NoCoverage] ObjectLiteral
src/js/script.mjs:1577:57
-                   const badge = createSafeElement('span', { class: 'discount-badge badge bg-danger', 'aria-label': 'Producto en oferta' }, [`-${isFinite(pct) ? pct : 0}%`]);
+                   const badge = createSafeElement('span', {}, [`-${isFinite(pct) ? pct : 0}%`]);

[NoCoverage] StringLiteral
src/js/script.mjs:1577:66
-                   const badge = createSafeElement('span', { class: 'discount-badge badge bg-danger', 'aria-label': 'Producto en oferta' }, [`-${isFinite(pct) ? pct : 0}%`]);
+                   const badge = createSafeElement('span', { class: "", 'aria-label': 'Producto en oferta' }, [`-${isFinite(pct) ? pct : 0}%`]);

[NoCoverage] StringLiteral
src/js/script.mjs:1577:114
-                   const badge = createSafeElement('span', { class: 'discount-badge badge bg-danger', 'aria-label': 'Producto en oferta' }, [`-${isFinite(pct) ? pct : 0}%`]);
+                   const badge = createSafeElement('span', { class: 'discount-badge badge bg-danger', 'aria-label': "" }, [`-${isFinite(pct) ? pct : 0}%`]);

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1577:138
-                   const badge = createSafeElement('span', { class: 'discount-badge badge bg-danger', 'aria-label': 'Producto en oferta' }, [`-${isFinite(pct) ? pct : 0}%`]);
+                   const badge = createSafeElement('span', { class: 'discount-badge badge bg-danger', 'aria-label': 'Producto en oferta' }, []);

[NoCoverage] StringLiteral
src/js/script.mjs:1577:139
-                   const badge = createSafeElement('span', { class: 'discount-badge badge bg-danger', 'aria-label': 'Producto en oferta' }, [`-${isFinite(pct) ? pct : 0}%`]);
+                   const badge = createSafeElement('span', { class: 'discount-badge badge bg-danger', 'aria-label': 'Producto en oferta' }, [``]);

[NoCoverage] ObjectLiteral
src/js/script.mjs:1581:57
-               const pictureElement = createProductPicture({
-                   imagePath: image_path,
-                   avifPath: image_avif_path,
-                   alt: name,
-                   eager: false
-               });
+               const pictureElement = createProductPicture({});

[NoCoverage] BooleanLiteral
src/js/script.mjs:1585:24
-                   eager: false
+                   eager: true

[NoCoverage] StringLiteral
src/js/script.mjs:1589:48
-               const cardBody = createSafeElement('div', { class: 'card-body d-flex flex-column' });
+               const cardBody = createSafeElement("", { class: 'card-body d-flex flex-column' });

[NoCoverage] ObjectLiteral
src/js/script.mjs:1589:55
-               const cardBody = createSafeElement('div', { class: 'card-body d-flex flex-column' });
+               const cardBody = createSafeElement('div', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1589:64
-               const cardBody = createSafeElement('div', { class: 'card-body d-flex flex-column' });
+               const cardBody = createSafeElement('div', { class: "" });

[NoCoverage] StringLiteral
src/js/script.mjs:1590:52
-               cardBody.appendChild(createSafeElement('h3', { class: 'card-title mb-2', id: titleId }, [name]));
+               cardBody.appendChild(createSafeElement("", { class: 'card-title mb-2', id: titleId }, [name]));

[NoCoverage] ObjectLiteral
src/js/script.mjs:1590:58
-               cardBody.appendChild(createSafeElement('h3', { class: 'card-title mb-2', id: titleId }, [name]));
+               cardBody.appendChild(createSafeElement('h3', {}, [name]));

[NoCoverage] StringLiteral
src/js/script.mjs:1590:67
-               cardBody.appendChild(createSafeElement('h3', { class: 'card-title mb-2', id: titleId }, [name]));
+               cardBody.appendChild(createSafeElement('h3', { class: "", id: titleId }, [name]));

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1590:101
-               cardBody.appendChild(createSafeElement('h3', { class: 'card-title mb-2', id: titleId }, [name]));
+               cardBody.appendChild(createSafeElement('h3', { class: 'card-title mb-2', id: titleId }, []));

[NoCoverage] StringLiteral
src/js/script.mjs:1591:52
-               cardBody.appendChild(createSafeElement('p', { class: 'card-text mb-3' }, [description]));
+               cardBody.appendChild(createSafeElement("", { class: 'card-text mb-3' }, [description]));

[NoCoverage] ObjectLiteral
src/js/script.mjs:1591:57
-               cardBody.appendChild(createSafeElement('p', { class: 'card-text mb-3' }, [description]));
+               cardBody.appendChild(createSafeElement('p', {}, [description]));

[NoCoverage] StringLiteral
src/js/script.mjs:1591:66
-               cardBody.appendChild(createSafeElement('p', { class: 'card-text mb-3' }, [description]));
+               cardBody.appendChild(createSafeElement('p', { class: "" }, [description]));

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1591:86
-               cardBody.appendChild(createSafeElement('p', { class: 'card-text mb-3' }, [description]));
+               cardBody.appendChild(createSafeElement('p', { class: 'card-text mb-3' }, []));

[NoCoverage] StringLiteral
src/js/script.mjs:1593:42
-               priceContainer.classList.add('mb-3');
+               priceContainer.classList.add("");

[NoCoverage] StringLiteral
src/js/script.mjs:1596:50
-               const actionArea = createSafeElement('div', {
+               const actionArea = createSafeElement("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1596:57
-               const actionArea = createSafeElement('div', {
-                   class: 'action-area mt-auto',
-                   'data-pid': id,
-                   role: 'group',
-                   'aria-label': `Acciones de compra para ${name}`
-               });
+               const actionArea = createSafeElement('div', {});

[NoCoverage] StringLiteral
src/js/script.mjs:1597:24
-                   class: 'action-area mt-auto',
+                   class: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1599:23
-                   role: 'group',
+                   role: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1600:31
-                   'aria-label': `Acciones de compra para ${name}`
+                   'aria-label': ``

[NoCoverage] StringLiteral
src/js/script.mjs:1602:52
-               const addToCartBtn = createSafeElement('button', {
+               const addToCartBtn = createSafeElement("", {

[NoCoverage] ObjectLiteral
src/js/script.mjs:1602:62
-               const addToCartBtn = createSafeElement('button', {
-                   class: 'btn btn-primary add-to-cart-btn mt-2',
-                   type: 'button',
-                   'data-id': id,
-                   'aria-label': `Add ${name} to cart`
-               }, ['Agregar al carrito']);
+               const addToCartBtn = createSafeElement('button', {}, ['Agregar al carrito']);

[NoCoverage] StringLiteral
src/js/script.mjs:1603:24
-                   class: 'btn btn-primary add-to-cart-btn mt-2',
+                   class: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1604:23
-                   type: 'button',
+                   type: "",

[NoCoverage] StringLiteral
src/js/script.mjs:1606:31
-                   'aria-label': `Add ${name} to cart`
+                   'aria-label': ``

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1607:16
-               }, ['Agregar al carrito']);
+               }, []);

[NoCoverage] StringLiteral
src/js/script.mjs:1607:17
-               }, ['Agregar al carrito']);
+               }, [""]);
