[NoCoverage] BlockStatement
src/js/script.mjs:1626:57
-       const hydratePreRenderedProducts = (productList) => {
-           if (!productContainer) {
-               return 0;
-           }
-           const cards = productContainer.querySelectorAll('[data-product-id]');
-           if (!cards.length) {
-               return 0;
-           }
-           const map = new Map(productList.map(item => [item.id, item]));
-           let hydrated = 0;
-           cards.forEach(card => {
-               const productId = card.getAttribute('data-product-id');
-               if (!productId || !map.has(productId)) {
-                   return;
-               }
-               const product = map.get(productId);
-               card.classList.add(UTILITY_CLASSES.contentVisible, UTILITY_CLASSES.containIntrinsic);
-               const actionArea = card.querySelector('.action-area');
-               setupActionArea(actionArea, product);
-               hydrated += 1;
-           });
-           return hydrated;
-       };
+       const hydratePreRenderedProducts = (productList) => {};

[NoCoverage] BooleanLiteral
src/js/script.mjs:1627:13
-           if (!productContainer) {
+           if (productContainer) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1627:13
-           if (!productContainer) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1627:13
-           if (!productContainer) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1627:32
-           if (!productContainer) {
-               return 0;
-           }
+           if (!productContainer) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1630:57
-           const cards = productContainer.querySelectorAll('[data-product-id]');
+           const cards = productContainer.querySelectorAll("");

[NoCoverage] BooleanLiteral
src/js/script.mjs:1631:13
-           if (!cards.length) {
+           if (cards.length) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1631:13
-           if (!cards.length) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1631:13
-           if (!cards.length) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1631:28
-           if (!cards.length) {
-               return 0;
-           }
+           if (!cards.length) {}

[NoCoverage] ArrowFunction
src/js/script.mjs:1634:45
-           const map = new Map(productList.map(item => [item.id, item]));
+           const map = new Map(productList.map(() => undefined));

[NoCoverage] ArrayDeclaration
src/js/script.mjs:1634:53
-           const map = new Map(productList.map(item => [item.id, item]));
+           const map = new Map(productList.map(item => []));

[NoCoverage] BlockStatement
src/js/script.mjs:1636:31
-           cards.forEach(card => {
-               const productId = card.getAttribute('data-product-id');
-               if (!productId || !map.has(productId)) {
-                   return;
-               }
-               const product = map.get(productId);
-               card.classList.add(UTILITY_CLASSES.contentVisible, UTILITY_CLASSES.containIntrinsic);
-               const actionArea = card.querySelector('.action-area');
-               setupActionArea(actionArea, product);
-               hydrated += 1;
-           });
+           cards.forEach(card => {});

[NoCoverage] StringLiteral
src/js/script.mjs:1637:49
-               const productId = card.getAttribute('data-product-id');
+               const productId = card.getAttribute("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1638:17
-               if (!productId || !map.has(productId)) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1638:17
-               if (!productId || !map.has(productId)) {
+               if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1638:17
-               if (!productId || !map.has(productId)) {
+               if (!productId && !map.has(productId)) {

[NoCoverage] BooleanLiteral
src/js/script.mjs:1638:17
-               if (!productId || !map.has(productId)) {
+               if (productId || !map.has(productId)) {

[NoCoverage] BooleanLiteral
src/js/script.mjs:1638:31
-               if (!productId || !map.has(productId)) {
+               if (!productId || map.has(productId)) {

[NoCoverage] BlockStatement
src/js/script.mjs:1638:52
-               if (!productId || !map.has(productId)) {
-                   return;
-               }
+               if (!productId || !map.has(productId)) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1643:51
-               const actionArea = card.querySelector('.action-area');
+               const actionArea = card.querySelector("");

[NoCoverage] AssignmentOperator
src/js/script.mjs:1645:13
-               hydrated += 1;
+               hydrated -= 1;

[NoCoverage] BlockStatement
src/js/script.mjs:1650:36
-       const resetProductList = () => {
-           if (productContainer) {
-               productContainer.innerHTML = '';
-           }
-           visibleCount = 0;
-       };
+       const resetProductList = () => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:1651:13
-           if (productContainer) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1651:13
-           if (productContainer) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1651:31
-           if (productContainer) {
-               productContainer.innerHTML = '';
-           }
+           if (productContainer) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1652:42
-               productContainer.innerHTML = '';
+               productContainer.innerHTML = "Stryker was here!";

[NoCoverage] BlockStatement
src/js/script.mjs:1657:32
-       const applyFilters = () => {
-           const criterion = sortOptions?.value || 'original';
-           const keyword = filterKeyword?.value?.trim?.() || '';
-           const discountOnly = document.getElementById('filter-discount')?.checked || false;
-           filteredProducts = memoizedFilterProducts(products, keyword, criterion, discountOnly);
-       };
+       const applyFilters = () => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:1658:27
-           const criterion = sortOptions?.value || 'original';
+           const criterion = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1658:27
-           const criterion = sortOptions?.value || 'original';
+           const criterion = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1658:27
-           const criterion = sortOptions?.value || 'original';
+           const criterion = sortOptions?.value && 'original';

[NoCoverage] OptionalChaining
src/js/script.mjs:1658:27
-           const criterion = sortOptions?.value || 'original';
+           const criterion = sortOptions.value || 'original';

[NoCoverage] StringLiteral
src/js/script.mjs:1658:49
-           const criterion = sortOptions?.value || 'original';
+           const criterion = sortOptions?.value || "";

[NoCoverage] ConditionalExpression
src/js/script.mjs:1659:25
-           const keyword = filterKeyword?.value?.trim?.() || '';
+           const keyword = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1659:25
-           const keyword = filterKeyword?.value?.trim?.() || '';
+           const keyword = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1659:25
-           const keyword = filterKeyword?.value?.trim?.() || '';
+           const keyword = filterKeyword?.value?.trim?.() && '';

[NoCoverage] MethodExpression
src/js/script.mjs:1659:25
-           const keyword = filterKeyword?.value?.trim?.() || '';
+           const keyword = filterKeyword?.value || '';

[NoCoverage] OptionalChaining
src/js/script.mjs:1659:25
-           const keyword = filterKeyword?.value?.trim?.() || '';
+           const keyword = filterKeyword?.value?.trim() || '';

[NoCoverage] OptionalChaining
src/js/script.mjs:1659:25
-           const keyword = filterKeyword?.value?.trim?.() || '';
+           const keyword = filterKeyword?.value.trim?.() || '';

[NoCoverage] OptionalChaining
src/js/script.mjs:1659:25
-           const keyword = filterKeyword?.value?.trim?.() || '';
+           const keyword = filterKeyword.value?.trim?.() || '';

[NoCoverage] StringLiteral
src/js/script.mjs:1659:59
-           const keyword = filterKeyword?.value?.trim?.() || '';
+           const keyword = filterKeyword?.value?.trim?.() || "Stryker was here!";

[NoCoverage] ConditionalExpression
src/js/script.mjs:1660:30
-           const discountOnly = document.getElementById('filter-discount')?.checked || false;
+           const discountOnly = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1660:30
-           const discountOnly = document.getElementById('filter-discount')?.checked || false;
+           const discountOnly = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1660:30
-           const discountOnly = document.getElementById('filter-discount')?.checked || false;
+           const discountOnly = document.getElementById('filter-discount')?.checked && false;

[NoCoverage] OptionalChaining
src/js/script.mjs:1660:30
-           const discountOnly = document.getElementById('filter-discount')?.checked || false;
+           const discountOnly = document.getElementById('filter-discount').checked || false;

[NoCoverage] StringLiteral
src/js/script.mjs:1660:54
-           const discountOnly = document.getElementById('filter-discount')?.checked || false;
+           const discountOnly = document.getElementById("")?.checked || false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1660:85
-           const discountOnly = document.getElementById('filter-discount')?.checked || false;
+           const discountOnly = document.getElementById('filter-discount')?.checked || true;

[NoCoverage] BlockStatement
src/js/script.mjs:1664:35
-       const appendBatch = (size) => {
-           if (!Array.isArray(filteredProducts) || filteredProducts.length === 0) {
-               updateLoadMoreVisibility();
-               return false;
-           }
-           const start = visibleCount;
-           if (start >= filteredProducts.length) {
-               updateLoadMoreVisibility();
-               return false;
-           }
-           const nextProducts = filteredProducts.slice(start, start + size);
-           if (!nextProducts.length) {
-               updateLoadMoreVisibility();
-               return false;
-           }
-           renderProducts(nextProducts);
-           visibleCount += nextProducts.length;
-           updateLoadMoreVisibility();
-           return true;
-       };
+       const appendBatch = (size) => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:1665:13
-           if (!Array.isArray(filteredProducts) || filteredProducts.length === 0) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1665:13
-           if (!Array.isArray(filteredProducts) || filteredProducts.length === 0) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1665:13
-           if (!Array.isArray(filteredProducts) || filteredProducts.length === 0) {
+           if (!Array.isArray(filteredProducts) && filteredProducts.length === 0) {

[NoCoverage] BooleanLiteral
src/js/script.mjs:1665:13
-           if (!Array.isArray(filteredProducts) || filteredProducts.length === 0) {
+           if (Array.isArray(filteredProducts) || filteredProducts.length === 0) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1665:49
-           if (!Array.isArray(filteredProducts) || filteredProducts.length === 0) {
+           if (!Array.isArray(filteredProducts) || false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1665:49
-           if (!Array.isArray(filteredProducts) || filteredProducts.length === 0) {
+           if (!Array.isArray(filteredProducts) || filteredProducts.length !== 0) {

[NoCoverage] BlockStatement
src/js/script.mjs:1665:80
-           if (!Array.isArray(filteredProducts) || filteredProducts.length === 0) {
-               updateLoadMoreVisibility();
-               return false;
-           }
+           if (!Array.isArray(filteredProducts) || filteredProducts.length === 0) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:1667:20
-               return false;
+               return true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1670:13
-           if (start >= filteredProducts.length) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1670:13
-           if (start >= filteredProducts.length) {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1670:13
-           if (start >= filteredProducts.length) {
+           if (start > filteredProducts.length) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1670:13
-           if (start >= filteredProducts.length) {
+           if (start < filteredProducts.length) {

[NoCoverage] BlockStatement
src/js/script.mjs:1670:47
-           if (start >= filteredProducts.length) {
-               updateLoadMoreVisibility();
-               return false;
-           }
+           if (start >= filteredProducts.length) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:1672:20
-               return false;
+               return true;

[NoCoverage] MethodExpression
src/js/script.mjs:1674:30
-           const nextProducts = filteredProducts.slice(start, start + size);
+           const nextProducts = filteredProducts;

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1674:60
-           const nextProducts = filteredProducts.slice(start, start + size);
+           const nextProducts = filteredProducts.slice(start, start - size);

[NoCoverage] BooleanLiteral
src/js/script.mjs:1675:13
-           if (!nextProducts.length) {
+           if (nextProducts.length) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1675:13
-           if (!nextProducts.length) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1675:13
-           if (!nextProducts.length) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1675:35
-           if (!nextProducts.length) {
-               updateLoadMoreVisibility();
-               return false;
-           }
+           if (!nextProducts.length) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:1677:20
-               return false;
+               return true;

[NoCoverage] AssignmentOperator
src/js/script.mjs:1680:9
-           visibleCount += nextProducts.length;
+           visibleCount -= nextProducts.length;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1682:16
-           return true;
+           return false;

[NoCoverage] BlockStatement
src/js/script.mjs:1685:38
-       const appendInitialBatch = () => {
-           const batchSize = initialBatchSize || INITIAL_BATCH_FALLBACK;
-           return appendBatch(batchSize);
-       };
+       const appendInitialBatch = () => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:1686:27
-           const batchSize = initialBatchSize || INITIAL_BATCH_FALLBACK;
+           const batchSize = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1686:27
-           const batchSize = initialBatchSize || INITIAL_BATCH_FALLBACK;
+           const batchSize = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1686:27
-           const batchSize = initialBatchSize || INITIAL_BATCH_FALLBACK;
+           const batchSize = initialBatchSize && INITIAL_BATCH_FALLBACK;

[NoCoverage] ArrowFunction
src/js/script.mjs:1690:29
-       const appendNextBatch = () => appendBatch(SUBSEQUENT_BATCH_SIZE);
+       const appendNextBatch = () => undefined;

[NoCoverage] BlockStatement
src/js/script.mjs:1692:44
-       const updateLoadMoreVisibility = () => {
-           const hasMore = visibleCount < filteredProducts.length;
-           if (loadMoreButton) {
-               loadMoreButton.classList.toggle('d-none', !hasMore);
-               loadMoreButton.disabled = !hasMore;
-           }
-           if (sentinelObserver && catalogSentinel) {
-               sentinelObserver.disconnect();
-               if (hasMore) {
-                   sentinelObserver.observe(catalogSentinel);
-               }
-           }
-       };
+       const updateLoadMoreVisibility = () => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:1693:25
-           const hasMore = visibleCount < filteredProducts.length;
+           const hasMore = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1693:25
-           const hasMore = visibleCount < filteredProducts.length;
+           const hasMore = false;

[NoCoverage] EqualityOperator
src/js/script.mjs:1693:25
-           const hasMore = visibleCount < filteredProducts.length;
+           const hasMore = visibleCount <= filteredProducts.length;

[NoCoverage] EqualityOperator
src/js/script.mjs:1693:25
-           const hasMore = visibleCount < filteredProducts.length;
+           const hasMore = visibleCount >= filteredProducts.length;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1694:13
-           if (loadMoreButton) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1694:13
-           if (loadMoreButton) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1694:29
-           if (loadMoreButton) {
-               loadMoreButton.classList.toggle('d-none', !hasMore);
-               loadMoreButton.disabled = !hasMore;
-           }
+           if (loadMoreButton) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1695:45
-               loadMoreButton.classList.toggle('d-none', !hasMore);
+               loadMoreButton.classList.toggle("", !hasMore);

[NoCoverage] BooleanLiteral
src/js/script.mjs:1695:55
-               loadMoreButton.classList.toggle('d-none', !hasMore);
+               loadMoreButton.classList.toggle('d-none', hasMore);

[NoCoverage] BooleanLiteral
src/js/script.mjs:1696:39
-               loadMoreButton.disabled = !hasMore;
+               loadMoreButton.disabled = hasMore;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1698:13
-           if (sentinelObserver && catalogSentinel) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1698:13
-           if (sentinelObserver && catalogSentinel) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1698:13
-           if (sentinelObserver && catalogSentinel) {
+           if (sentinelObserver || catalogSentinel) {

[NoCoverage] BlockStatement
src/js/script.mjs:1698:50
-           if (sentinelObserver && catalogSentinel) {
-               sentinelObserver.disconnect();
-               if (hasMore) {
-                   sentinelObserver.observe(catalogSentinel);
-               }
-           }
+           if (sentinelObserver && catalogSentinel) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1700:17
-               if (hasMore) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1700:17
-               if (hasMore) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1700:26
-               if (hasMore) {
-                   sentinelObserver.observe(catalogSentinel);
-               }
+               if (hasMore) {}

[NoCoverage] BlockStatement
src/js/script.mjs:1706:40
-       const setupDeferredLoading = () => {
-           loadMoreButton = document.getElementById('catalog-load-more');
-           catalogSentinel = document.getElementById('catalog-sentinel');
-           if (loadMoreButton) {
-               loadMoreButton.addEventListener('click', () => {
-                   appendNextBatch();
-               });
-           }
-           // Guard: some test/browser environments may lack IntersectionObserver
-           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {
-               sentinelObserver = new IntersectionObserver(entries => {
-                   entries.forEach(entry => {
-                       if (entry.isIntersecting) {
-                           appendNextBatch();
-                       }
-                   });
-               }, { rootMargin: '200px' });
-           }
-           updateLoadMoreVisibility();
-       };
+       const setupDeferredLoading = () => {};

[NoCoverage] StringLiteral
src/js/script.mjs:1707:50
-           loadMoreButton = document.getElementById('catalog-load-more');
+           loadMoreButton = document.getElementById("");

[NoCoverage] StringLiteral
src/js/script.mjs:1708:51
-           catalogSentinel = document.getElementById('catalog-sentinel');
+           catalogSentinel = document.getElementById("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1709:13
-           if (loadMoreButton) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1709:13
-           if (loadMoreButton) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1709:29
-           if (loadMoreButton) {
-               loadMoreButton.addEventListener('click', () => {
-                   appendNextBatch();
-               });
-           }
+           if (loadMoreButton) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1710:45
-               loadMoreButton.addEventListener('click', () => {
+               loadMoreButton.addEventListener("", () => {

[NoCoverage] BlockStatement
src/js/script.mjs:1710:60
-               loadMoreButton.addEventListener('click', () => {
-                   appendNextBatch();
-               });
+               loadMoreButton.addEventListener('click', () => {});

[NoCoverage] ConditionalExpression
src/js/script.mjs:1715:13
-           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1715:13
-           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1715:13
-           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (catalogSentinel && typeof window !== 'undefined' || 'IntersectionObserver' in window) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1715:13
-           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (true && 'IntersectionObserver' in window) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1715:13
-           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (catalogSentinel || typeof window !== 'undefined' && 'IntersectionObserver' in window) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1715:32
-           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (catalogSentinel && true && 'IntersectionObserver' in window) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1715:32
-           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (catalogSentinel && typeof window === 'undefined' && 'IntersectionObserver' in window) {

[NoCoverage] StringLiteral
src/js/script.mjs:1715:50
-           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (catalogSentinel && typeof window !== "" && 'IntersectionObserver' in window) {

[NoCoverage] StringLiteral
src/js/script.mjs:1715:65
-           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (catalogSentinel && typeof window !== 'undefined' && "" in window) {

[NoCoverage] BlockStatement
src/js/script.mjs:1715:99
-           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {
-               sentinelObserver = new IntersectionObserver(entries => {
-                   entries.forEach(entry => {
-                       if (entry.isIntersecting) {
-                           appendNextBatch();
-                       }
-                   });
-               }, { rootMargin: '200px' });
-           }
+           if (catalogSentinel && typeof window !== 'undefined' && 'IntersectionObserver' in window) {}

[NoCoverage] BlockStatement
src/js/script.mjs:1716:68
-               sentinelObserver = new IntersectionObserver(entries => {
-                   entries.forEach(entry => {
-                       if (entry.isIntersecting) {
-                           appendNextBatch();
-                       }
-                   });
-               }, { rootMargin: '200px' });
+               sentinelObserver = new IntersectionObserver(entries => {}, { rootMargin: '200px' });

[NoCoverage] BlockStatement
src/js/script.mjs:1717:42
-                   entries.forEach(entry => {
-                       if (entry.isIntersecting) {
-                           appendNextBatch();
-                       }
-                   });
+                   entries.forEach(entry => {});

[NoCoverage] ConditionalExpression
src/js/script.mjs:1718:25
-                       if (entry.isIntersecting) {
+                       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1718:25
-                       if (entry.isIntersecting) {
+                       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1718:47
-                       if (entry.isIntersecting) {
-                           appendNextBatch();
-                       }
+                       if (entry.isIntersecting) {}

[NoCoverage] ObjectLiteral
src/js/script.mjs:1722:16
-               }, { rootMargin: '200px' });
+               }, {});

[NoCoverage] StringLiteral
src/js/script.mjs:1722:30
-               }, { rootMargin: '200px' });
+               }, { rootMargin: "" });

[NoCoverage] BlockStatement
src/js/script.mjs:1727:34
-       const lazyLoadImages = () => {
-           if (typeof window !== 'undefined' && 'IntersectionObserver' in window) {
-               const imageObserver = new IntersectionObserver((entries, observer) => {
-                   entries.forEach(entry => {
-                       if (entry.isIntersecting) {
-                           const img = entry.target;
-                           img.src = img.dataset.src;
-                           if (img.dataset.srcset) img.srcset = img.dataset.srcset;
-                           if (img.dataset.sizes) img.sizes = img.dataset.sizes;
-                           img.classList.remove('lazyload');
-                           observer.unobserve(img);
-                       }
-                   });
-               }, { rootMargin: '100px' });
-   
-               document.querySelectorAll('img.lazyload').forEach(img => imageObserver.observe(img));
-           } else {
-               // Fallback: eagerly set sources without observing (avoids runtime errors)
-               document.querySelectorAll('img.lazyload').forEach(img => {
-                   if (img.dataset.src) img.src = img.dataset.src;
-                   if (img.dataset.srcset) img.srcset = img.dataset.srcset;
-                   if (img.dataset.sizes) img.sizes = img.dataset.sizes;
-                   img.classList.remove('lazyload');
-               });
-           }
-       };
+       con

[NoCoverage] ConditionalExpression
src/js/script.mjs:1728:13
-           if (typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1728:13
-           if (typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1728:13
-           if (typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (typeof window !== 'undefined' || 'IntersectionObserver' in window) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1728:13
-           if (typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (true && 'IntersectionObserver' in window) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1728:13
-           if (typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (typeof window === 'undefined' && 'IntersectionObserver' in window) {

[NoCoverage] StringLiteral
src/js/script.mjs:1728:31
-           if (typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (typeof window !== "" && 'IntersectionObserver' in window) {

[NoCoverage] StringLiteral
src/js/script.mjs:1728:46
-           if (typeof window !== 'undefined' && 'IntersectionObserver' in window) {
+           if (typeof window !== 'undefined' && "" in window) {
