[NoCoverage] BlockStatement
src/js/script.mjs:1728:80
-           if (typeof window !== 'undefined' && 'IntersectionObserver' in window) {
-               const imageObserver = new IntersectionObserver((entries, observer) => {
-                   entries.forEach(entry => {
-                       if (entry.isIntersecting) {
-                           const img = entry.target;
-                           img.src = img.dataset.src;
-                           if (img.dataset.srcset) img.srcset = img.dataset.srcset;
-                           if (img.dataset.sizes) img.sizes = img.dataset.sizes;
-                           img.classList.remove('lazyload');
-                           observer.unobserve(img);
-                       }
-                   });
-               }, { rootMargin: '100px' });
-   
-               document.querySelectorAll('img.lazyload').forEach(img => imageObserver.observe(img));
-           } else {
+           if (typeof window !== 'undefined' && 'IntersectionObserver' in window) {} else {

[NoCoverage] BlockStatement
src/js/script.mjs:1729:83
-               const imageObserver = new IntersectionObserver((entries, observer) => {
-                   entries.forEach(entry => {
-                       if (entry.isIntersecting) {
-                           const img = entry.target;
-                           img.src = img.dataset.src;
-                           if (img.dataset.srcset) img.srcset = img.dataset.srcset;
-                           if (img.dataset.sizes) img.sizes = img.dataset.sizes;
-                           img.classList.remove('lazyload');
-                           observer.unobserve(img);
-                       }
-                   });
-               }, { rootMargin: '100px' });
+               const imageObserver = new IntersectionObserver((entries, observer) => {}, { rootMargin: '100px' });

[NoCoverage] BlockStatement
src/js/script.mjs:1730:42
-                   entries.forEach(entry => {
-                       if (entry.isIntersecting) {
-                           const img = entry.target;
-                           img.src = img.dataset.src;
-                           if (img.dataset.srcset) img.srcset = img.dataset.srcset;
-                           if (img.dataset.sizes) img.sizes = img.dataset.sizes;
-                           img.classList.remove('lazyload');
-                           observer.unobserve(img);
-                       }
-                   });
+                   entries.forEach(entry => {});

[NoCoverage] ConditionalExpression
src/js/script.mjs:1731:25
-                       if (entry.isIntersecting) {
+                       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1731:25
-                       if (entry.isIntersecting) {
+                       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1731:47
-                       if (entry.isIntersecting) {
-                           const img = entry.target;
-                           img.src = img.dataset.src;
-                           if (img.dataset.srcset) img.srcset = img.dataset.srcset;
-                           if (img.dataset.sizes) img.sizes = img.dataset.sizes;
-                           img.classList.remove('lazyload');
-                           observer.unobserve(img);
-                       }
+                       if (entry.isIntersecting) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1734:29
-                           if (img.dataset.srcset) img.srcset = img.dataset.srcset;
+                           if (true) img.srcset = img.dataset.srcset;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1734:29
-                           if (img.dataset.srcset) img.srcset = img.dataset.srcset;
+                           if (false) img.srcset = img.dataset.srcset;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1735:29
-                           if (img.dataset.sizes) img.sizes = img.dataset.sizes;
+                           if (true) img.sizes = img.dataset.sizes;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1735:29
-                           if (img.dataset.sizes) img.sizes = img.dataset.sizes;
+                           if (false) img.sizes = img.dataset.sizes;

[NoCoverage] StringLiteral
src/js/script.mjs:1736:46
-                           img.classList.remove('lazyload');
+                           img.classList.remove("");

[NoCoverage] ObjectLiteral
src/js/script.mjs:1740:16
-               }, { rootMargin: '100px' });
+               }, {});

[NoCoverage] StringLiteral
src/js/script.mjs:1740:30
-               }, { rootMargin: '100px' });
+               }, { rootMargin: "" });

[NoCoverage] StringLiteral
src/js/script.mjs:1742:39
-               document.querySelectorAll('img.lazyload').forEach(img => imageObserver.observe(img));
+               document.querySelectorAll("").forEach(img => imageObserver.observe(img));

[NoCoverage] ArrowFunction
src/js/script.mjs:1742:63
-               document.querySelectorAll('img.lazyload').forEach(img => imageObserver.observe(img));
+               document.querySelectorAll('img.lazyload').forEach(() => undefined);

[NoCoverage] BlockStatement
src/js/script.mjs:1743:16
-           } else {
-               // Fallback: eagerly set sources without observing (avoids runtime errors)
-               document.querySelectorAll('img.lazyload').forEach(img => {
-                   if (img.dataset.src) img.src = img.dataset.src;
-                   if (img.dataset.srcset) img.srcset = img.dataset.srcset;
-                   if (img.dataset.sizes) img.sizes = img.dataset.sizes;
-                   img.classList.remove('lazyload');
-               });
-           }
+           } else {}

[NoCoverage] StringLiteral
src/js/script.mjs:1745:39
-               document.querySelectorAll('img.lazyload').forEach(img => {
+               document.querySelectorAll("").forEach(img => {

[NoCoverage] BlockStatement
src/js/script.mjs:1745:70
-               document.querySelectorAll('img.lazyload').forEach(img => {
-                   if (img.dataset.src) img.src = img.dataset.src;
-                   if (img.dataset.srcset) img.srcset = img.dataset.srcset;
-                   if (img.dataset.sizes) img.sizes = img.dataset.sizes;
-                   img.classList.remove('lazyload');
-               });
+               document.querySelectorAll('img.lazyload').forEach(img => {});

[NoCoverage] ConditionalExpression
src/js/script.mjs:1746:21
-                   if (img.dataset.src) img.src = img.dataset.src;
+                   if (true) img.src = img.dataset.src;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1746:21
-                   if (img.dataset.src) img.src = img.dataset.src;
+                   if (false) img.src = img.dataset.src;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1747:21
-                   if (img.dataset.srcset) img.srcset = img.dataset.srcset;
+                   if (true) img.srcset = img.dataset.srcset;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1747:21
-                   if (img.dataset.srcset) img.srcset = img.dataset.srcset;
+                   if (false) img.srcset = img.dataset.srcset;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1748:21
-                   if (img.dataset.sizes) img.sizes = img.dataset.sizes;
+                   if (true) img.sizes = img.dataset.sizes;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1748:21
-                   if (img.dataset.sizes) img.sizes = img.dataset.sizes;
+                   if (false) img.sizes = img.dataset.sizes;

[NoCoverage] StringLiteral
src/js/script.mjs:1749:38
-                   img.classList.remove('lazyload');
+                   img.classList.remove("");

[NoCoverage] BlockStatement
src/js/script.mjs:1755:41
-       function simpleTypoFix(query, text) {
-           if (!query || !text || query.length < 3) return false;
-   
-           const normalizeText = (str) => str.toLowerCase()
-               .normalize('NFD')
-               .replace(/[\u0300-\u036f]/g, '') // Remove accents only
-               .trim();
-   
-           const normalizedQuery = normalizeText(query);
-           const normalizedText = normalizeText(text);
-   
-           // First try exact match (same as original)
-           if (normalizedText.includes(normalizedQuery)) {
-               return true;
-           }
-   
-           // ONLY try typo correction if query is 4+ characters
-           // and the difference is just 1-2 characters
-           if (normalizedQuery.length >= 4) {
-               // Check if it's a simple 1-character typo
-               // Like "choclate" vs "chocolate" or "galetas" vs "galletas"
-               return isSimpleTypo(normalizedQuery, normalizedText);
-           }
-   
-           return false;
-       }
+       function simpleTypoFix(query, text) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1756:13
-           if (!query || !text || query.length < 3) return false;
+           if (true) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1756:13
-           if (!query || !text || query.length < 3) return false;
+           if (false) return false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1756:13
-           if (!query || !text || query.length < 3) return false;
+           if ((!query || !text) && query.length < 3) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1756:13
-           if (!query || !text || query.length < 3) return false;
+           if (false || query.length < 3) return false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1756:13
-           if (!query || !text || query.length < 3) return false;
+           if (!query && !text || query.length < 3) return false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1756:13
-           if (!query || !text || query.length < 3) return false;
+           if (query || !text || query.length < 3) return false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1756:23
-           if (!query || !text || query.length < 3) return false;
+           if (!query || text || query.length < 3) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1756:32
-           if (!query || !text || query.length < 3) return false;
+           if (!query || !text || false) return false;

[NoCoverage] EqualityOperator
src/js/script.mjs:1756:32
-           if (!query || !text || query.length < 3) return false;
+           if (!query || !text || query.length <= 3) return false;

[NoCoverage] EqualityOperator
src/js/script.mjs:1756:32
-           if (!query || !text || query.length < 3) return false;
+           if (!query || !text || query.length >= 3) return false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1756:57
-           if (!query || !text || query.length < 3) return false;
+           if (!query || !text || query.length < 3) return true;

[NoCoverage] ArrowFunction
src/js/script.mjs:1758:31
-           const normalizeText = (str) => str.toLowerCase()
-               .normalize('NFD')
-               .replace(/[\u0300-\u036f]/g, '') // Remove accents only
-               .trim();
+           const normalizeText = () => undefined;

[NoCoverage] MethodExpression
src/js/script.mjs:1758:40
-           const normalizeText = (str) => str.toLowerCase()
-               .normalize('NFD')
-               .replace(/[\u0300-\u036f]/g, '') // Remove accents only
-               .trim();
+           const normalizeText = (str) => str.toLowerCase().normalize('NFD').replace(/[\u0300-\u036f]/g, '') // Remove accents only;

[NoCoverage] MethodExpression
src/js/script.mjs:1758:40
-           const normalizeText = (str) => str.toLowerCase()
+           const normalizeText = (str) => str.toUpperCase()

[NoCoverage] StringLiteral
src/js/script.mjs:1759:24
-               .normalize('NFD')
+               .normalize("")

[NoCoverage] Regex
src/js/script.mjs:1760:22
-               .replace(/[\u0300-\u036f]/g, '') // Remove accents only
+               .replace(/[^\u0300-\u036f]/g, '') // Remove accents only

[NoCoverage] StringLiteral
src/js/script.mjs:1760:42
-               .replace(/[\u0300-\u036f]/g, '') // Remove accents only
+               .replace(/[\u0300-\u036f]/g, "Stryker was here!") // Remove accents only

[NoCoverage] ConditionalExpression
src/js/script.mjs:1767:13
-           if (normalizedText.includes(normalizedQuery)) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1767:13
-           if (normalizedText.includes(normalizedQuery)) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1767:55
-           if (normalizedText.includes(normalizedQuery)) {
-               return true;
-           }
+           if (normalizedText.includes(normalizedQuery)) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:1768:20
-               return true;
+               return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1773:13
-           if (normalizedQuery.length >= 4) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1773:13
-           if (normalizedQuery.length >= 4) {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1773:13
-           if (normalizedQuery.length >= 4) {
+           if (normalizedQuery.length > 4) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1773:13
-           if (normalizedQuery.length >= 4) {
+           if (normalizedQuery.length < 4) {

[NoCoverage] BlockStatement
src/js/script.mjs:1773:42
-           if (normalizedQuery.length >= 4) {
-               // Check if it's a simple 1-character typo
-               // Like "choclate" vs "chocolate" or "galetas" vs "galletas"
-               return isSimpleTypo(normalizedQuery, normalizedText);
-           }
+           if (normalizedQuery.length >= 4) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:1779:16
-           return false;
+           return true;

[NoCoverage] Regex
src/js/script.mjs:1784:34
-           const words = text.split(/\s+/);
+           const words = text.split(/\s/);

[NoCoverage] Regex
src/js/script.mjs:1784:34
-           const words = text.split(/\s+/);
+           const words = text.split(/\S+/);

[NoCoverage] MethodExpression
src/js/script.mjs:1786:16
-           return words.some(word => {
-               if (Math.abs(word.length - query.length) > 1) return false;
-   
-               // Count character differences
-               let differences = 0;
-               const maxLen = Math.max(word.length, query.length);
-               const minLen = Math.min(word.length, query.length);
-   
-               // Too short to safely compare
-               if (minLen < 4) return false;
-   
-               // Check for single character insertion/deletion
-               if (word.length === query.length) {
-                   // Same length - check for substitution
-                   for (let i = 0; i < word.length; i++) {
-                       if (word[i] !== query[i]) differences++;
-                       if (differences > 1) return false; // More than 1 difference
-                   }
-                   return differences === 1;
-               } else {
-                   // Different length - check for insertion/deletion
-                   return isOneCharacterDifference(query, word);
-               }
-           });
+           return words.every(word => {
+     if (Math.abs(word.length - query.length) > 1) return false;
+     // Count character differences
+     let differences = 0;

[NoCoverage] BlockStatement
src/js/script.mjs:1786:35
-           return words.some(word => {
-               if (Math.abs(word.length - query.length) > 1) return false;
-   
-               // Count character differences
-               let differences = 0;
-               const maxLen = Math.max(word.length, query.length);
-               const minLen = Math.min(word.length, query.length);
-   
-               // Too short to safely compare
-               if (minLen < 4) return false;
-   
-               // Check for single character insertion/deletion
-               if (word.length === query.length) {
-                   // Same length - check for substitution
-                   for (let i = 0; i < word.length; i++) {
-                       if (word[i] !== query[i]) differences++;
-                       if (differences > 1) return false; // More than 1 difference
-                   }
-                   return differences === 1;
-               } else {
-                   // Different length - check for insertion/deletion
-                   return isOneCharacterDifference(query, word);
-               }
-           });
+           return words.some(word => {});

[NoCoverage] ConditionalExpression
src/js/script.mjs:1787:17
-               if (Math.abs(word.length - query.length) > 1) return false;
+               if (true) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1787:17
-               if (Math.abs(word.length - query.length) > 1) return false;
+               if (false) return false;

[NoCoverage] EqualityOperator
src/js/script.mjs:1787:17
-               if (Math.abs(word.length - query.length) > 1) return false;
+               if (Math.abs(word.length - query.length) >= 1) return false;

[NoCoverage] EqualityOperator
src/js/script.mjs:1787:17
-               if (Math.abs(word.length - query.length) > 1) return false;
+               if (Math.abs(word.length - query.length) <= 1) return false;

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1787:26
-               if (Math.abs(word.length - query.length) > 1) return false;
+               if (Math.abs(word.length + query.length) > 1) return false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1787:66
-               if (Math.abs(word.length - query.length) > 1) return false;
+               if (Math.abs(word.length - query.length) > 1) return true;

[NoCoverage] MethodExpression
src/js/script.mjs:1791:28
-               const maxLen = Math.max(word.length, query.length);
+               const maxLen = Math.min(word.length, query.length);

[NoCoverage] MethodExpression
src/js/script.mjs:1792:28
-               const minLen = Math.min(word.length, query.length);
+               const minLen = Math.max(word.length, query.length);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1795:17
-               if (minLen < 4) return false;
+               if (true) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1795:17
-               if (minLen < 4) return false;
+               if (false) return false;

[NoCoverage] EqualityOperator
src/js/script.mjs:1795:17
-               if (minLen < 4) return false;
+               if (minLen <= 4) return false;

[NoCoverage] EqualityOperator
src/js/script.mjs:1795:17
-               if (minLen < 4) return false;
+               if (minLen >= 4) return false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1795:36
-               if (minLen < 4) return false;
+               if (minLen < 4) return true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1798:17
-               if (word.length === query.length) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1798:17
-               if (word.length === query.length) {
+               if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1798:17
-               if (word.length === query.length) {
+               if (word.length !== query.length) {

[NoCoverage] BlockStatement
src/js/script.mjs:1798:47
-               if (word.length === query.length) {
-                   // Same length - check for substitution
-                   for (let i = 0; i < word.length; i++) {
-                       if (word[i] !== query[i]) differences++;
-                       if (differences > 1) return false; // More than 1 difference
-                   }
-                   return differences === 1;
-               } else {
+               if (word.length === query.length) {} else {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1800:33
-                   for (let i = 0; i < word.length; i++) {
+                   for (let i = 0; false; i++) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1800:33
-                   for (let i = 0; i < word.length; i++) {
+                   for (let i = 0; i <= word.length; i++) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1800:33
-                   for (let i = 0; i < word.length; i++) {
+                   for (let i = 0; i >= word.length; i++) {

[NoCoverage] UpdateOperator
src/js/script.mjs:1800:50
-                   for (let i = 0; i < word.length; i++) {
+                   for (let i = 0; i < word.length; i--) {

[NoCoverage] BlockStatement
src/js/script.mjs:1800:55
-                   for (let i = 0; i < word.length; i++) {
-                       if (word[i] !== query[i]) differences++;
-                       if (differences > 1) return false; // More than 1 difference
-                   }
+                   for (let i = 0; i < word.length; i++) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1801:25
-                       if (word[i] !== query[i]) differences++;
+                       if (true) differences++;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1801:25
-                       if (word[i] !== query[i]) differences++;
+                       if (false) differences++;

[NoCoverage] EqualityOperator
src/js/script.mjs:1801:25
-                       if (word[i] !== query[i]) differences++;
+                       if (word[i] === query[i]) differences++;

[NoCoverage] UpdateOperator
src/js/script.mjs:1801:47
-                       if (word[i] !== query[i]) differences++;
+                       if (word[i] !== query[i]) differences--;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1802:25
-                       if (differences > 1) return false; // More than 1 difference
+                       if (true) return false; // More than 1 difference

[NoCoverage] ConditionalExpression
src/js/script.mjs:1802:25
-                       if (differences > 1) return false; // More than 1 difference
+                       if (false) return false; // More than 1 difference

[NoCoverage] EqualityOperator
src/js/script.mjs:1802:25
-                       if (differences > 1) return false; // More than 1 difference
+                       if (differences >= 1) return false; // More than 1 difference

[NoCoverage] EqualityOperator
src/js/script.mjs:1802:25
-                       if (differences > 1) return false; // More than 1 difference
+                       if (differences <= 1) return false; // More than 1 difference

[NoCoverage] BooleanLiteral
src/js/script.mjs:1802:49
-                       if (differences > 1) return false; // More than 1 difference
+                       if (differences > 1) return true; // More than 1 difference

[NoCoverage] ConditionalExpression
src/js/script.mjs:1804:24
-                   return differences === 1;
+                   return true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1804:24
-                   return differences === 1;
+                   return false;

[NoCoverage] EqualityOperator
src/js/script.mjs:1804:24
-                   return differences === 1;
+                   return differences !== 1;

[NoCoverage] BlockStatement
src/js/script.mjs:1805:20
-               } else {
-                   // Different length - check for insertion/deletion
-                   return isOneCharacterDifference(query, word);
-               }
+               } else {}

[NoCoverage] BlockStatement
src/js/script.mjs:1813:51
-       function isOneCharacterDifference(str1, str2) {
-           const longer = str1.length > str2.length ? str1 : str2;
-           const shorter = str1.length > str2.length ? str2 : str1;
-   
-           if (longer.length - shorter.length !== 1) return false;
-   
-           let shifts = 0;
-           let i = 0, j = 0;
-   
-           while (i < shorter.length && j < longer.length) {
-               if (shorter[i] === longer[j]) {
-                   i++;
-                   j++;
-               } else {
-                   shifts++;
-                   if (shifts > 1) return false; // More than one shift needed
-                   j++; // Skip the extra character in longer string
-               }
-           }
-   
-           return true;
-       }
+       function isOneCharacterDifference(str1, str2) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1814:24
-           const longer = str1.length > str2.length ? str1 : str2;
+           const longer = true ? str1 : str2;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1814:24
-           const longer = str1.length > str2.length ? str1 : str2;
+           const longer = false ? str1 : str2;

[NoCoverage] EqualityOperator
src/js/script.mjs:1814:24
-           const longer = str1.length > str2.length ? str1 : str2;
+           const longer = str1.length >= str2.length ? str1 : str2;

[NoCoverage] EqualityOperator
src/js/script.mjs:1814:24
-           const longer = str1.length > str2.length ? str1 : str2;
+           const longer = str1.length <= str2.length ? str1 : str2;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1815:25
-           const shorter = str1.length > str2.length ? str2 : str1;
+           const shorter = true ? str2 : str1;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1815:25
-           const shorter = str1.length > str2.length ? str2 : str1;
+           const shorter = false ? str2 : str1;

[NoCoverage] EqualityOperator
src/js/script.mjs:1815:25
-           const shorter = str1.length > str2.length ? str2 : str1;
+           const shorter = str1.length >= str2.length ? str2 : str1;

[NoCoverage] EqualityOperator
src/js/script.mjs:1815:25
-           const shorter = str1.length > str2.length ? str2 : str1;
+           const shorter = str1.length <= str2.length ? str2 : str1;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1817:13
-           if (longer.length - shorter.length !== 1) return false;
+           if (true) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1817:13
-           if (longer.length - shorter.length !== 1) return false;
+           if (false) return false;

[NoCoverage] EqualityOperator
src/js/script.mjs:1817:13
-           if (longer.length - shorter.length !== 1) return false;
+           if (longer.length - shorter.length === 1) return false;

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1817:13
-           if (longer.length - shorter.length !== 1) return false;
+           if (longer.length + shorter.length !== 1) return false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1817:58
-           if (longer.length - shorter.length !== 1) return false;
+           if (longer.length - shorter.length !== 1) return true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1822:16
-           while (i < shorter.length && j < longer.length) {
+           while (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1822:16
-           while (i < shorter.length && j < longer.length) {
+           while (i < shorter.length || j < longer.length) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1822:16
-           while (i < shorter.length && j < longer.length) {
+           while (true && j < longer.length) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1822:16
-           while (i < shorter.length && j < longer.length) {
+           while (i <= shorter.length && j < longer.length) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1822:16
-           while (i < shorter.length && j < longer.length) {
+           while (i >= shorter.length && j < longer.length) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1822:38
-           while (i < shorter.length && j < longer.length) {
+           while (i < shorter.length && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1822:38
-           while (i < shorter.length && j < longer.length) {
+           while (i < shorter.length && j <= longer.length) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1822:38
-           while (i < shorter.length && j < longer.length) {
+           while (i < shorter.length && j >= longer.length) {

[NoCoverage] BlockStatement
src/js/script.mjs:1822:57
-           while (i < shorter.length && j < longer.length) {
-               if (shorter[i] === longer[j]) {
-                   i++;
-                   j++;
-               } else {
-                   shifts++;
-                   if (shifts > 1) return false; // More than one shift needed
-                   j++; // Skip the extra character in longer string
-               }
-           }
+           while (i < shorter.length && j < longer.length) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1823:17
-               if (shorter[i] === longer[j]) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1823:17
-               if (shorter[i] === longer[j]) {
+               if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1823:17
-               if (shorter[i] === longer[j]) {
+               if (shorter[i] !== longer[j]) {

[NoCoverage] BlockStatement
src/js/script.mjs:1823:43
-               if (shorter[i] === longer[j]) {
-                   i++;
-                   j++;
-               } else {
+               if (shorter[i] === longer[j]) {} else {

[NoCoverage] UpdateOperator
src/js/script.mjs:1824:17
-                   i++;
+                   i--;
