[NoCoverage] UpdateOperator
src/js/script.mjs:1825:17
-                   j++;
+                   j--;

[NoCoverage] BlockStatement
src/js/script.mjs:1826:20
-               } else {
-                   shifts++;
-                   if (shifts > 1) return false; // More than one shift needed
-                   j++; // Skip the extra character in longer string
-               }
+               } else {}

[NoCoverage] UpdateOperator
src/js/script.mjs:1827:17
-                   shifts++;
+                   shifts--;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1828:21
-                   if (shifts > 1) return false; // More than one shift needed
+                   if (true) return false; // More than one shift needed

[NoCoverage] ConditionalExpression
src/js/script.mjs:1828:21
-                   if (shifts > 1) return false; // More than one shift needed
+                   if (false) return false; // More than one shift needed

[NoCoverage] EqualityOperator
src/js/script.mjs:1828:21
-                   if (shifts > 1) return false; // More than one shift needed
+                   if (shifts >= 1) return false; // More than one shift needed

[NoCoverage] EqualityOperator
src/js/script.mjs:1828:21
-                   if (shifts > 1) return false; // More than one shift needed
+                   if (shifts <= 1) return false; // More than one shift needed

[NoCoverage] BooleanLiteral
src/js/script.mjs:1828:40
-                   if (shifts > 1) return false; // More than one shift needed
+                   if (shifts > 1) return true; // More than one shift needed

[NoCoverage] UpdateOperator
src/js/script.mjs:1829:17
-                   j++; // Skip the extra character in longer string
+                   j--; // Skip the extra character in longer string

[NoCoverage] BooleanLiteral
src/js/script.mjs:1833:16
-           return true;
+           return false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1837:78
-       const filterProducts = (products, keyword, sortCriterion, discountOnly = false) => {
+       const filterProducts = (products, keyword, sortCriterion, discountOnly = true) => {

[NoCoverage] BlockStatement
src/js/script.mjs:1837:88
-       const filterProducts = (products, keyword, sortCriterion, discountOnly = false) => {
-           const trimmedKeyword = keyword.trim();
-   
-           return products
-               .filter(product => {
-                   if (!product.stock) return false;
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
-   
-                   // If no keyword, show all (same as original behavior)
-                   if (!trimmedKeyword) return true;
-   
-                   // Try EXACT matching first (exactly like original)
-                   const exactMatch = product.name.toLowerCase().includes(trimmedKeyword.toLowerCase()) ||
-                       product.description.toLowerCase().includes(trimmedKeyword.toLowerCase());
-   
-                   if (exactMatch) return true;
-   
-                   // ONLY try typo fix for longer queries and only for name field
-                   if (trimmedKeyword.length >= 4) {
-                       return simpleTypoFix(trimmedKeyword, product.name);
-                   }
-   
-                   return false;
-               })
-               .sort((a, b) => sortProducts(a, b, sortCriterion));
-       };
+       const filterProducts = (products, keyword, sortCriterion, discountOnly = false) => {};

[NoCoverage] MethodExpression
src/js/script.mjs:1838:32
-           const trimmedKeyword = keyword.trim();
+           const trimmedKeyword = keyword;

[NoCoverage] MethodExpression
src/js/script.mjs:1840:16
-           return products
-               .filter(product => {
-                   if (!product.stock) return false;
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
-   
-                   // If no keyword, show all (same as original behavior)
-                   if (!trimmedKeyword) return true;
-   
-                   // Try EXACT matching first (exactly like original)
-                   const exactMatch = product.name.toLowerCase().includes(trimmedKeyword.toLowerCase()) ||
-                       product.description.toLowerCase().includes(trimmedKeyword.toLowerCase());
-   
-                   if (exactMatch) return true;
-   
-                   // ONLY try typo fix for longer queries and only for name field
-                   if (trimmedKeyword.length >= 4) {
-                       return simpleTypoFix(trimmedKeyword, product.name);
-                   }
-   
-                   return false;
-               })
-               .sort((a, b) => sortProducts(a, b, sortCriterion));
+           return products.filter(product => {
+     if (!product.stock) return false;
+     if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+     // If no keyword, show all (same as original behavior)
+     if (!trimmedKeyword) return true;
+     // Try EXACT matching first (exactly like original)

[NoCoverage] MethodExpression
src/js/script.mjs:1840:16
-           return products
-               .filter(product => {
-                   if (!product.stock) return false;
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
-   
-                   // If no keyword, show all (same as original behavior)
-                   if (!trimmedKeyword) return true;
-   
-                   // Try EXACT matching first (exactly like original)
-                   const exactMatch = product.name.toLowerCase().includes(trimmedKeyword.toLowerCase()) ||
-                       product.description.toLowerCase().includes(trimmedKeyword.toLowerCase());
-   
-                   if (exactMatch) return true;
-   
-                   // ONLY try typo fix for longer queries and only for name field
-                   if (trimmedKeyword.length >= 4) {
-                       return simpleTypoFix(trimmedKeyword, product.name);
-                   }
-   
-                   return false;
-               })
+           return products

[NoCoverage] BlockStatement
src/js/script.mjs:1841:32
-               .filter(product => {
-                   if (!product.stock) return false;
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
-   
-                   // If no keyword, show all (same as original behavior)
-                   if (!trimmedKeyword) return true;
-   
-                   // Try EXACT matching first (exactly like original)
-                   const exactMatch = product.name.toLowerCase().includes(trimmedKeyword.toLowerCase()) ||
-                       product.description.toLowerCase().includes(trimmedKeyword.toLowerCase());
-   
-                   if (exactMatch) return true;
-   
-                   // ONLY try typo fix for longer queries and only for name field
-                   if (trimmedKeyword.length >= 4) {
-                       return simpleTypoFix(trimmedKeyword, product.name);
-                   }
-   
-                   return false;
-               })
+               .filter(product => {})

[NoCoverage] BooleanLiteral
src/js/script.mjs:1842:21
-                   if (!product.stock) return false;
+                   if (product.stock) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1842:21
-                   if (!product.stock) return false;
+                   if (true) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1842:21
-                   if (!product.stock) return false;
+                   if (false) return false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1842:44
-                   if (!product.stock) return false;
+                   if (!product.stock) return true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1843:21
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+                   if (true) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1843:21
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+                   if (false) return false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1843:21
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+                   if (discountOnly || !(product.discount && Number(product.discount) > 0)) return false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1843:37
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+                   if (discountOnly && product.discount && Number(product.discount) > 0) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1843:39
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+                   if (discountOnly && !(true)) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1843:39
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+                   if (discountOnly && !(false)) return false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1843:39
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+                   if (discountOnly && !(product.discount || Number(product.discount) > 0)) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1843:59
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+                   if (discountOnly && !(product.discount && true)) return false;

[NoCoverage] EqualityOperator
src/js/script.mjs:1843:59
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+                   if (discountOnly && !(product.discount && Number(product.discount) >= 0)) return false;

[NoCoverage] EqualityOperator
src/js/script.mjs:1843:59
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+                   if (discountOnly && !(product.discount && Number(product.discount) <= 0)) return false;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1843:97
-                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return false;
+                   if (discountOnly && !(product.discount && Number(product.discount) > 0)) return true;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1846:21
-                   if (!trimmedKeyword) return true;
+                   if (trimmedKeyword) return true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1846:21
-                   if (!trimmedKeyword) return true;
+                   if (true) return true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1846:21
-                   if (!trimmedKeyword) return true;
+                   if (false) return true;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1846:45
-                   if (!trimmedKeyword) return true;
+                   if (!trimmedKeyword) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1849:36
-                   const exactMatch = product.name.toLowerCase().includes(trimmedKeyword.toLowerCase()) ||
-                       product.description.toLowerCase().includes(trimmedKeyword.toLowerCase());
+                   const exactMatch = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1849:36
-                   const exactMatch = product.name.toLowerCase().includes(trimmedKeyword.toLowerCase()) ||
-                       product.description.toLowerCase().includes(trimmedKeyword.toLowerCase());
+                   const exactMatch = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1849:36
-                   const exactMatch = product.name.toLowerCase().includes(trimmedKeyword.toLowerCase()) ||
-                       product.description.toLowerCase().includes(trimmedKeyword.toLowerCase());
+                   const exactMatch = product.name.toLowerCase().includes(trimmedKeyword.toLowerCase()) && product.description.toLowerCase().includes(trimmedKeyword.toLowerCase());

[NoCoverage] MethodExpression
src/js/script.mjs:1849:36
-                   const exactMatch = product.name.toLowerCase().includes(trimmedKeyword.toLowerCase()) ||
+                   const exactMatch = product.name.toUpperCase().includes(trimmedKeyword.toLowerCase()) ||

[NoCoverage] MethodExpression
src/js/script.mjs:1849:72
-                   const exactMatch = product.name.toLowerCase().includes(trimmedKeyword.toLowerCase()) ||
+                   const exactMatch = product.name.toLowerCase().includes(trimmedKeyword.toUpperCase()) ||

[NoCoverage] MethodExpression
src/js/script.mjs:1850:21
-                       product.description.toLowerCase().includes(trimmedKeyword.toLowerCase());
+                       product.description.toUpperCase().includes(trimmedKeyword.toLowerCase());

[NoCoverage] MethodExpression
src/js/script.mjs:1850:64
-                       product.description.toLowerCase().includes(trimmedKeyword.toLowerCase());
+                       product.description.toLowerCase().includes(trimmedKeyword.toUpperCase());

[NoCoverage] ConditionalExpression
src/js/script.mjs:1852:21
-                   if (exactMatch) return true;
+                   if (true) return true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1852:21
-                   if (exactMatch) return true;
+                   if (false) return true;

[NoCoverage] BooleanLiteral
src/js/script.mjs:1852:40
-                   if (exactMatch) return true;
+                   if (exactMatch) return false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1855:21
-                   if (trimmedKeyword.length >= 4) {
+                   if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1855:21
-                   if (trimmedKeyword.length >= 4) {
+                   if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1855:21
-                   if (trimmedKeyword.length >= 4) {
+                   if (trimmedKeyword.length > 4) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1855:21
-                   if (trimmedKeyword.length >= 4) {
+                   if (trimmedKeyword.length < 4) {

[NoCoverage] BlockStatement
src/js/script.mjs:1855:49
-                   if (trimmedKeyword.length >= 4) {
-                       return simpleTypoFix(trimmedKeyword, product.name);
-                   }
+                   if (trimmedKeyword.length >= 4) {}

[NoCoverage] BooleanLiteral
src/js/script.mjs:1859:24
-                   return false;
+                   return true;

[NoCoverage] ArrowFunction
src/js/script.mjs:1861:19
-               .sort((a, b) => sortProducts(a, b, sortCriterion));
+               .sort(() => undefined);

[NoCoverage] BlockStatement
src/js/script.mjs:1864:47
-       const sortProducts = (a, b, criterion) => {
-           if (!criterion || criterion === 'original') {
-               return a.originalIndex - b.originalIndex;
-           }
-           const [property, order] = criterion.split('-');
-           const valueA = property === 'price' ? a.price - (a.discount || 0) : a.name.toLowerCase();
-           const valueB = property === 'price' ? b.price - (b.discount || 0) : b.name.toLowerCase();
-           return order === 'asc' ?
-               (valueA < valueB ? -1 : valueA > valueB ? 1 : 0) :
-               (valueB < valueA ? -1 : valueB > valueA ? 1 : 0);
-       };
+       const sortProducts = (a, b, criterion) => {};

[NoCoverage] ConditionalExpression
src/js/script.mjs:1865:13
-           if (!criterion || criterion === 'original') {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1865:13
-           if (!criterion || criterion === 'original') {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1865:13
-           if (!criterion || criterion === 'original') {
+           if (!criterion && criterion === 'original') {

[NoCoverage] BooleanLiteral
src/js/script.mjs:1865:13
-           if (!criterion || criterion === 'original') {
+           if (criterion || criterion === 'original') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1865:27
-           if (!criterion || criterion === 'original') {
+           if (!criterion || false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1865:27
-           if (!criterion || criterion === 'original') {
+           if (!criterion || criterion !== 'original') {

[NoCoverage] StringLiteral
src/js/script.mjs:1865:41
-           if (!criterion || criterion === 'original') {
+           if (!criterion || criterion === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:1865:53
-           if (!criterion || criterion === 'original') {
-               return a.originalIndex - b.originalIndex;
-           }
+           if (!criterion || criterion === 'original') {}

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1866:20
-               return a.originalIndex - b.originalIndex;
+               return a.originalIndex + b.originalIndex;

[NoCoverage] StringLiteral
src/js/script.mjs:1868:51
-           const [property, order] = criterion.split('-');
+           const [property, order] = criterion.split("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1869:24
-           const valueA = property === 'price' ? a.price - (a.discount || 0) : a.name.toLowerCase();
+           const valueA = true ? a.price - (a.discount || 0) : a.name.toLowerCase();

[NoCoverage] ConditionalExpression
src/js/script.mjs:1869:24
-           const valueA = property === 'price' ? a.price - (a.discount || 0) : a.name.toLowerCase();
+           const valueA = false ? a.price - (a.discount || 0) : a.name.toLowerCase();

[NoCoverage] EqualityOperator
src/js/script.mjs:1869:24
-           const valueA = property === 'price' ? a.price - (a.discount || 0) : a.name.toLowerCase();
+           const valueA = property !== 'price' ? a.price - (a.discount || 0) : a.name.toLowerCase();

[NoCoverage] StringLiteral
src/js/script.mjs:1869:37
-           const valueA = property === 'price' ? a.price - (a.discount || 0) : a.name.toLowerCase();
+           const valueA = property === "" ? a.price - (a.discount || 0) : a.name.toLowerCase();

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1869:47
-           const valueA = property === 'price' ? a.price - (a.discount || 0) : a.name.toLowerCase();
+           const valueA = property === 'price' ? a.price + (a.discount || 0) : a.name.toLowerCase();

[NoCoverage] ConditionalExpression
src/js/script.mjs:1869:58
-           const valueA = property === 'price' ? a.price - (a.discount || 0) : a.name.toLowerCase();
+           const valueA = property === 'price' ? a.price - (true) : a.name.toLowerCase();

[NoCoverage] ConditionalExpression
src/js/script.mjs:1869:58
-           const valueA = property === 'price' ? a.price - (a.discount || 0) : a.name.toLowerCase();
+           const valueA = property === 'price' ? a.price - (false) : a.name.toLowerCase();

[NoCoverage] LogicalOperator
src/js/script.mjs:1869:58
-           const valueA = property === 'price' ? a.price - (a.discount || 0) : a.name.toLowerCase();
+           const valueA = property === 'price' ? a.price - (a.discount && 0) : a.name.toLowerCase();

[NoCoverage] MethodExpression
src/js/script.mjs:1869:77
-           const valueA = property === 'price' ? a.price - (a.discount || 0) : a.name.toLowerCase();
+           const valueA = property === 'price' ? a.price - (a.discount || 0) : a.name.toUpperCase();

[NoCoverage] ConditionalExpression
src/js/script.mjs:1870:24
-           const valueB = property === 'price' ? b.price - (b.discount || 0) : b.name.toLowerCase();
+           const valueB = true ? b.price - (b.discount || 0) : b.name.toLowerCase();

[NoCoverage] ConditionalExpression
src/js/script.mjs:1870:24
-           const valueB = property === 'price' ? b.price - (b.discount || 0) : b.name.toLowerCase();
+           const valueB = false ? b.price - (b.discount || 0) : b.name.toLowerCase();

[NoCoverage] EqualityOperator
src/js/script.mjs:1870:24
-           const valueB = property === 'price' ? b.price - (b.discount || 0) : b.name.toLowerCase();
+           const valueB = property !== 'price' ? b.price - (b.discount || 0) : b.name.toLowerCase();

[NoCoverage] StringLiteral
src/js/script.mjs:1870:37
-           const valueB = property === 'price' ? b.price - (b.discount || 0) : b.name.toLowerCase();
+           const valueB = property === "" ? b.price - (b.discount || 0) : b.name.toLowerCase();

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1870:47
-           const valueB = property === 'price' ? b.price - (b.discount || 0) : b.name.toLowerCase();
+           const valueB = property === 'price' ? b.price + (b.discount || 0) : b.name.toLowerCase();

[NoCoverage] ConditionalExpression
src/js/script.mjs:1870:58
-           const valueB = property === 'price' ? b.price - (b.discount || 0) : b.name.toLowerCase();
+           const valueB = property === 'price' ? b.price - (true) : b.name.toLowerCase();

[NoCoverage] ConditionalExpression
src/js/script.mjs:1870:58
-           const valueB = property === 'price' ? b.price - (b.discount || 0) : b.name.toLowerCase();
+           const valueB = property === 'price' ? b.price - (false) : b.name.toLowerCase();

[NoCoverage] LogicalOperator
src/js/script.mjs:1870:58
-           const valueB = property === 'price' ? b.price - (b.discount || 0) : b.name.toLowerCase();
+           const valueB = property === 'price' ? b.price - (b.discount && 0) : b.name.toLowerCase();

[NoCoverage] MethodExpression
src/js/script.mjs:1870:77
-           const valueB = property === 'price' ? b.price - (b.discount || 0) : b.name.toLowerCase();
+           const valueB = property === 'price' ? b.price - (b.discount || 0) : b.name.toUpperCase();

[NoCoverage] ConditionalExpression
src/js/script.mjs:1871:16
-           return order === 'asc' ?
+           return true ?

[NoCoverage] ConditionalExpression
src/js/script.mjs:1871:16
-           return order === 'asc' ?
+           return false ?

[NoCoverage] EqualityOperator
src/js/script.mjs:1871:16
-           return order === 'asc' ?
+           return order !== 'asc' ?

[NoCoverage] StringLiteral
src/js/script.mjs:1871:26
-           return order === 'asc' ?
+           return order === "" ?

[NoCoverage] ConditionalExpression
src/js/script.mjs:1872:14
-               (valueA < valueB ? -1 : valueA > valueB ? 1 : 0) :
+               (true ? -1 : valueA > valueB ? 1 : 0) :

[NoCoverage] ConditionalExpression
src/js/script.mjs:1872:14
-               (valueA < valueB ? -1 : valueA > valueB ? 1 : 0) :
+               (false ? -1 : valueA > valueB ? 1 : 0) :

[NoCoverage] EqualityOperator
src/js/script.mjs:1872:14
-               (valueA < valueB ? -1 : valueA > valueB ? 1 : 0) :
+               (valueA <= valueB ? -1 : valueA > valueB ? 1 : 0) :

[NoCoverage] EqualityOperator
src/js/script.mjs:1872:14
-               (valueA < valueB ? -1 : valueA > valueB ? 1 : 0) :
+               (valueA >= valueB ? -1 : valueA > valueB ? 1 : 0) :

[NoCoverage] UnaryOperator
src/js/script.mjs:1872:32
-               (valueA < valueB ? -1 : valueA > valueB ? 1 : 0) :
+               (valueA < valueB ? +1 : valueA > valueB ? 1 : 0) :

[NoCoverage] ConditionalExpression
src/js/script.mjs:1872:37
-               (valueA < valueB ? -1 : valueA > valueB ? 1 : 0) :
+               (valueA < valueB ? -1 : true ? 1 : 0) :

[NoCoverage] ConditionalExpression
src/js/script.mjs:1872:37
-               (valueA < valueB ? -1 : valueA > valueB ? 1 : 0) :
+               (valueA < valueB ? -1 : false ? 1 : 0) :

[NoCoverage] EqualityOperator
src/js/script.mjs:1872:37
-               (valueA < valueB ? -1 : valueA > valueB ? 1 : 0) :
+               (valueA < valueB ? -1 : valueA >= valueB ? 1 : 0) :

[NoCoverage] EqualityOperator
src/js/script.mjs:1872:37
-               (valueA < valueB ? -1 : valueA > valueB ? 1 : 0) :
+               (valueA < valueB ? -1 : valueA <= valueB ? 1 : 0) :

[NoCoverage] ConditionalExpression
src/js/script.mjs:1873:14
-               (valueB < valueA ? -1 : valueB > valueA ? 1 : 0);
+               (true ? -1 : valueB > valueA ? 1 : 0);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1873:14
-               (valueB < valueA ? -1 : valueB > valueA ? 1 : 0);
+               (false ? -1 : valueB > valueA ? 1 : 0);

[NoCoverage] EqualityOperator
src/js/script.mjs:1873:14
-               (valueB < valueA ? -1 : valueB > valueA ? 1 : 0);
+               (valueB <= valueA ? -1 : valueB > valueA ? 1 : 0);

[NoCoverage] EqualityOperator
src/js/script.mjs:1873:14
-               (valueB < valueA ? -1 : valueB > valueA ? 1 : 0);
+               (valueB >= valueA ? -1 : valueB > valueA ? 1 : 0);

[NoCoverage] UnaryOperator
src/js/script.mjs:1873:32
-               (valueB < valueA ? -1 : valueB > valueA ? 1 : 0);
+               (valueB < valueA ? +1 : valueB > valueA ? 1 : 0);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1873:37
-               (valueB < valueA ? -1 : valueB > valueA ? 1 : 0);
+               (valueB < valueA ? -1 : true ? 1 : 0);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1873:37
-               (valueB < valueA ? -1 : valueB > valueA ? 1 : 0);
+               (valueB < valueA ? -1 : false ? 1 : 0);

[NoCoverage] EqualityOperator
src/js/script.mjs:1873:37
-               (valueB < valueA ? -1 : valueB > valueA ? 1 : 0);
+               (valueB < valueA ? -1 : valueB >= valueA ? 1 : 0);

[NoCoverage] EqualityOperator
src/js/script.mjs:1873:37
-               (valueB < valueA ? -1 : valueB > valueA ? 1 : 0);
+               (valueB < valueA ? -1 : valueB <= valueA ? 1 : 0);

[NoCoverage] BlockStatement
src/js/script.mjs:1878:40
-       const updateProductDisplay = () => {
-           try {
-               applyFilters();
-               resetProductList();
-               if (!filteredProducts.length) {
-                   updateLoadMoreVisibility();
-                   return;
-               }
-               appendInitialBatch();
-           } catch (error) {
-               console.error('Error al actualizar visualización de productos:', error);
-               showErrorMessage('Error al actualizar la visualización de productos. Por favor, intenta más tarde.');
-           }
-       };
+       const updateProductDisplay = () => {};

[NoCoverage] BlockStatement
src/js/script.mjs:1879:13
-           try {
-               applyFilters();
-               resetProductList();
-               if (!filteredProducts.length) {
-                   updateLoadMoreVisibility();
-                   return;
-               }
-               appendInitialBatch();
-           } catch (error) {
+           try {} catch (error) {

[NoCoverage] BooleanLiteral
src/js/script.mjs:1882:17
-               if (!filteredProducts.length) {
+               if (filteredProducts.length) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1882:17
-               if (!filteredProducts.length) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1882:17
-               if (!filteredProducts.length) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1882:43
-               if (!filteredProducts.length) {
-                   updateLoadMoreVisibility();
-                   return;
-               }
+               if (!filteredProducts.length) {}

[NoCoverage] BlockStatement
src/js/script.mjs:1887:25
-           } catch (error) {
-               console.error('Error al actualizar visualización de productos:', error);
-               showErrorMessage('Error al actualizar la visualización de productos. Por favor, intenta más tarde.');
-           }
+           } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1888:27
-               console.error('Error al actualizar visualización de productos:', error);
+               console.error("", error);

[NoCoverage] StringLiteral
src/js/script.mjs:1889:30
-               showErrorMessage('Error al actualizar la visualización de productos. Por favor, intenta más tarde.');
+               showErrorMessage("");

[NoCoverage] BlockStatement
src/js/script.mjs:1894:58
-       const debouncedUpdateProductDisplay = debounce(() => {
-           cancelScheduledIdle(pendingIdleUpdate);
-           pendingIdleUpdate = scheduleIdle(() => {
-               updateProductDisplay();
-               pendingIdleUpdate = null;
-           }, 400);
-       }, 150);
+       const debouncedUpdateProductDisplay = debounce(() => {}, 150);

[NoCoverage] BlockStatement
src/js/script.mjs:1896:48
-           pendingIdleUpdate = scheduleIdle(() => {
-               updateProductDisplay();
-               pendingIdleUpdate = null;
-           }, 400);
+           pendingIdleUpdate = scheduleIdle(() => {}, 400);

[NoCoverage] StringLiteral
src/js/script.mjs:1904:54
-           const paymentError = document.getElementById('payment-error');
+           const paymentError = document.getElementById("");

[NoCoverage] StringLiteral
src/js/script.mjs:1905:56
-           const selectedPayment = document.querySelector('input[name="paymentMethod"]:checked');
+           const selectedPayment = document.querySelector("");

[NoCoverage] BooleanLiteral
src/js/script.mjs:1906:13
-           if (!selectedPayment) {
+           if (selectedPayment) {
