[NoCoverage] ConditionalExpression
src/js/script.mjs:1906:13
-           if (!selectedPayment) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1906:13
-           if (!selectedPayment) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1906:31
-           if (!selectedPayment) {
-               if (paymentError) {
-                   paymentError.textContent = 'Por favor seleccione un método de pago';
-               }
-               const firstPayment = document.querySelector('input[name="paymentMethod"]');
-               if (firstPayment && typeof firstPayment.focus === 'function') {
-                   firstPayment.focus();
-               }
-               return;
-           }
+           if (!selectedPayment) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1907:17
-               if (paymentError) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1907:17
-               if (paymentError) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1907:31
-               if (paymentError) {
-                   paymentError.textContent = 'Por favor seleccione un método de pago';
-               }
+               if (paymentError) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1908:44
-                   paymentError.textContent = 'Por favor seleccione un método de pago';
+                   paymentError.textContent = "";

[NoCoverage] StringLiteral
src/js/script.mjs:1910:57
-               const firstPayment = document.querySelector('input[name="paymentMethod"]');
+               const firstPayment = document.querySelector("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1911:17
-               if (firstPayment && typeof firstPayment.focus === 'function') {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1911:17
-               if (firstPayment && typeof firstPayment.focus === 'function') {
+               if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1911:17
-               if (firstPayment && typeof firstPayment.focus === 'function') {
+               if (firstPayment || typeof firstPayment.focus === 'function') {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1911:33
-               if (firstPayment && typeof firstPayment.focus === 'function') {
+               if (firstPayment && true) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1911:33
-               if (firstPayment && typeof firstPayment.focus === 'function') {
+               if (firstPayment && typeof firstPayment.focus !== 'function') {

[NoCoverage] StringLiteral
src/js/script.mjs:1911:63
-               if (firstPayment && typeof firstPayment.focus === 'function') {
+               if (firstPayment && typeof firstPayment.focus === "") {

[NoCoverage] BlockStatement
src/js/script.mjs:1911:75
-               if (firstPayment && typeof firstPayment.focus === 'function') {
-                   firstPayment.focus();
-               }
+               if (firstPayment && typeof firstPayment.focus === 'function') {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1916:13
-           if (paymentError) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1916:13
-           if (paymentError) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1916:27
-           if (paymentError) {
-               paymentError.textContent = '';
-           }
+           if (paymentError) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1917:40
-               paymentError.textContent = '';
+               paymentError.textContent = "Stryker was here!";

[NoCoverage] StringLiteral
src/js/script.mjs:1920:23
-           let message = "Mi pedido:\n\n";
+           let message = "";

[NoCoverage] BlockStatement
src/js/script.mjs:1921:30
-           cart.forEach(item => {
-               const discountedPrice = item.price - (item.discount || 0);
-               message += `${item.name}\n`;
-               message += `Cantidad: ${item.quantity}\n`;
-               message += `Precio unitario: $${discountedPrice.toLocaleString('es-CL')}\n`;
-               message += `Subtotal: $${(discountedPrice * item.quantity).toLocaleString('es-CL')}\n\n`;
-           });
+           cart.forEach(item => {});

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1922:37
-               const discountedPrice = item.price - (item.discount || 0);
+               const discountedPrice = item.price + (item.discount || 0);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1922:51
-               const discountedPrice = item.price - (item.discount || 0);
+               const discountedPrice = item.price - (true);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1922:51
-               const discountedPrice = item.price - (item.discount || 0);
+               const discountedPrice = item.price - (false);

[NoCoverage] LogicalOperator
src/js/script.mjs:1922:51
-               const discountedPrice = item.price - (item.discount || 0);
+               const discountedPrice = item.price - (item.discount && 0);

[NoCoverage] StringLiteral
src/js/script.mjs:1923:24
-               message += `${item.name}\n`;
+               message += ``;

[NoCoverage] StringLiteral
src/js/script.mjs:1924:24
-               message += `Cantidad: ${item.quantity}\n`;
+               message += ``;

[NoCoverage] StringLiteral
src/js/script.mjs:1925:24
-               message += `Precio unitario: $${discountedPrice.toLocaleString('es-CL')}\n`;
+               message += ``;

[NoCoverage] StringLiteral
src/js/script.mjs:1925:76
-               message += `Precio unitario: $${discountedPrice.toLocaleString('es-CL')}\n`;
+               message += `Precio unitario: $${discountedPrice.toLocaleString("")}\n`;

[NoCoverage] StringLiteral
src/js/script.mjs:1926:24
-               message += `Subtotal: $${(discountedPrice * item.quantity).toLocaleString('es-CL')}\n\n`;
+               message += ``;

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1926:39
-               message += `Subtotal: $${(discountedPrice * item.quantity).toLocaleString('es-CL')}\n\n`;
+               message += `Subtotal: $${(discountedPrice / item.quantity).toLocaleString('es-CL')}\n\n`;

[NoCoverage] StringLiteral
src/js/script.mjs:1926:87
-               message += `Subtotal: $${(discountedPrice * item.quantity).toLocaleString('es-CL')}\n\n`;
+               message += `Subtotal: $${(discountedPrice * item.quantity).toLocaleString("")}\n\n`;

[NoCoverage] ArrowFunction
src/js/script.mjs:1929:35
-           const total = cart.reduce((sum, item) => sum + (item.price - (item.discount || 0)) * item.quantity, 0);
+           const total = cart.reduce(() => undefined, 0);

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1929:50
-           const total = cart.reduce((sum, item) => sum + (item.price - (item.discount || 0)) * item.quantity, 0);
+           const total = cart.reduce((sum, item) => sum - (item.price - (item.discount || 0)) * item.quantity, 0);

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1929:56
-           const total = cart.reduce((sum, item) => sum + (item.price - (item.discount || 0)) * item.quantity, 0);
+           const total = cart.reduce((sum, item) => sum + (item.price - (item.discount || 0)) / item.quantity, 0);

[NoCoverage] ArithmeticOperator
src/js/script.mjs:1929:57
-           const total = cart.reduce((sum, item) => sum + (item.price - (item.discount || 0)) * item.quantity, 0);
+           const total = cart.reduce((sum, item) => sum + (item.price + (item.discount || 0)) * item.quantity, 0);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1929:71
-           const total = cart.reduce((sum, item) => sum + (item.price - (item.discount || 0)) * item.quantity, 0);
+           const total = cart.reduce((sum, item) => sum + (item.price - (true)) * item.quantity, 0);

[NoCoverage] ConditionalExpression
src/js/script.mjs:1929:71
-           const total = cart.reduce((sum, item) => sum + (item.price - (item.discount || 0)) * item.quantity, 0);
+           const total = cart.reduce((sum, item) => sum + (item.price - (false)) * item.quantity, 0);

[NoCoverage] LogicalOperator
src/js/script.mjs:1929:71
-           const total = cart.reduce((sum, item) => sum + (item.price - (item.discount || 0)) * item.quantity, 0);
+           const total = cart.reduce((sum, item) => sum + (item.price - (item.discount && 0)) * item.quantity, 0);

[NoCoverage] StringLiteral
src/js/script.mjs:1930:20
-           message += `Total: $${total.toLocaleString('es-CL')}\n`;
+           message += ``;

[NoCoverage] StringLiteral
src/js/script.mjs:1930:52
-           message += `Total: $${total.toLocaleString('es-CL')}\n`;
+           message += `Total: $${total.toLocaleString("")}\n`;

[NoCoverage] StringLiteral
src/js/script.mjs:1931:20
-           message += `Método de pago: ${selectedPayment.value}`;
+           message += ``;

[NoCoverage] StringLiteral
src/js/script.mjs:1934:21
-           window.open(`https://wa.me/56951118901?text=${encodedMessage}`, '_blank');
+           window.open(``, '_blank');

[NoCoverage] StringLiteral
src/js/script.mjs:1934:73
-           window.open(`https://wa.me/56951118901?text=${encodedMessage}`, '_blank');
+           window.open(`https://wa.me/56951118901?text=${encodedMessage}`, "");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1941:13
-           if (bootstrapPayload?.products?.length) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1941:13
-           if (bootstrapPayload?.products?.length) {
+           if (false) {

[NoCoverage] OptionalChaining
src/js/script.mjs:1941:13
-           if (bootstrapPayload?.products?.length) {
+           if (bootstrapPayload?.products.length) {

[NoCoverage] OptionalChaining
src/js/script.mjs:1941:13
-           if (bootstrapPayload?.products?.length) {
+           if (bootstrapPayload.products?.length) {

[NoCoverage] BlockStatement
src/js/script.mjs:1941:49
-           if (bootstrapPayload?.products?.length) {
-               products = bootstrapPayload.products.map((product, index) => ({
-                   ...product,
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
-                   categoryKey: product.categoryKey || normalizeString(product.category)
-               }));
-           }
+           if (bootstrapPayload?.products?.length) {}

[NoCoverage] ArrowFunction
src/js/script.mjs:1942:54
-               products = bootstrapPayload.products.map((product, index) => ({
-                   ...product,
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
-                   categoryKey: product.categoryKey || normalizeString(product.category)
-               }));
+               products = bootstrapPayload.products.map(() => undefined);

[NoCoverage] ObjectLiteral
src/js/script.mjs:1942:75
-               products = bootstrapPayload.products.map((product, index) => ({
-                   ...product,
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
-                   categoryKey: product.categoryKey || normalizeString(product.category)
-               }));
+               products = bootstrapPayload.products.map((product, index) => ({}));

[NoCoverage] ConditionalExpression
src/js/script.mjs:1944:32
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
+                   originalIndex: true ? product.originalIndex : index,

[NoCoverage] ConditionalExpression
src/js/script.mjs:1944:32
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
+                   originalIndex: false ? product.originalIndex : index,

[NoCoverage] EqualityOperator
src/js/script.mjs:1944:32
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
+                   originalIndex: typeof product.originalIndex !== 'number' ? product.originalIndex : index,

[NoCoverage] StringLiteral
src/js/script.mjs:1944:65
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
+                   originalIndex: typeof product.originalIndex === "" ? product.originalIndex : index,

[NoCoverage] ConditionalExpression
src/js/script.mjs:1945:30
-                   categoryKey: product.categoryKey || normalizeString(product.category)
+                   categoryKey: true

[NoCoverage] ConditionalExpression
src/js/script.mjs:1945:30
-                   categoryKey: product.categoryKey || normalizeString(product.category)
+                   categoryKey: false

[NoCoverage] LogicalOperator
src/js/script.mjs:1945:30
-                   categoryKey: product.categoryKey || normalizeString(product.category)
+                   categoryKey: product.categoryKey && normalizeString(product.category)

[NoCoverage] StringLiteral
src/js/script.mjs:1949:52
-           const mainElement = document.querySelector('main');
+           const mainElement = document.querySelector("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:1950:33
-           const currentCategory = mainElement?.dataset?.category || '';
+           const currentCategory = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1950:33
-           const currentCategory = mainElement?.dataset?.category || '';
+           const currentCategory = false;

[NoCoverage] LogicalOperator
src/js/script.mjs:1950:33
-           const currentCategory = mainElement?.dataset?.category || '';
+           const currentCategory = mainElement?.dataset?.category && '';

[NoCoverage] OptionalChaining
src/js/script.mjs:1950:33
-           const currentCategory = mainElement?.dataset?.category || '';
+           const currentCategory = mainElement?.dataset.category || '';

[NoCoverage] OptionalChaining
src/js/script.mjs:1950:33
-           const currentCategory = mainElement?.dataset?.category || '';
+           const currentCategory = mainElement.dataset?.category || '';

[NoCoverage] StringLiteral
src/js/script.mjs:1950:67
-           const currentCategory = mainElement?.dataset?.category || '';
+           const currentCategory = mainElement?.dataset?.category || "Stryker was here!";

[NoCoverage] ConditionalExpression
src/js/script.mjs:1951:13
-           if (currentCategory) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1951:13
-           if (currentCategory) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1951:30
-           if (currentCategory) {
-               const normCurrent = normalizeString(currentCategory);
-               products = products
-                   .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
-                   .map((product, index) => ({
-                       ...product,
-                       originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
-                   }));
-           }
+           if (currentCategory) {}

[NoCoverage] MethodExpression
src/js/script.mjs:1953:24
-               products = products
-                   .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+               products = products

[NoCoverage] ArrowFunction
src/js/script.mjs:1954:25
-                   .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                   .filter(() => undefined)

[NoCoverage] ConditionalExpression
src/js/script.mjs:1954:36
-                   .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                   .filter(product => true)

[NoCoverage] ConditionalExpression
src/js/script.mjs:1954:36
-                   .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                   .filter(product => false)

[NoCoverage] EqualityOperator
src/js/script.mjs:1954:36
-                   .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                   .filter(product => (product.categoryKey || normalizeString(product.category)) !== normCurrent)

[NoCoverage] ConditionalExpression
src/js/script.mjs:1954:37
-                   .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                   .filter(product => (true) === normCurrent)

[NoCoverage] ConditionalExpression
src/js/script.mjs:1954:37
-                   .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                   .filter(product => (false) === normCurrent)

[NoCoverage] LogicalOperator
src/js/script.mjs:1954:37
-                   .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                   .filter(product => (product.categoryKey && normalizeString(product.category)) === normCurrent)

[NoCoverage] ArrowFunction
src/js/script.mjs:1955:22
-                   .map((product, index) => ({
-                       ...product,
-                       originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
-                   }));
+                   .map(() => undefined);

[NoCoverage] ObjectLiteral
src/js/script.mjs:1955:43
-                   .map((product, index) => ({
-                       ...product,
-                       originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
-                   }));
+                   .map((product, index) => ({}));

[NoCoverage] ConditionalExpression
src/js/script.mjs:1957:36
-                       originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
+                       originalIndex: true ? product.originalIndex : index

[NoCoverage] ConditionalExpression
src/js/script.mjs:1957:36
-                       originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
+                       originalIndex: false ? product.originalIndex : index

[NoCoverage] EqualityOperator
src/js/script.mjs:1957:36
-                       originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
+                       originalIndex: typeof product.originalIndex !== 'number' ? product.originalIndex : index

[NoCoverage] StringLiteral
src/js/script.mjs:1957:69
-                       originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
+                       originalIndex: typeof product.originalIndex === "" ? product.originalIndex : index

[NoCoverage] ConditionalExpression
src/js/script.mjs:1962:13
-           if (hydratedCount > 0) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1962:13
-           if (hydratedCount > 0) {
+           if (false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1962:13
-           if (hydratedCount > 0) {
+           if (hydratedCount >= 0) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1962:13
-           if (hydratedCount > 0) {
+           if (hydratedCount <= 0) {

[NoCoverage] BlockStatement
src/js/script.mjs:1962:32
-           if (hydratedCount > 0) {
-               visibleCount = hydratedCount;
-               initialBatchSize = hydratedCount;
-           } else {
+           if (hydratedCount > 0) {} else {

[NoCoverage] BlockStatement
src/js/script.mjs:1965:16
-           } else {
-               visibleCount = 0;
-           }
+           } else {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:1972:13
-           if (visibleCount === 0 && filteredProducts.length) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1972:13
-           if (visibleCount === 0 && filteredProducts.length) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1972:13
-           if (visibleCount === 0 && filteredProducts.length) {
+           if (visibleCount === 0 || filteredProducts.length) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1972:13
-           if (visibleCount === 0 && filteredProducts.length) {
+           if (true && filteredProducts.length) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1972:13
-           if (visibleCount === 0 && filteredProducts.length) {
+           if (visibleCount !== 0 && filteredProducts.length) {

[NoCoverage] BlockStatement
src/js/script.mjs:1972:60
-           if (visibleCount === 0 && filteredProducts.length) {
-               appendInitialBatch();
-           }
+           if (visibleCount === 0 && filteredProducts.length) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1978:38
-           sortOptions.addEventListener('change', () => {
+           sortOptions.addEventListener("", () => {

[NoCoverage] BlockStatement
src/js/script.mjs:1978:54
-           sortOptions.addEventListener('change', () => {
-               userHasInteracted = true;
-               debouncedUpdateProductDisplay();
-           });
+           sortOptions.addEventListener('change', () => {});

[NoCoverage] BooleanLiteral
src/js/script.mjs:1979:33
-               userHasInteracted = true;
+               userHasInteracted = false;

[NoCoverage] StringLiteral
src/js/script.mjs:1982:40
-           filterKeyword.addEventListener('input', () => {
+           filterKeyword.addEventListener("", () => {

[NoCoverage] BlockStatement
src/js/script.mjs:1982:55
-           filterKeyword.addEventListener('input', () => {
-               userHasInteracted = true;
-               debouncedUpdateProductDisplay();
-           });
+           filterKeyword.addEventListener('input', () => {});

[NoCoverage] BooleanLiteral
src/js/script.mjs:1983:33
-               userHasInteracted = true;
+               userHasInteracted = false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1988:13
-           if (discountToggle) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1988:13
-           if (discountToggle) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1988:29
-           if (discountToggle) {
-               discountToggle.addEventListener('change', () => {
-                   userHasInteracted = true;
-                   debouncedUpdateProductDisplay();
-               });
-           }
+           if (discountToggle) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1989:45
-               discountToggle.addEventListener('change', () => {
+               discountToggle.addEventListener("", () => {

[NoCoverage] BlockStatement
src/js/script.mjs:1989:61
-               discountToggle.addEventListener('change', () => {
-                   userHasInteracted = true;
-                   debouncedUpdateProductDisplay();
-               });
+               discountToggle.addEventListener('change', () => {});

[NoCoverage] BooleanLiteral
src/js/script.mjs:1990:37
-                   userHasInteracted = true;
+                   userHasInteracted = false;

[NoCoverage] ConditionalExpression
src/js/script.mjs:1997:13
-           if (!Array.isArray(networkProducts) || networkProducts.length === 0) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1997:13
-           if (!Array.isArray(networkProducts) || networkProducts.length === 0) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:1997:13
-           if (!Array.isArray(networkProducts) || networkProducts.length === 0) {
+           if (!Array.isArray(networkProducts) && networkProducts.length === 0) {

[NoCoverage] BooleanLiteral
src/js/script.mjs:1997:13
-           if (!Array.isArray(networkProducts) || networkProducts.length === 0) {
+           if (Array.isArray(networkProducts) || networkProducts.length === 0) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1997:48
-           if (!Array.isArray(networkProducts) || networkProducts.length === 0) {
+           if (!Array.isArray(networkProducts) || false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:1997:48
-           if (!Array.isArray(networkProducts) || networkProducts.length === 0) {
+           if (!Array.isArray(networkProducts) || networkProducts.length !== 0) {

[NoCoverage] BlockStatement
src/js/script.mjs:1997:78
-           if (!Array.isArray(networkProducts) || networkProducts.length === 0) {
-               if (!products.length) {
-                   showErrorMessage('No hay productos disponibles. Por favor, intenta más tarde.');
-                   return;
-               }
-           } else {
+           if (!Array.isArray(networkProducts) || networkProducts.length === 0) {} else {

[NoCoverage] BooleanLiteral
src/js/script.mjs:1998:17
-               if (!products.length) {
+               if (products.length) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1998:17
-               if (!products.length) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:1998:17
-               if (!products.length) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:1998:35
-               if (!products.length) {
-                   showErrorMessage('No hay productos disponibles. Por favor, intenta más tarde.');
-                   return;
-               }
+               if (!products.length) {}

[NoCoverage] StringLiteral
src/js/script.mjs:1999:34
-                   showErrorMessage('No hay productos disponibles. Por favor, intenta más tarde.');
+                   showErrorMessage("");

[NoCoverage] BlockStatement
src/js/script.mjs:2002:16
-           } else {
-               products = networkProducts.map((product, index) => ({
-                   ...product,
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
-                   categoryKey: product.categoryKey || normalizeString(product.category)
-               }));
-               if (currentCategory) {
-                   const normCurrent = normalizeString(currentCategory);
-                   products = products
-                       .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
-                       .map((product, index) => ({
-                           ...product,
-                           originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
-                       }));
-               }
-           }
+           } else {}

[NoCoverage] ArrowFunction
src/js/script.mjs:2003:44
-               products = networkProducts.map((product, index) => ({
-                   ...product,
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
-                   categoryKey: product.categoryKey || normalizeString(product.category)
-               }));
+               products = networkProducts.map(() => undefined);

[NoCoverage] ObjectLiteral
src/js/script.mjs:2003:65
-               products = networkProducts.map((product, index) => ({
-                   ...product,
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
-                   categoryKey: product.categoryKey || normalizeString(product.category)
-               }));
+               products = networkProducts.map((product, index) => ({}));

[NoCoverage] ConditionalExpression
src/js/script.mjs:2005:32
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
+                   originalIndex: true ? product.originalIndex : index,

[NoCoverage] ConditionalExpression
src/js/script.mjs:2005:32
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
+                   originalIndex: false ? product.originalIndex : index,

[NoCoverage] EqualityOperator
src/js/script.mjs:2005:32
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
+                   originalIndex: typeof product.originalIndex !== 'number' ? product.originalIndex : index,

[NoCoverage] StringLiteral
src/js/script.mjs:2005:65
-                   originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index,
+                   originalIndex: typeof product.originalIndex === "" ? product.originalIndex : index,

[NoCoverage] ConditionalExpression
src/js/script.mjs:2006:30
-                   categoryKey: product.categoryKey || normalizeString(product.category)
+                   categoryKey: true

[NoCoverage] ConditionalExpression
src/js/script.mjs:2006:30
-                   categoryKey: product.categoryKey || normalizeString(product.category)
+                   categoryKey: false

[NoCoverage] LogicalOperator
src/js/script.mjs:2006:30
-                   categoryKey: product.categoryKey || normalizeString(product.category)
+                   categoryKey: product.categoryKey && normalizeString(product.category)

[NoCoverage] ConditionalExpression
src/js/script.mjs:2008:17
-               if (currentCategory) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2008:17
-               if (currentCategory) {
+               if (false) {
