[NoCoverage] BlockStatement
src/js/script.mjs:2008:34
-               if (currentCategory) {
-                   const normCurrent = normalizeString(currentCategory);
-                   products = products
-                       .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
-                       .map((product, index) => ({
-                           ...product,
-                           originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
-                       }));
-               }
+               if (currentCategory) {}

[NoCoverage] MethodExpression
src/js/script.mjs:2010:28
-                   products = products
-                       .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                   products = products

[NoCoverage] ArrowFunction
src/js/script.mjs:2011:29
-                       .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                       .filter(() => undefined)

[NoCoverage] ConditionalExpression
src/js/script.mjs:2011:40
-                       .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                       .filter(product => true)

[NoCoverage] ConditionalExpression
src/js/script.mjs:2011:40
-                       .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                       .filter(product => false)

[NoCoverage] EqualityOperator
src/js/script.mjs:2011:40
-                       .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                       .filter(product => (product.categoryKey || normalizeString(product.category)) !== normCurrent)

[NoCoverage] ConditionalExpression
src/js/script.mjs:2011:41
-                       .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                       .filter(product => (true) === normCurrent)

[NoCoverage] ConditionalExpression
src/js/script.mjs:2011:41
-                       .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                       .filter(product => (false) === normCurrent)

[NoCoverage] LogicalOperator
src/js/script.mjs:2011:41
-                       .filter(product => (product.categoryKey || normalizeString(product.category)) === normCurrent)
+                       .filter(product => (product.categoryKey && normalizeString(product.category)) === normCurrent)

[NoCoverage] ArrowFunction
src/js/script.mjs:2012:26
-                       .map((product, index) => ({
-                           ...product,
-                           originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
-                       }));
+                       .map(() => undefined);

[NoCoverage] ObjectLiteral
src/js/script.mjs:2012:47
-                       .map((product, index) => ({
-                           ...product,
-                           originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
-                       }));
+                       .map((product, index) => ({}));

[NoCoverage] ConditionalExpression
src/js/script.mjs:2014:40
-                           originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
+                           originalIndex: true ? product.originalIndex : index

[NoCoverage] ConditionalExpression
src/js/script.mjs:2014:40
-                           originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
+                           originalIndex: false ? product.originalIndex : index

[NoCoverage] EqualityOperator
src/js/script.mjs:2014:40
-                           originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
+                           originalIndex: typeof product.originalIndex !== 'number' ? product.originalIndex : index

[NoCoverage] StringLiteral
src/js/script.mjs:2014:73
-                           originalIndex: typeof product.originalIndex === 'number' ? product.originalIndex : index
+                           originalIndex: typeof product.originalIndex === "" ? product.originalIndex : index

[NoCoverage] ConditionalExpression
src/js/script.mjs:2020:13
-           if (userHasInteracted || visibleCount === 0) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2020:13
-           if (userHasInteracted || visibleCount === 0) {
+           if (false) {

[NoCoverage] LogicalOperator
src/js/script.mjs:2020:13
-           if (userHasInteracted || visibleCount === 0) {
+           if (userHasInteracted && visibleCount === 0) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2020:34
-           if (userHasInteracted || visibleCount === 0) {
+           if (userHasInteracted || false) {

[NoCoverage] EqualityOperator
src/js/script.mjs:2020:34
-           if (userHasInteracted || visibleCount === 0) {
+           if (userHasInteracted || visibleCount !== 0) {

[NoCoverage] BlockStatement
src/js/script.mjs:2020:54
-           if (userHasInteracted || visibleCount === 0) {
-               resetProductList();
-               if (filteredProducts.length) {
-                   appendInitialBatch();
-               } else {
-                   updateLoadMoreVisibility();
-               }
-           } else {
+           if (userHasInteracted || visibleCount === 0) {} else {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2022:17
-               if (filteredProducts.length) {
+               if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2022:17
-               if (filteredProducts.length) {
+               if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:2022:42
-               if (filteredProducts.length) {
-                   appendInitialBatch();
-               } else {
+               if (filteredProducts.length) {} else {

[NoCoverage] BlockStatement
src/js/script.mjs:2024:20
-               } else {
-                   updateLoadMoreVisibility();
-               }
+               } else {}

[NoCoverage] BlockStatement
src/js/script.mjs:2027:16
-           } else {
-               updateLoadMoreVisibility();
-           }
+           } else {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:2031:13
-           if (typeof window !== 'undefined') window.__APP_READY__ = true;
+           if (true) window.__APP_READY__ = true;

[NoCoverage] ConditionalExpression
src/js/script.mjs:2031:13
-           if (typeof window !== 'undefined') window.__APP_READY__ = true;
+           if (false) window.__APP_READY__ = true;

[NoCoverage] EqualityOperator
src/js/script.mjs:2031:13
-           if (typeof window !== 'undefined') window.__APP_READY__ = true;
+           if (typeof window === 'undefined') window.__APP_READY__ = true;

[NoCoverage] StringLiteral
src/js/script.mjs:2031:31
-           if (typeof window !== 'undefined') window.__APP_READY__ = true;
+           if (typeof window !== "") window.__APP_READY__ = true;

[NoCoverage] BooleanLiteral
src/js/script.mjs:2031:67
-           if (typeof window !== 'undefined') window.__APP_READY__ = true;
+           if (typeof window !== 'undefined') window.__APP_READY__ = false;

[NoCoverage] StringLiteral
src/js/script.mjs:2033:33
-           window.addEventListener('online', updateOnlineStatus);
+           window.addEventListener("", updateOnlineStatus);

[NoCoverage] StringLiteral
src/js/script.mjs:2034:33
-           window.addEventListener('offline', updateOnlineStatus);
+           window.addEventListener("", updateOnlineStatus);

[NoCoverage] StringLiteral
src/js/script.mjs:2037:50
-           const cartIcon = document.getElementById('cart-icon');
+           const cartIcon = document.getElementById("");

[NoCoverage] StringLiteral
src/js/script.mjs:2038:54
-           const emptyCartBtn = document.getElementById('empty-cart');
+           const emptyCartBtn = document.getElementById("");

[NoCoverage] StringLiteral
src/js/script.mjs:2039:55
-           const submitCartBtn = document.getElementById('submit-cart');
+           const submitCartBtn = document.getElementById("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:2041:13
-           if (cartIcon) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2041:13
-           if (cartIcon) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:2041:23
-           if (cartIcon) {
-               cartIcon.addEventListener('click', async () => {
-                   renderCart();
-                   const cartOffcanvasElement = document.getElementById('cartOffcanvas');
-                   try {
-                       await showOffcanvas('#cartOffcanvas');
-                       if (cartOffcanvasElement) {
-                           cartOffcanvasElement.dataset.bsFallback = '0';
-                       }
-                   } catch (error) {
-                       console.error('Bootstrap Offcanvas no está disponible', error);
-                       if (cartOffcanvasElement) {
-                           cartOffcanvasElement.dataset.bsFallback = '1';
-                           cartOffcanvasElement.classList.add('show');
-                           cartOffcanvasElement.removeAttribute('aria-hidden');
-                       }
-                   }
-               });
-           }
+           if (cartIcon) {}

[NoCoverage] StringLiteral
src/js/script.mjs:2042:39
-               cartIcon.addEventListener('click', async () => {
+               cartIcon.addEventListener("", async () => {

[NoCoverage] BlockStatement
src/js/script.mjs:2042:60
-               cartIcon.addEventListener('click', async () => {
-                   renderCart();
-                   const cartOffcanvasElement = document.getElementById('cartOffcanvas');
-                   try {
-                       await showOffcanvas('#cartOffcanvas');
-                       if (cartOffcanvasElement) {
-                           cartOffcanvasElement.dataset.bsFallback = '0';
-                       }
-                   } catch (error) {
-                       console.error('Bootstrap Offcanvas no está disponible', error);
-                       if (cartOffcanvasElement) {
-                           cartOffcanvasElement.dataset.bsFallback = '1';
-                           cartOffcanvasElement.classList.add('show');
-                           cartOffcanvasElement.removeAttribute('aria-hidden');
-                       }
-                   }
-               });
+               cartIcon.addEventListener('click', async () => {});

[NoCoverage] StringLiteral
src/js/script.mjs:2044:70
-                   const cartOffcanvasElement = document.getElementById('cartOffcanvas');
+                   const cartOffcanvasElement = document.getElementById("");

[NoCoverage] BlockStatement
src/js/script.mjs:2045:21
-                   try {
-                       await showOffcanvas('#cartOffcanvas');
-                       if (cartOffcanvasElement) {
-                           cartOffcanvasElement.dataset.bsFallback = '0';
-                       }
-                   } catch (error) {
+                   try {} catch (error) {

[NoCoverage] StringLiteral
src/js/script.mjs:2046:41
-                       await showOffcanvas('#cartOffcanvas');
+                       await showOffcanvas("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:2047:25
-                       if (cartOffcanvasElement) {
+                       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2047:25
-                       if (cartOffcanvasElement) {
+                       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:2047:47
-                       if (cartOffcanvasElement) {
-                           cartOffcanvasElement.dataset.bsFallback = '0';
-                       }
+                       if (cartOffcanvasElement) {}

[NoCoverage] StringLiteral
src/js/script.mjs:2048:67
-                           cartOffcanvasElement.dataset.bsFallback = '0';
+                           cartOffcanvasElement.dataset.bsFallback = "";

[NoCoverage] BlockStatement
src/js/script.mjs:2050:33
-                   } catch (error) {
-                       console.error('Bootstrap Offcanvas no está disponible', error);
-                       if (cartOffcanvasElement) {
-                           cartOffcanvasElement.dataset.bsFallback = '1';
-                           cartOffcanvasElement.classList.add('show');
-                           cartOffcanvasElement.removeAttribute('aria-hidden');
-                       }
-                   }
+                   } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:2051:35
-                       console.error('Bootstrap Offcanvas no está disponible', error);
+                       console.error("", error);

[NoCoverage] ConditionalExpression
src/js/script.mjs:2052:25
-                       if (cartOffcanvasElement) {
+                       if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2052:25
-                       if (cartOffcanvasElement) {
+                       if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:2052:47
-                       if (cartOffcanvasElement) {
-                           cartOffcanvasElement.dataset.bsFallback = '1';
-                           cartOffcanvasElement.classList.add('show');
-                           cartOffcanvasElement.removeAttribute('aria-hidden');
-                       }
+                       if (cartOffcanvasElement) {}

[NoCoverage] StringLiteral
src/js/script.mjs:2053:67
-                           cartOffcanvasElement.dataset.bsFallback = '1';
+                           cartOffcanvasElement.dataset.bsFallback = "";

[NoCoverage] StringLiteral
src/js/script.mjs:2054:60
-                           cartOffcanvasElement.classList.add('show');
+                           cartOffcanvasElement.classList.add("");

[NoCoverage] StringLiteral
src/js/script.mjs:2055:62
-                           cartOffcanvasElement.removeAttribute('aria-hidden');
+                           cartOffcanvasElement.removeAttribute("");

[NoCoverage] ConditionalExpression
src/js/script.mjs:2061:13
-           if (emptyCartBtn) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2061:13
-           if (emptyCartBtn) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:2061:27
-           if (emptyCartBtn) {
-               emptyCartBtn.addEventListener('click', emptyCart);
-           }
+           if (emptyCartBtn) {}

[NoCoverage] StringLiteral
src/js/script.mjs:2062:43
-               emptyCartBtn.addEventListener('click', emptyCart);
+               emptyCartBtn.addEventListener("", emptyCart);

[NoCoverage] ConditionalExpression
src/js/script.mjs:2064:13
-           if (submitCartBtn) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2064:13
-           if (submitCartBtn) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:2064:28
-           if (submitCartBtn) {
-               submitCartBtn.addEventListener('click', submitCart);
-           }
+           if (submitCartBtn) {}

[NoCoverage] StringLiteral
src/js/script.mjs:2065:44
-               submitCartBtn.addEventListener('click', submitCart);
+               submitCartBtn.addEventListener("", submitCart);

[NoCoverage] ConditionalExpression
src/js/script.mjs:2068:13
-           if (cartItemsElement) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2068:13
-           if (cartItemsElement) {
+           if (false) {

[NoCoverage] BlockStatement
src/js/script.mjs:2068:31
-           if (cartItemsElement) {
-               cartItemsElement.addEventListener('click', (e) => {
-                   const target = e.target;
-                   const productId = target.closest('[data-id]')?.dataset.id;
-   
-                   if (!productId) return;
-   
-                   if (target.classList.contains('decrease-quantity')) {
-                       updateQuantity({ id: productId }, -1);
-                   } else if (target.classList.contains('increase-quantity')) {
-                       updateQuantity({ id: productId }, 1);
-                   } else if (target.classList.contains('remove-item')) {
-                       removeFromCart(productId);
-                   }
-               });
-           }
+           if (cartItemsElement) {}

[NoCoverage] StringLiteral
src/js/script.mjs:2069:47
-               cartItemsElement.addEventListener('click', (e) => {
+               cartItemsElement.addEventListener("", (e) => {

[NoCoverage] BlockStatement
src/js/script.mjs:2069:63
-               cartItemsElement.addEventListener('click', (e) => {
-                   const target = e.target;
-                   const productId = target.closest('[data-id]')?.dataset.id;
-   
-                   if (!productId) return;
-   
-                   if (target.classList.contains('decrease-quantity')) {
-                       updateQuantity({ id: productId }, -1);
-                   } else if (target.classList.contains('increase-quantity')) {
-                       updateQuantity({ id: productId }, 1);
-                   } else if (target.classList.contains('remove-item')) {
-                       removeFromCart(productId);
-                   }
-               });
+               cartItemsElement.addEventListener('click', (e) => {});

[NoCoverage] OptionalChaining
src/js/script.mjs:2071:35
-                   const productId = target.closest('[data-id]')?.dataset.id;
+                   const productId = target.closest('[data-id]').dataset.id;

[NoCoverage] StringLiteral
src/js/script.mjs:2071:50
-                   const productId = target.closest('[data-id]')?.dataset.id;
+                   const productId = target.closest("")?.dataset.id;

[NoCoverage] BooleanLiteral
src/js/script.mjs:2073:21
-                   if (!productId) return;
+                   if (productId) return;

[NoCoverage] ConditionalExpression
src/js/script.mjs:2073:21
-                   if (!productId) return;
+                   if (true) return;

[NoCoverage] ConditionalExpression
src/js/script.mjs:2073:21
-                   if (!productId) return;
+                   if (false) return;

[NoCoverage] ConditionalExpression
src/js/script.mjs:2075:21
-                   if (target.classList.contains('decrease-quantity')) {
+                   if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2075:21
-                   if (target.classList.contains('decrease-quantity')) {
+                   if (false) {

[NoCoverage] StringLiteral
src/js/script.mjs:2075:47
-                   if (target.classList.contains('decrease-quantity')) {
+                   if (target.classList.contains("")) {

[NoCoverage] BlockStatement
src/js/script.mjs:2075:69
-                   if (target.classList.contains('decrease-quantity')) {
-                       updateQuantity({ id: productId }, -1);
-                   } else if (target.classList.contains('increase-quantity')) {
+                   if (target.classList.contains('decrease-quantity')) {} else if (target.classList.contains('increase-quantity')) {

[NoCoverage] ObjectLiteral
src/js/script.mjs:2076:36
-                       updateQuantity({ id: productId }, -1);
+                       updateQuantity({}, -1);

[NoCoverage] UnaryOperator
src/js/script.mjs:2076:55
-                       updateQuantity({ id: productId }, -1);
+                       updateQuantity({ id: productId }, +1);

[NoCoverage] ConditionalExpression
src/js/script.mjs:2077:28
-                   } else if (target.classList.contains('increase-quantity')) {
+                   } else if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2077:28
-                   } else if (target.classList.contains('increase-quantity')) {
+                   } else if (false) {

[NoCoverage] StringLiteral
src/js/script.mjs:2077:54
-                   } else if (target.classList.contains('increase-quantity')) {
+                   } else if (target.classList.contains("")) {

[NoCoverage] BlockStatement
src/js/script.mjs:2077:76
-                   } else if (target.classList.contains('increase-quantity')) {
-                       updateQuantity({ id: productId }, 1);
-                   } else if (target.classList.contains('remove-item')) {
+                   } else if (target.classList.contains('increase-quantity')) {} else if (target.classList.contains('remove-item')) {

[NoCoverage] ObjectLiteral
src/js/script.mjs:2078:36
-                       updateQuantity({ id: productId }, 1);
+                       updateQuantity({}, 1);

[NoCoverage] ConditionalExpression
src/js/script.mjs:2079:28
-                   } else if (target.classList.contains('remove-item')) {
+                   } else if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2079:28
-                   } else if (target.classList.contains('remove-item')) {
+                   } else if (false) {

[NoCoverage] StringLiteral
src/js/script.mjs:2079:54
-                   } else if (target.classList.contains('remove-item')) {
+                   } else if (target.classList.contains("")) {

[NoCoverage] BlockStatement
src/js/script.mjs:2079:70
-                   } else if (target.classList.contains('remove-item')) {
-                       removeFromCart(productId);
-                   }
+                   } else if (target.classList.contains('remove-item')) {}

[NoCoverage] ConditionalExpression
src/js/script.mjs:2087:13
-           if ('performance' in window) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/js/script.mjs:2087:13
-           if ('performance' in window) {
+           if (false) {

[NoCoverage] StringLiteral
src/js/script.mjs:2087:13
-           if ('performance' in window) {
+           if ("" in window) {

[NoCoverage] BlockStatement
src/js/script.mjs:2087:38
-           if ('performance' in window) {
-               window.addEventListener('load', () => {
-                   logPerformanceMetrics();
-               });
-           }
+           if ('performance' in window) {}

[NoCoverage] StringLiteral
src/js/script.mjs:2088:37
-               window.addEventListener('load', () => {
+               window.addEventListener("", () => {

[NoCoverage] BlockStatement
src/js/script.mjs:2088:51
-               window.addEventListener('load', () => {
-                   logPerformanceMetrics();
-               });
+               window.addEventListener('load', () => {});

[NoCoverage] BlockStatement
src/js/script.mjs:2093:21
-       } catch (error) {
-           console.error("Error al inicializar productos:", error);
-           showErrorMessage('Error al cargar productos. Por favor, inténtelo más tarde.');
-       }
+       } catch (error) {}

[NoCoverage] StringLiteral
src/js/script.mjs:2094:23
-           console.error("Error al inicializar productos:", error);
+           console.error("", error);

[NoCoverage] StringLiteral
src/js/script.mjs:2095:26
-           showErrorMessage('Error al cargar productos. Por favor, inténtelo más tarde.');
+           showErrorMessage("");

[NoCoverage] BlockStatement
src/js/script.mjs:2101:63
-       document.addEventListener('DOMContentLoaded', function () {
-           // Register service worker first
-           registerServiceWorker();
-   
-           // Then initialize the app
-           initApp().catch(error => {
-               console.error('Error al inicializar la aplicación:', error);
-               showErrorMessage('Error al inicializar la aplicación. Por favor, actualice la página.');
-           });
-       });
+       document.addEventListener('DOMContentLoaded', function () {});

[NoCoverage] BlockStatement
src/js/script.mjs:2106:34
-           initApp().catch(error => {
-               console.error('Error al inicializar la aplicación:', error);
-               showErrorMessage('Error al inicializar la aplicación. Por favor, actualice la página.');
-           });
+           initApp().catch(error => {});

[NoCoverage] StringLiteral
src/js/script.mjs:2107:27
-               console.error('Error al inicializar la aplicación:', error);
+               console.error("", error);

[NoCoverage] StringLiteral
src/js/script.mjs:2108:30
-               showErrorMessage('Error al inicializar la aplicación. Por favor, actualice la página.');
+               showErrorMessage("");

[Survived] BooleanLiteral
src/js/script.mjs:30:9
-       if (!normalised) {
+       if (normalised) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BooleanLiteral
src/js/script.mjs:21:9
-       if (!value) {
+       if (value) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BlockStatement
src/js/script.mjs:28:51
-   const buildCfSrc = (assetPath, extraOpts = {}) => {
-       const normalised = normaliseAssetPath(assetPath);
-       if (!normalised) {
-           return '';
-       }
-       return cfimg(normalised, { ...CFIMG_THUMB, ...extraOpts });
-   };
+   const buildCfSrc = (assetPath, extraOpts = {}) => {};
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BlockStatement
src/js/script.mjs:20:44
-   const normaliseAssetPath = (value = '') => {
-       if (!value) {
-           return '';
-       }
-       const trimmed = value.startsWith('/') ? value.slice(1) : value;
-       return `/${trimmed}`;
-   };
+   const normaliseAssetPath = (value = '') => {};
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BlockStatement
src/js/script.mjs:21:17
-       if (!value) {
-           return '';
-       }
+       if (!value) {}
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:22:16
-           return '';
+           return "Stryker was here!";
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:21:9
-       if (!value) {
+       if (false) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:21:9
-       if (!value) {
+       if (true) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:30:9
-       if (!normalised) {
+       if (false) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:30:9
-       if (!normalised) {
+       if (true) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BlockStatement
src/js/script.mjs:30:22
-       if (!normalised) {
-           return '';
-       }
+       if (!normalised) {}
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:31:16
-           return '';
+           return "Stryker was here!";
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!
