[Survived] BlockStatement
src/js/script.mjs:36:85
-   const buildCfSrcset = (assetPath, extraOpts = {}, widths = PRODUCT_IMAGE_WIDTHS) => {
-       const normalised = normaliseAssetPath(assetPath);
-       if (!normalised) {
-           return '';
-       }
-       return widths
-           .map(width => `${cfimg(normalised, { ...CFIMG_THUMB, width, ...extraOpts })} ${width}w`)
-           .join(', ');
-   };
+   const buildCfSrcset = (assetPath, extraOpts = {}, widths = PRODUCT_IMAGE_WIDTHS) => {};
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BooleanLiteral
src/js/script.mjs:38:9
-       if (!normalised) {
+       if (normalised) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:38:9
-       if (!normalised) {
+       if (true) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:38:9
-       if (!normalised) {
+       if (false) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BlockStatement
src/js/script.mjs:38:22
-       if (!normalised) {
-           return '';
-       }
+       if (!normalised) {}
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:39:16
-           return '';
+           return "Stryker was here!";
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BooleanLiteral
src/js/script.mjs:138:9
-       if (!assetPath) {
+       if (assetPath) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:138:9
-       if (!assetPath) {
+       if (true) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:138:9
-       if (!assetPath) {
+       if (false) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BlockStatement
src/js/script.mjs:138:21
-       if (!assetPath) {
-           return '';
-       }
+       if (!assetPath) {}
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:139:16
-           return '';
+           return "Stryker was here!";
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BlockStatement
src/js/script.mjs:170:57
-           if (payload && Array.isArray(payload.products)) {
-               return payload;
-           }
+           if (payload && Array.isArray(payload.products)) {}
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] BlockStatement
src/js/script.mjs:174:73
-       if (sharedProductData && Array.isArray(sharedProductData.products)) {
-           return sharedProductData;
-       }
+       if (sharedProductData && Array.isArray(sharedProductData.products)) {}
Tests ran:
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:181:9
-       if (!Array.isArray(products)) {
+       if (false) {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:187:17
-           source: metadata.source || null,
+           source: true,
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:187:17
-           source: metadata.source || null,
+           source: false,
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] LogicalOperator
src/js/script.mjs:187:17
-           source: metadata.source || null,
+           source: metadata.source && null,
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:188:20
-           updatedAt: metadata.updatedAt || Date.now(),
+           updatedAt: true,
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:188:20
-           updatedAt: metadata.updatedAt || Date.now(),
+           updatedAt: false,
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] LogicalOperator
src/js/script.mjs:188:20
-           updatedAt: metadata.updatedAt || Date.now(),
+           updatedAt: metadata.updatedAt && Date.now(),
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:190:16
-           total: typeof metadata.total === 'number' ? metadata.total : null
+           total: true ? metadata.total : null
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:190:16
-           total: typeof metadata.total === 'number' ? metadata.total : null
+           total: false ? metadata.total : null
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] EqualityOperator
src/js/script.mjs:190:16
-           total: typeof metadata.total === 'number' ? metadata.total : null
+           total: typeof metadata.total !== 'number' ? metadata.total : null
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:190:42
-           total: typeof metadata.total === 'number' ? metadata.total : null
+           total: typeof metadata.total === "" ? metadata.total : null
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:193:9
-       if (existing && !force) {
+       if (false) {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] LogicalOperator
src/js/script.mjs:193:9
-       if (existing && !force) {
+       if (existing || !force) {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] BooleanLiteral
src/js/script.mjs:193:21
-       if (existing && !force) {
+       if (existing && force) {
Tests ran:
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
    fetchProducts uses inline dataset when available

[Survived] BlockStatement
src/js/script.mjs:193:29
-       if (existing && !force) {
-           const existingVersion = existing.version || null;
-           const payloadVersion = payload.version || null;
-           const shouldKeepExisting =
-               (!payloadVersion && existingVersion) ||
-               (!payloadVersion && !existingVersion) ||
-               (payloadVersion && existingVersion === payloadVersion);
-           if (shouldKeepExisting) {
-               return existing;
-           }
-       }
+       if (existing && !force) {}
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:194:33
-           const existingVersion = existing.version || null;
+           const existingVersion = false;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:194:33
-           const existingVersion = existing.version || null;
+           const existingVersion = true;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:195:32
-           const payloadVersion = payload.version || null;
+           const payloadVersion = true;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:194:33
-           const existingVersion = existing.version || null;
+           const existingVersion = existing.version && null;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:195:32
-           const payloadVersion = payload.version || null;
+           const payloadVersion = false;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:195:32
-           const payloadVersion = payload.version || null;
+           const payloadVersion = payload.version && null;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:197:13
-               (!payloadVersion && existingVersion) ||
-               (!payloadVersion && !existingVersion) ||
-               (payloadVersion && existingVersion === payloadVersion);
+               false;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:197:13
-               (!payloadVersion && existingVersion) ||
-               (!payloadVersion && !existingVersion) ||
-               (payloadVersion && existingVersion === payloadVersion);
+               true;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:197:13
-               (!payloadVersion && existingVersion) ||
-               (!payloadVersion && !existingVersion) ||
+               false ||
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:197:13
-               (!payloadVersion && existingVersion) ||
-               (!payloadVersion && !existingVersion) ||
+               !payloadVersion && existingVersion && !payloadVersion && !existingVersion ||
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:197:13
-               (!payloadVersion && existingVersion) ||
-               (!payloadVersion && !existingVersion) ||
-               (payloadVersion && existingVersion === payloadVersion);
+               (!payloadVersion && existingVersion || !payloadVersion && !existingVersion) && payloadVersion && existingVersion === payloadVersion;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:197:14
-               (!payloadVersion && existingVersion) ||
+               (false) ||
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:197:14
-               (!payloadVersion && existingVersion) ||
+               (!payloadVersion || existingVersion) ||
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] BooleanLiteral
src/js/script.mjs:197:14
-               (!payloadVersion && existingVersion) ||
+               (payloadVersion && existingVersion) ||
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:198:14
-               (!payloadVersion && !existingVersion) ||
+               (false) ||
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:198:14
-               (!payloadVersion && !existingVersion) ||
+               (!payloadVersion || !existingVersion) ||
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] BooleanLiteral
src/js/script.mjs:198:14
-               (!payloadVersion && !existingVersion) ||
+               (payloadVersion && !existingVersion) ||
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:199:14
-               (payloadVersion && existingVersion === payloadVersion);
+               (false);
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:199:14
-               (payloadVersion && existingVersion === payloadVersion);
+               (payloadVersion || existingVersion === payloadVersion);
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:199:32
-               (payloadVersion && existingVersion === payloadVersion);
+               (payloadVersion && true);
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:200:13
-           if (shouldKeepExisting) {
+           if (true) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:199:32
-               (payloadVersion && existingVersion === payloadVersion);
+               (payloadVersion && existingVersion !== payloadVersion);
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:200:13
-           if (shouldKeepExisting) {
+           if (false) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] BlockStatement
src/js/script.mjs:200:33
-           if (shouldKeepExisting) {
-               return existing;
-           }
+           if (shouldKeepExisting) {}
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:205:9
-       if (typeof window !== 'undefined') {
+       if (true) {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:205:27
-       if (typeof window !== 'undefined') {
+       if (typeof window !== "") {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:212:55
-       return writeSharedProductData(products, metadata, { force: false });
+       return writeSharedProductData(products, metadata, {});
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] BooleanLiteral
src/js/script.mjs:212:64
-       return writeSharedProductData(products, metadata, { force: false });
+       return writeSharedProductData(products, metadata, { force: true });
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ObjectLiteral
src/js/script.mjs:216:55
-       return writeSharedProductData(products, metadata, { force: true });
+       return writeSharedProductData(products, metadata, {});
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] BooleanLiteral
src/js/script.mjs:216:64
-       return writeSharedProductData(products, metadata, { force: true });
+       return writeSharedProductData(products, metadata, { force: false });
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] BlockStatement
src/js/script.mjs:566:34
-   const normalizeString = (str) => {
-       if (!str) return '';
-       try {
-           return String(str)
-               .normalize('NFD')
-               .replace(/[\u0300-\u036f]/g, '')
-               .replace(/[^a-zA-Z0-9]/g, '')
-               .toLowerCase();
-       } catch {
-           return String(str).toLowerCase();
-       }
-   };
+   const normalizeString = (str) => {};
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] BooleanLiteral
src/js/script.mjs:567:9
-       if (!str) return '';
+       if (str) return '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:567:9
-       if (!str) return '';
+       if (true) return '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:567:9
-       if (!str) return '';
+       if (false) return '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] BlockStatement
src/js/script.mjs:568:9
-       try {
-           return String(str)
-               .normalize('NFD')
-               .replace(/[\u0300-\u036f]/g, '')
-               .replace(/[^a-zA-Z0-9]/g, '')
-               .toLowerCase();
-       } catch {
+       try {} catch {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] MethodExpression
src/js/script.mjs:569:16
-           return String(str)
-               .normalize('NFD')
-               .replace(/[\u0300-\u036f]/g, '')
-               .replace(/[^a-zA-Z0-9]/g, '')
-               .toLowerCase();
+           return String(str).normalize('NFD').replace(/[\u0300-\u036f]/g, '').replace(/[^a-zA-Z0-9]/g, '').toUpperCase();
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:570:24
-               .normalize('NFD')
+               .normalize("")
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] Regex
src/js/script.mjs:571:22
-               .replace(/[\u0300-\u036f]/g, '')
+               .replace(/[^\u0300-\u036f]/g, '')
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:571:42
-               .replace(/[\u0300-\u036f]/g, '')
+               .replace(/[\u0300-\u036f]/g, "Stryker was here!")
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:572:39
-               .replace(/[^a-zA-Z0-9]/g, '')
+               .replace(/[^a-zA-Z0-9]/g, "Stryker was here!")
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] BlockStatement
src/js/script.mjs:585:50
-   const generateStableId = (product, index = 0) => {
-       const hasValidShape = product && typeof product === 'object';
-       const rawName = hasValidShape && typeof product.name === 'string' ? product.name.trim() : '';
-       const rawCategory = hasValidShape && typeof product.category === 'string' ? product.category.trim() : '';
-   
-       const safeName = rawName.length > 0 ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index + 1}`;
-       const safeCategory = rawCategory.length > 0 ? rawCategory : DEFAULT_CATEGORY;
-   
-       const baseString = `${safeName}-${safeCategory}`.toLowerCase();
-   
-       let hash = 0;
-       for (let i = 0; i < baseString.length; i += 1) {
-           const charCode = baseString.charCodeAt(i);
-           hash = ((hash << 5) - hash) + charCode;
-           hash &= hash; // Convert to 32-bit integer
-       }
-   
-       const needsFallbackSuffix = rawName.length === 0 || rawCategory.length === 0;
-       const suffix = needsFallbackSuffix ? `-${index}` : '';
-   
-       return `pid-${Math.abs(hash)}${suffix}`;
-   };
+   const generateStableId = (product, index = 0) => {};
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] Regex
src/js/script.mjs:572:22
-               .replace(/[^a-zA-Z0-9]/g, '')
+               .replace(/[a-zA-Z0-9]/g, '')
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:586:27
-       const hasValidShape = product && typeof product === 'object';
+       const hasValidShape = true;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:586:27
-       const hasValidShape = product && typeof product === 'object';
+       const hasValidShape = false;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:586:27
-       const hasValidShape = product && typeof product === 'object';
+       const hasValidShape = product || typeof product === 'object';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:586:38
-       const hasValidShape = product && typeof product === 'object';
+       const hasValidShape = product && true;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:586:38
-       const hasValidShape = product && typeof product === 'object';
+       const hasValidShape = product && typeof product !== 'object';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:586:57
-       const hasValidShape = product && typeof product === 'object';
+       const hasValidShape = product && typeof product === "";
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:587:21
-       const rawName = hasValidShape && typeof product.name === 'string' ? product.name.trim() : '';
+       const rawName = true ? product.name.trim() : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:587:21
-       const rawName = hasValidShape && typeof product.name === 'string' ? product.name.trim() : '';
+       const rawName = false ? product.name.trim() : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:587:21
-       const rawName = hasValidShape && typeof product.name === 'string' ? product.name.trim() : '';
+       const rawName = hasValidShape || typeof product.name === 'string' ? product.name.trim() : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:587:38
-       const rawName = hasValidShape && typeof product.name === 'string' ? product.name.trim() : '';
+       const rawName = hasValidShape && true ? product.name.trim() : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:587:38
-       const rawName = hasValidShape && typeof product.name === 'string' ? product.name.trim() : '';
+       const rawName = hasValidShape && typeof product.name !== 'string' ? product.name.trim() : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:587:62
-       const rawName = hasValidShape && typeof product.name === 'string' ? product.name.trim() : '';
+       const rawName = hasValidShape && typeof product.name === "" ? product.name.trim() : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] MethodExpression
src/js/script.mjs:587:73
-       const rawName = hasValidShape && typeof product.name === 'string' ? product.name.trim() : '';
+       const rawName = hasValidShape && typeof product.name === 'string' ? product.name : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:588:25
-       const rawCategory = hasValidShape && typeof product.category === 'string' ? product.category.trim() : '';
+       const rawCategory = false ? product.category.trim() : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:588:70
-       const rawCategory = hasValidShape && typeof product.category === 'string' ? product.category.trim() : '';
+       const rawCategory = hasValidShape && typeof product.category === "" ? product.category.trim() : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:590:22
-       const safeName = rawName.length > 0 ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index + 1}`;
+       const safeName = true ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index + 1}`;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:588:107
-       const rawCategory = hasValidShape && typeof product.category === 'string' ? product.category.trim() : '';
+       const rawCategory = hasValidShape && typeof product.category === 'string' ? product.category.trim() : "Stryker was here!";
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:590:22
-       const safeName = rawName.length > 0 ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index + 1}`;
+       const safeName = false ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index + 1}`;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:590:22
-       const safeName = rawName.length > 0 ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index + 1}`;
+       const safeName = rawName.length >= 0 ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index + 1}`;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:590:22
-       const safeName = rawName.length > 0 ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index + 1}`;
+       const safeName = rawName.length <= 0 ? rawName : `${DEFAULT_PRODUCT_NAME_PREFIX}-${index + 1}`;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:591:26
-       const safeCategory = rawCategory.length > 0 ? rawCategory : DEFAULT_CATEGORY;
+       const safeCategory = rawCategory.length >= 0 ? rawCategory : DEFAULT_CATEGORY;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:591:26
-       const safeCategory = rawCategory.length > 0 ? rawCategory : DEFAULT_CATEGORY;
+       const safeCategory = rawCategory.length <= 0 ? rawCategory : DEFAULT_CATEGORY;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:591:26
-       const safeCategory = rawCategory.length > 0 ? rawCategory : DEFAULT_CATEGORY;
+       const safeCategory = true ? rawCategory : DEFAULT_CATEGORY;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:591:26
-       const safeCategory = rawCategory.length > 0 ? rawCategory : DEFAULT_CATEGORY;
+       const safeCategory = false ? rawCategory : DEFAULT_CATEGORY;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] MethodExpression
src/js/script.mjs:593:24
-       const baseString = `${safeName}-${safeCategory}`.toLowerCase();
+       const baseString = `${safeName}-${safeCategory}`.toUpperCase();
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:596:21
-       for (let i = 0; i < baseString.length; i += 1) {
+       for (let i = 0; false; i += 1) {
Tests ran:
    fetchProducts uses inline dataset when available
