[Survived] StringLiteral
src/js/script.mjs:593:24
-       const baseString = `${safeName}-${safeCategory}`.toLowerCase();
+       const baseString = ``.toLowerCase();
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:596:21
-       for (let i = 0; i < baseString.length; i += 1) {
+       for (let i = 0; i <= baseString.length; i += 1) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:596:21
-       for (let i = 0; i < baseString.length; i += 1) {
+       for (let i = 0; i >= baseString.length; i += 1) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] BlockStatement
src/js/script.mjs:596:52
-       for (let i = 0; i < baseString.length; i += 1) {
-           const charCode = baseString.charCodeAt(i);
-           hash = ((hash << 5) - hash) + charCode;
-           hash &= hash; // Convert to 32-bit integer
-       }
+       for (let i = 0; i < baseString.length; i += 1) {}
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ArithmeticOperator
src/js/script.mjs:598:17
-           hash = ((hash << 5) - hash) + charCode;
+           hash = ((hash << 5) + hash) + charCode;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] AssignmentOperator
src/js/script.mjs:599:9
-           hash &= hash; // Convert to 32-bit integer
+           hash |= hash; // Convert to 32-bit integer
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ArithmeticOperator
src/js/script.mjs:598:16
-           hash = ((hash << 5) - hash) + charCode;
+           hash = (hash << 5) - hash - charCode;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:602:33
-       const needsFallbackSuffix = rawName.length === 0 || rawCategory.length === 0;
+       const needsFallbackSuffix = true;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:602:33
-       const needsFallbackSuffix = rawName.length === 0 || rawCategory.length === 0;
+       const needsFallbackSuffix = false;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:602:33
-       const needsFallbackSuffix = rawName.length === 0 || rawCategory.length === 0;
+       const needsFallbackSuffix = rawName.length === 0 && rawCategory.length === 0;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:602:33
-       const needsFallbackSuffix = rawName.length === 0 || rawCategory.length === 0;
+       const needsFallbackSuffix = false || rawCategory.length === 0;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:602:33
-       const needsFallbackSuffix = rawName.length === 0 || rawCategory.length === 0;
+       const needsFallbackSuffix = rawName.length !== 0 || rawCategory.length === 0;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:602:57
-       const needsFallbackSuffix = rawName.length === 0 || rawCategory.length === 0;
+       const needsFallbackSuffix = rawName.length === 0 || rawCategory.length !== 0;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:603:42
-       const suffix = needsFallbackSuffix ? `-${index}` : '';
+       const suffix = needsFallbackSuffix ? `` : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:605:12
-       return `pid-${Math.abs(hash)}${suffix}`;
+       return ``;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:602:57
-       const needsFallbackSuffix = rawName.length === 0 || rawCategory.length === 0;
+       const needsFallbackSuffix = rawName.length === 0 || false;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:618:13
-           if (typeof localStorage === 'undefined') {
+           if (false) {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] BlockStatement
src/js/script.mjs:628:46
-   const setStoredProductVersion = (version) => {
-       if (!version) {
-           return;
-       }
-       try {
-           if (typeof localStorage === 'undefined') {
-               return;
-           }
-           localStorage.setItem('productDataVersion', version);
-       } catch (error) {
-           console.warn('Unable to persist product data version:', error);
-       }
-   };
+   const setStoredProductVersion = (version) => {};
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:618:37
-           if (typeof localStorage === 'undefined') {
+           if (typeof localStorage === "") {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] BooleanLiteral
src/js/script.mjs:629:9
-       if (!version) {
+       if (version) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:629:9
-       if (!version) {
+       if (true) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:629:9
-       if (!version) {
+       if (false) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] BlockStatement
src/js/script.mjs:632:9
-       try {
-           if (typeof localStorage === 'undefined') {
-               return;
-           }
-           localStorage.setItem('productDataVersion', version);
-       } catch (error) {
+       try {} catch (error) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:633:13
-           if (typeof localStorage === 'undefined') {
+           if (true) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:633:13
-           if (typeof localStorage === 'undefined') {
+           if (false) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:633:13
-           if (typeof localStorage === 'undefined') {
+           if (typeof localStorage !== 'undefined') {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:633:37
-           if (typeof localStorage === 'undefined') {
+           if (typeof localStorage === "") {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:636:30
-           localStorage.setItem('productDataVersion', version);
+           localStorage.setItem("", version);
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] MethodExpression
src/js/script.mjs:651:25
-           const payload = script.textContent.trim();
+           const payload = script.textContent;
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:652:13
-           if (!payload) {
+           if (false) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:656:13
-           if (!parsed) {
+           if (false) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:659:13
-           if (Array.isArray(parsed.initialProducts)) {
+           if (true) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:673:9
-       if (!product || typeof product !== 'object') {
+       if (false) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:673:9
-       if (!product || typeof product !== 'object') {
+       if (!product && typeof product !== 'object') {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:673:21
-       if (!product || typeof product !== 'object') {
+       if (!product || false) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:677:16
-       const id = typeof product.id === 'string' && product.id.trim().length > 0
+       const id = false
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:677:38
-       const id = typeof product.id === 'string' && product.id.trim().length > 0
+       const id = typeof product.id === "" && product.id.trim().length > 0
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:681:27
-       const originalIndex = typeof product.originalIndex === 'number'
+       const originalIndex = true
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:681:27
-       const originalIndex = typeof product.originalIndex === 'number'
+       const originalIndex = false
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:681:27
-       const originalIndex = typeof product.originalIndex === 'number'
+       const originalIndex = typeof product.originalIndex !== 'number'
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:681:60
-       const originalIndex = typeof product.originalIndex === 'number'
+       const originalIndex = typeof product.originalIndex === ""
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:683:11
-           : typeof product.order === 'number'
+           : true
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:683:11
-           : typeof product.order === 'number'
+           : false
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:683:11
-           : typeof product.order === 'number'
+           : typeof product.order !== 'number'
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:683:36
-           : typeof product.order === 'number'
+           : typeof product.order === ""
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:687:22
-       const safeName = typeof product.name === 'string' && product.name.trim().length > 0
+       const safeName = true
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:687:22
-       const safeName = typeof product.name === 'string' && product.name.trim().length > 0
+       const safeName = false
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:687:22
-       const safeName = typeof product.name === 'string' && product.name.trim().length > 0
+       const safeName = true && product.name.trim().length > 0
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:687:46
-       const safeName = typeof product.name === 'string' && product.name.trim().length > 0
+       const safeName = typeof product.name === "" && product.name.trim().length > 0
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:687:22
-       const safeName = typeof product.name === 'string' && product.name.trim().length > 0
+       const safeName = typeof product.name !== 'string' && product.name.trim().length > 0
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:687:22
-       const safeName = typeof product.name === 'string' && product.name.trim().length > 0
+       const safeName = typeof product.name === 'string' || product.name.trim().length > 0
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:687:58
-       const safeName = typeof product.name === 'string' && product.name.trim().length > 0
+       const safeName = typeof product.name === 'string' && true
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:687:58
-       const safeName = typeof product.name === 'string' && product.name.trim().length > 0
+       const safeName = typeof product.name === 'string' && product.name.trim().length >= 0
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:687:58
-       const safeName = typeof product.name === 'string' && product.name.trim().length > 0
+       const safeName = typeof product.name === 'string' && product.name.trim().length <= 0
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] MethodExpression
src/js/script.mjs:687:58
-       const safeName = typeof product.name === 'string' && product.name.trim().length > 0
+       const safeName = typeof product.name === 'string' && product.name.length > 0
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:691:29
-       const safeDescription = typeof product.description === 'string' ? product.description : '';
+       const safeDescription = true ? product.description : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:691:29
-       const safeDescription = typeof product.description === 'string' ? product.description : '';
+       const safeDescription = false ? product.description : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:691:29
-       const safeDescription = typeof product.description === 'string' ? product.description : '';
+       const safeDescription = typeof product.description !== 'string' ? product.description : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:691:60
-       const safeDescription = typeof product.description === 'string' ? product.description : '';
+       const safeDescription = typeof product.description === "" ? product.description : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:691:93
-       const safeDescription = typeof product.description === 'string' ? product.description : '';
+       const safeDescription = typeof product.description === 'string' ? product.description : "Stryker was here!";
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:692:26
-       const safeCategory = typeof product.category === 'string' && product.category.trim().length > 0
+       const safeCategory = true
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:692:26
-       const safeCategory = typeof product.category === 'string' && product.category.trim().length > 0
+       const safeCategory = false
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:692:54
-       const safeCategory = typeof product.category === 'string' && product.category.trim().length > 0
+       const safeCategory = typeof product.category === "" && product.category.trim().length > 0
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:695:27
-       const safeImagePath = typeof product.image_path === 'string' ? product.image_path : '';
+       const safeImagePath = true ? product.image_path : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:695:27
-       const safeImagePath = typeof product.image_path === 'string' ? product.image_path : '';
+       const safeImagePath = false ? product.image_path : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:695:27
-       const safeImagePath = typeof product.image_path === 'string' ? product.image_path : '';
+       const safeImagePath = typeof product.image_path !== 'string' ? product.image_path : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:695:57
-       const safeImagePath = typeof product.image_path === 'string' ? product.image_path : '';
+       const safeImagePath = typeof product.image_path === "" ? product.image_path : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:695:89
-       const safeImagePath = typeof product.image_path === 'string' ? product.image_path : '';
+       const safeImagePath = typeof product.image_path === 'string' ? product.image_path : "Stryker was here!";
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:696:31
-       const safeImageAvifPath = typeof product.image_avif_path === 'string' ? product.image_avif_path : '';
+       const safeImageAvifPath = true ? product.image_avif_path : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:696:31
-       const safeImageAvifPath = typeof product.image_avif_path === 'string' ? product.image_avif_path : '';
+       const safeImageAvifPath = false ? product.image_avif_path : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] EqualityOperator
src/js/script.mjs:696:31
-       const safeImageAvifPath = typeof product.image_avif_path === 'string' ? product.image_avif_path : '';
+       const safeImageAvifPath = typeof product.image_avif_path !== 'string' ? product.image_avif_path : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ObjectLiteral
src/js/script.mjs:698:12
-       return {
-           ...product,
-           id,
-           name: sanitizeHTML(safeName),
-           description: sanitizeHTML(safeDescription),
-           category: sanitizeHTML(safeCategory),
-           categoryKey: product.categoryKey || normalizeString(safeCategory),
-           image_path: safeImagePath,
-           image_avif_path: safeImageAvifPath,
-           originalIndex
-       };
+       return {};
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:696:66
-       const safeImageAvifPath = typeof product.image_avif_path === 'string' ? product.image_avif_path : '';
+       const safeImageAvifPath = typeof product.image_avif_path === "" ? product.image_avif_path : '';
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:696:103
-       const safeImageAvifPath = typeof product.image_avif_path === 'string' ? product.image_avif_path : '';
+       const safeImageAvifPath = typeof product.image_avif_path === 'string' ? product.image_avif_path : "Stryker was here!";
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:704:22
-           categoryKey: product.categoryKey || normalizeString(safeCategory),
+           categoryKey: product.categoryKey && normalizeString(safeCategory),
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:704:22
-           categoryKey: product.categoryKey || normalizeString(safeCategory),
+           categoryKey: false,
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:704:22
-           categoryKey: product.categoryKey || normalizeString(safeCategory),
+           categoryKey: true,
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] MethodExpression
src/js/script.mjs:711:46
-   const transformProducts = (products = []) => products
-       .map((product, index) => transformProduct(product, index))
-       .filter(Boolean);
+   const transformProducts = (products = []) => products.map((product, index) => transformProduct(product, index));
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:738:21
-           this.name = 'ProductDataError';
+           this.name = "";
Tests ran:
    fetchProducts non-OK response throws ProductDataError
    fetchProducts invalid JSON throws ProductDataError
    fetchProducts network failure throws ProductDataError
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:740:13
-           if (cause) this.cause = cause;
+           if (true) this.cause = cause;
Tests ran:
    fetchProducts non-OK response throws ProductDataError
    fetchProducts invalid JSON throws ProductDataError
    fetchProducts network failure throws ProductDataError
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:740:13
-           if (cause) this.cause = cause;
+           if (false) this.cause = cause;
Tests ran:
    fetchProducts non-OK response throws ProductDataError
    fetchProducts invalid JSON throws ProductDataError
    fetchProducts network failure throws ProductDataError
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:746:9
-       if (parsed.origin !== window.location.origin || parsed.protocol !== 'https:') {
+       if (false) {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] LogicalOperator
src/js/script.mjs:746:9
-       if (parsed.origin !== window.location.origin || parsed.protocol !== 'https:') {
+       if (parsed.origin !== window.location.origin && parsed.protocol !== 'https:') {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] ConditionalExpression
src/js/script.mjs:746:9
-       if (parsed.origin !== window.location.origin || parsed.protocol !== 'https:') {
+       if (false || parsed.protocol !== 'https:') {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] ArithmeticOperator
src/js/script.mjs:756:32
-               const durationMs = Date.now() - start;
+               const durationMs = Date.now() + start;
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 2 more tests!

[Survived] ConditionalExpression
src/js/script.mjs:746:53
-       if (parsed.origin !== window.location.origin || parsed.protocol !== 'https:') {
+       if (parsed.origin !== window.location.origin || false) {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] StringLiteral
src/js/script.mjs:757:17
-               log('info', 'fetch_products_attempt', { correlationId, attempt: attempt + 1, durationMs });
+               log("", 'fetch_products_attempt', { correlationId, attempt: attempt + 1, durationMs });
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 2 more tests!

[Survived] StringLiteral
src/js/script.mjs:757:25
-               log('info', 'fetch_products_attempt', { correlationId, attempt: attempt + 1, durationMs });
+               log('info', "", { correlationId, attempt: attempt + 1, durationMs });
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 2 more tests!

[Survived] EqualityOperator
src/js/script.mjs:752:12
-       while (attempt <= retries) {
+       while (attempt < retries) {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] ObjectLiteral
src/js/script.mjs:757:51
-               log('info', 'fetch_products_attempt', { correlationId, attempt: attempt + 1, durationMs });
+               log('info', 'fetch_products_attempt', {});
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 2 more tests!

[Survived] ArithmeticOperator
src/js/script.mjs:757:77
-               log('info', 'fetch_products_attempt', { correlationId, attempt: attempt + 1, durationMs });
+               log('info', 'fetch_products_attempt', { correlationId, attempt: attempt - 1, durationMs });
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 2 more tests!

[Survived] EqualityOperator
src/js/script.mjs:765:17
-               if (attempt > retries) break;
+               if (attempt >= retries) break;
Tests ran:
    fetchProducts non-OK response throws ProductDataError
    fetchProducts network failure throws ProductDataError
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:766:17
-               log('warn', 'fetch_products_retry', { correlationId, attempt, error: err.message, runbook: 'docs/operations/RUNBOOK.md#product-data' });
+               log("", 'fetch_products_retry', { correlationId, attempt, error: err.message, runbook: 'docs/operations/RUNBOOK.md#product-data' });
Tests ran:
    fetchProducts non-OK response throws ProductDataError
    fetchProducts network failure throws ProductDataError
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ArithmeticOperator
src/js/script.mjs:767:62
-               await new Promise(resolve => setTimeout(resolve, backoffMs * attempt));
+               await new Promise(resolve => setTimeout(resolve, backoffMs / attempt));
Tests ran:
    fetchProducts non-OK response throws ProductDataError
    fetchProducts network failure throws ProductDataError
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:766:25
-               log('warn', 'fetch_products_retry', { correlationId, attempt, error: err.message, runbook: 'docs/operations/RUNBOOK.md#product-data' });
+               log('warn', "", { correlationId, attempt, error: err.message, runbook: 'docs/operations/RUNBOOK.md#product-data' });
Tests ran:
    fetchProducts non-OK response throws ProductDataError
    fetchProducts network failure throws ProductDataError
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:766:49
-               log('warn', 'fetch_products_retry', { correlationId, attempt, error: err.message, runbook: 'docs/operations/RUNBOOK.md#product-data' });
+               log('warn', 'fetch_products_retry', {});
Tests ran:
    fetchProducts non-OK response throws ProductDataError
    fetchProducts network failure throws ProductDataError
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:766:104
-               log('warn', 'fetch_products_retry', { correlationId, attempt, error: err.message, runbook: 'docs/operations/RUNBOOK.md#product-data' });
+               log('warn', 'fetch_products_retry', { correlationId, attempt, error: err.message, runbook: "" });
Tests ran:
    fetchProducts non-OK response throws ProductDataError
    fetchProducts network failure throws ProductDataError
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:770:82
-       throw new ProductDataError(`Failed to fetch products: ${lastError.message}`, { cause: lastError, correlationId });
+       throw new ProductDataError(`Failed to fetch products: ${lastError.message}`, {});
Tests ran:
    fetchProducts non-OK response throws ProductDataError
    fetchProducts network failure throws ProductDataError
    fetchProducts uses inline dataset when available
