[Survived] ConditionalExpression
src/js/script.mjs:765:17
-               if (attempt > retries) break;
+               if (false) break;
Tests ran:
    fetchProducts non-OK response throws ProductDataError
    fetchProducts network failure throws ProductDataError
    fetchProducts retries then succeeds
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:778:27
-       const inlineVersion = inlineData?.version || null;
+       const inlineVersion = true;
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] BlockStatement
src/js/script.mjs:784:28
-       if (hasInlineProducts) {
-           if (inlineVersion) {
-               setStoredProductVersion(inlineVersion);
-           }
-           ensureSharedProductData(inlineProducts, {
-               version: inlineVersion || null,
-               source: 'inline',
-               isPartial: true,
-               total: inlineTotal ?? inlineProducts.length
-           });
-           log('info', 'fetch_products_inline_bootstrap', { correlationId, count: inlineProducts.length });
-       }
+       if (hasInlineProducts) {}
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:785:13
-           if (inlineVersion) {
+           if (true) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:779:25
-       const inlineTotal = typeof inlineData?.totalProducts === 'number' ? inlineData.totalProducts : null;
+       const inlineTotal = false ? inlineData.totalProducts : null;
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] ConditionalExpression
src/js/script.mjs:785:13
-           if (inlineVersion) {
+           if (false) {
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:779:62
-       const inlineTotal = typeof inlineData?.totalProducts === 'number' ? inlineData.totalProducts : null;
+       const inlineTotal = typeof inlineData?.totalProducts === "" ? inlineData.totalProducts : null;
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] BlockStatement
src/js/script.mjs:785:28
-           if (inlineVersion) {
-               setStoredProductVersion(inlineVersion);
-           }
+           if (inlineVersion) {}
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:789:22
-               version: inlineVersion || null,
+               version: true,
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ObjectLiteral
src/js/script.mjs:788:49
-           ensureSharedProductData(inlineProducts, {
-               version: inlineVersion || null,
-               source: 'inline',
-               isPartial: true,
-               total: inlineTotal ?? inlineProducts.length
-           });
+           ensureSharedProductData(inlineProducts, {});
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:789:22
-               version: inlineVersion || null,
+               version: false,
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:789:22
-               version: inlineVersion || null,
+               version: inlineVersion && null,
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:784:9
-       if (hasInlineProducts) {
+       if (false) {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] LogicalOperator
src/js/script.mjs:792:20
-               total: inlineTotal ?? inlineProducts.length
+               total: inlineTotal && inlineProducts.length
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:790:21
-               source: 'inline',
+               source: "",
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:794:13
-           log('info', 'fetch_products_inline_bootstrap', { correlationId, count: inlineProducts.length });
+           log("", 'fetch_products_inline_bootstrap', { correlationId, count: inlineProducts.length });
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:794:21
-           log('info', 'fetch_products_inline_bootstrap', { correlationId, count: inlineProducts.length });
+           log('info', "", { correlationId, count: inlineProducts.length });
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ObjectLiteral
src/js/script.mjs:794:56
-           log('info', 'fetch_products_inline_bootstrap', { correlationId, count: inlineProducts.length });
+           log('info', 'fetch_products_inline_bootstrap', {});
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:809:47
-           const transformed = transformProducts(data.products || []);
+           const transformed = transformProducts(data.products && []);
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] ObjectLiteral
src/js/script.mjs:810:49
-           overwriteSharedProductData(transformed, {
-               version: data.version || null,
-               source: 'network',
-               isPartial: false,
-               total: transformed.length
-           });
+           overwriteSharedProductData(transformed, {});
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] ConditionalExpression
src/js/script.mjs:811:22
-               version: data.version || null,
+               version: true,
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] LogicalOperator
src/js/script.mjs:811:22
-               version: data.version || null,
+               version: data.version && null,
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] ConditionalExpression
src/js/script.mjs:811:22
-               version: data.version || null,
+               version: false,
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] ObjectLiteral
src/js/script.mjs:803:13
-               { cache: 'no-store', headers: { 'Accept': 'application/json' } },
+               {},
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] StringLiteral
src/js/script.mjs:803:22
-               { cache: 'no-store', headers: { 'Accept': 'application/json' } },
+               { cache: "", headers: { 'Accept': 'application/json' } },
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] ObjectLiteral
src/js/script.mjs:803:43
-               { cache: 'no-store', headers: { 'Accept': 'application/json' } },
+               { cache: 'no-store', headers: {} },
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] StringLiteral
src/js/script.mjs:803:55
-               { cache: 'no-store', headers: { 'Accept': 'application/json' } },
+               { cache: 'no-store', headers: { 'Accept': "" } },
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts non-OK response throws ProductDataError
  and 4 more tests!

[Survived] StringLiteral
src/js/script.mjs:812:21
-               source: 'network',
+               source: "",
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] BooleanLiteral
src/js/script.mjs:813:24
-               isPartial: false,
+               isPartial: true,
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] ConditionalExpression
src/js/script.mjs:816:13
-           if (data.version) {
+           if (true) {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] ConditionalExpression
src/js/script.mjs:816:13
-           if (data.version) {
+           if (false) {
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] StringLiteral
src/js/script.mjs:819:13
-           log('info', 'fetch_products_success', { correlationId, count: transformed.length, source: 'network' });
+           log("", 'fetch_products_success', { correlationId, count: transformed.length, source: 'network' });
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] StringLiteral
src/js/script.mjs:819:21
-           log('info', 'fetch_products_success', { correlationId, count: transformed.length, source: 'network' });
+           log('info', "", { correlationId, count: transformed.length, source: 'network' });
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] ObjectLiteral
src/js/script.mjs:819:47
-           log('info', 'fetch_products_success', { correlationId, count: transformed.length, source: 'network' });
+           log('info', 'fetch_products_success', {});
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] StringLiteral
src/js/script.mjs:819:99
-           log('info', 'fetch_products_success', { correlationId, count: transformed.length, source: 'network' });
+           log('info', 'fetch_products_success', { correlationId, count: transformed.length, source: "" });
Tests ran:
    fetchProducts successful fetch without productDataVersion
    fetchProducts successful fetch with productDataVersion
    fetchProducts retries then succeeds

[Survived] ObjectLiteral
src/js/script.mjs:823:53
-               ensureSharedProductData(inlineProducts, {
-                   version: inlineVersion || null,
-                   source: 'inline-fallback',
-                   isPartial: true,
-                   total: inlineTotal ?? inlineProducts.length
-               });
+               ensureSharedProductData(inlineProducts, {});
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:824:26
-                   version: inlineVersion || null,
+                   version: true,
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:824:26
-                   version: inlineVersion || null,
+                   version: false,
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] BooleanLiteral
src/js/script.mjs:826:28
-                   isPartial: true,
+                   isPartial: false,
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:827:24
-                   total: inlineTotal ?? inlineProducts.length
+                   total: inlineTotal && inlineProducts.length
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] LogicalOperator
src/js/script.mjs:824:26
-                   version: inlineVersion || null,
+                   version: inlineVersion && null,
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] StringLiteral
src/js/script.mjs:825:25
-                   source: 'inline-fallback',
+                   source: "",
Tests ran:
    fetchProducts uses inline dataset when available

[Survived] ConditionalExpression
src/js/script.mjs:1023:9
-       if (!cartItems || !cartTotal) return;
+       if (false) return;
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] LogicalOperator
src/js/script.mjs:1023:9
-       if (!cartItems || !cartTotal) return;
+       if (!cartItems && !cartTotal) return;
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ArithmeticOperator
src/js/script.mjs:1029:33
-           const discountedPrice = item.price - (item.discount || 0);
+           const discountedPrice = item.price + (item.discount || 0);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1025:27
-       cartItems.innerHTML = '';
+       cartItems.innerHTML = "Stryker was here!";
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1029:47
-           const discountedPrice = item.price - (item.discount || 0);
+           const discountedPrice = item.price - (false);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1033:27
-               'aria-label': `Cart item: ${item.name}`
+               'aria-label': ``
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:1036:59
-           const contentContainer = createSafeElement('div', {
-               class: 'cart-item-content flex-grow-1'
-           });
+           const contentContainer = createSafeElement('div', {});
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1037:20
-               class: 'cart-item-content flex-grow-1'
+               class: ""
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:1041:38
-               createSafeElement('div', { class: 'fw-bold mb-1' }, [item.name])
+               createSafeElement('div', {}, [item.name])
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1041:47
-               createSafeElement('div', { class: 'fw-bold mb-1' }, [item.name])
+               createSafeElement('div', { class: "" }, [item.name])
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ArrayDeclaration
src/js/script.mjs:1041:65
-               createSafeElement('div', { class: 'fw-bold mb-1' }, [item.name])
+               createSafeElement('div', { class: 'fw-bold mb-1' }, [])
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:1044:60
-           const quantityContainer = createSafeElement('div', { class: 'mb-2' });
+           const quantityContainer = createSafeElement('div', {});
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1044:69
-           const quantityContainer = createSafeElement('div', { class: 'mb-2' });
+           const quantityContainer = createSafeElement('div', { class: "" });
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:1045:57
-           const decreaseBtn = createSafeElement('button', {
-               class: 'btn btn-sm btn-secondary decrease-quantity',
-               'data-id': item.id,
-               'aria-label': `Disminuir cantidad de ${item.name}`
-           }, ['-']);
+           const decreaseBtn = createSafeElement('button', {}, ['-']);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1046:20
-               class: 'btn btn-sm btn-secondary decrease-quantity',
+               class: "",
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1048:27
-               'aria-label': `Disminuir cantidad de ${item.name}`
+               'aria-label': ``
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ArrayDeclaration
src/js/script.mjs:1049:12
-           }, ['-']);
+           }, []);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1049:13
-           }, ['-']);
+           }, [""]);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:1050:57
-           const increaseBtn = createSafeElement('button', {
-               class: 'btn btn-sm btn-secondary increase-quantity',
-               'data-id': item.id,
-               'aria-label': `Aumentar cantidad de ${item.name}`
-           }, ['+']);
+           const increaseBtn = createSafeElement('button', {}, ['+']);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1051:20
-               class: 'btn btn-sm btn-secondary increase-quantity',
+               class: "",
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1053:27
-               'aria-label': `Aumentar cantidad de ${item.name}`
+               'aria-label': ``
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ArrayDeclaration
src/js/script.mjs:1054:12
-           }, ['+']);
+           }, []);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1054:13
-           }, ['+']);
+           }, [""]);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1057:27
-               'aria-label': `Cantidad de ${item.name}`
+               'aria-label': ``
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:1065:38
-               createSafeElement('div', { class: 'text-muted small' },
+               createSafeElement('div', {},
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1065:47
-               createSafeElement('div', { class: 'text-muted small' },
+               createSafeElement('div', { class: "" },
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ArrayDeclaration
src/js/script.mjs:1066:17
-                   [`Precio: $${discountedPrice.toLocaleString('es-CL')}`]
+                   []
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1066:18
-                   [`Precio: $${discountedPrice.toLocaleString('es-CL')}`]
+                   [``]
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:1070:38
-               createSafeElement('div', { class: 'fw-bold' },
+               createSafeElement('div', {},
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1070:47
-               createSafeElement('div', { class: 'fw-bold' },
+               createSafeElement('div', { class: "" },
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ArithmeticOperator
src/js/script.mjs:1071:33
-                   [`Subtotal: $${(discountedPrice * item.quantity).toLocaleString('es-CL')}`]
+                   [`Subtotal: $${(discountedPrice / item.quantity).toLocaleString('es-CL')}`]
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ArrayDeclaration
src/js/script.mjs:1071:17
-                   [`Subtotal: $${(discountedPrice * item.quantity).toLocaleString('es-CL')}`]
+                   []
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1071:18
-                   [`Subtotal: $${(discountedPrice * item.quantity).toLocaleString('es-CL')}`]
+                   [``]
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:1075:55
-           const removeBtn = createSafeElement('button', {
-               class: 'btn btn-sm btn-danger remove-item mt-2',
-               'data-id': item.id,
-               'aria-label': `Eliminar ${item.name} del carrito`
-           }, ['Eliminar']);
+           const removeBtn = createSafeElement('button', {}, ['Eliminar']);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1076:20
-               class: 'btn btn-sm btn-danger remove-item mt-2',
+               class: "",
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1078:27
-               'aria-label': `Eliminar ${item.name} del carrito`
+               'aria-label': ``
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ArrayDeclaration
src/js/script.mjs:1079:12
-           }, ['Eliminar']);
+           }, []);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1079:13
-           }, ['Eliminar']);
+           }, [""]);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] LogicalOperator
src/js/script.mjs:1082:35
-           const isSubcategoryPage = typeof window !== 'undefined' && window.location.pathname.includes('/pages/');
+           const isSubcategoryPage = typeof window !== 'undefined' || window.location.pathname.includes('/pages/');
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1082:35
-           const isSubcategoryPage = typeof window !== 'undefined' && window.location.pathname.includes('/pages/');
+           const isSubcategoryPage = true && window.location.pathname.includes('/pages/');
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1082:35
-           const isSubcategoryPage = typeof window !== 'undefined' && window.location.pathname.includes('/pages/');
+           const isSubcategoryPage = false;
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!
