[Survived] ConditionalExpression
src/js/script.mjs:1082:35
-           const isSubcategoryPage = typeof window !== 'undefined' && window.location.pathname.includes('/pages/');
+           const isSubcategoryPage = true;
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1082:53
-           const isSubcategoryPage = typeof window !== 'undefined' && window.location.pathname.includes('/pages/');
+           const isSubcategoryPage = typeof window !== "" && window.location.pathname.includes('/pages/');
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] EqualityOperator
src/js/script.mjs:1082:35
-           const isSubcategoryPage = typeof window !== 'undefined' && window.location.pathname.includes('/pages/');
+           const isSubcategoryPage = typeof window === 'undefined' && window.location.pathname.includes('/pages/');
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1082:102
-           const isSubcategoryPage = typeof window !== 'undefined' && window.location.pathname.includes('/pages/');
+           const isSubcategoryPage = typeof window !== 'undefined' && window.location.pathname.includes("");
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1084:13
-           if (isSubcategoryPage) {
+           if (true) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1084:13
-           if (isSubcategoryPage) {
+           if (false) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BlockStatement
src/js/script.mjs:1086:16
-           } else {
-               adjustedImagePath = item.image_path;
-           }
+           } else {}
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:1090:61
-           const thumbnailContainer = createSafeElement('div', {
-               class: 'cart-item-thumb ms-3 flex-shrink-0'
-           });
+           const thumbnailContainer = createSafeElement('div', {});
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1091:20
-               class: 'cart-item-thumb ms-3 flex-shrink-0'
+               class: ""
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ObjectLiteral
src/js/script.mjs:1093:54
-           const thumbnailPicture = createCartThumbnail({
-               imagePath: item.thumbnail_path || adjustedImagePath,
-               avifPath: item.image_avif_path,
-               alt: item.name
-           });
+           const thumbnailPicture = createCartThumbnail({});
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1094:24
-               imagePath: item.thumbnail_path || adjustedImagePath,
+               imagePath: false,
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] LogicalOperator
src/js/script.mjs:1094:24
-               imagePath: item.thumbnail_path || adjustedImagePath,
+               imagePath: item.thumbnail_path && adjustedImagePath,
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1099:13
-           if (fallbackImg) {
+           if (true) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BlockStatement
src/js/script.mjs:1099:26
-           if (fallbackImg) {
-               if (!fallbackImg.getAttribute('src') && adjustedImagePath) {
-                   fallbackImg.setAttribute('src', adjustedImagePath);
-               }
-               if (Array.isArray(item.thumbnail_variants)) {
-                   const parts = item.thumbnail_variants
-                       .filter(v => v && v.url && v.width)
-                       .map(v => `${v.url} ${v.width}w`);
-                   if (parts.length) {
-                       fallbackImg.setAttribute('srcset', parts.join(', '));
-                       fallbackImg.setAttribute('sizes', '100px');
-                   }
-               } else if (!fallbackImg.getAttribute('sizes')) {
-                   fallbackImg.setAttribute('sizes', '100px');
-               }
-           }
+           if (fallbackImg) {}
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1099:13
-           if (fallbackImg) {
+           if (false) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1100:17
-               if (!fallbackImg.getAttribute('src') && adjustedImagePath) {
+               if (true) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1100:17
-               if (!fallbackImg.getAttribute('src') && adjustedImagePath) {
+               if (false) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] LogicalOperator
src/js/script.mjs:1100:17
-               if (!fallbackImg.getAttribute('src') && adjustedImagePath) {
+               if (!fallbackImg.getAttribute('src') || adjustedImagePath) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BooleanLiteral
src/js/script.mjs:1100:17
-               if (!fallbackImg.getAttribute('src') && adjustedImagePath) {
+               if (fallbackImg.getAttribute('src') && adjustedImagePath) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1100:43
-               if (!fallbackImg.getAttribute('src') && adjustedImagePath) {
+               if (!fallbackImg.getAttribute("") && adjustedImagePath) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1103:17
-               if (Array.isArray(item.thumbnail_variants)) {
+               if (false) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] BooleanLiteral
src/js/script.mjs:1111:24
-               } else if (!fallbackImg.getAttribute('sizes')) {
+               } else if (fallbackImg.getAttribute('sizes')) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1111:24
-               } else if (!fallbackImg.getAttribute('sizes')) {
+               } else if (true) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1111:24
-               } else if (!fallbackImg.getAttribute('sizes')) {
+               } else if (false) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1111:50
-               } else if (!fallbackImg.getAttribute('sizes')) {
+               } else if (!fallbackImg.getAttribute("")) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] AssignmentOperator
src/js/script.mjs:1121:9
-           total += discountedPrice * item.quantity;
+           total -= discountedPrice * item.quantity;
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1125:42
-       cartTotal.setAttribute('aria-label', `Total: $${total.toLocaleString('es-CL')}`);
+       cartTotal.setAttribute('aria-label', ``);
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1127:50
-       const creditOption = document.getElementById('payment-credit-container');
+       const creditOption = document.getElementById("");
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1128:9
-       if (creditOption) {
+       if (false) {
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1163:19
-           try { if (typeof window !== 'undefined' && typeof window.__analyticsTrack === 'function') window.__analyticsTrack('add_to_cart', { id: product.id, q: quantity, price: product.price }); } catch { }
+           try { if (true) window.__analyticsTrack('add_to_cart', { id: product.id, q: quantity, price: product.price }); } catch { }
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] LogicalOperator
src/js/script.mjs:1163:19
-           try { if (typeof window !== 'undefined' && typeof window.__analyticsTrack === 'function') window.__analyticsTrack('add_to_cart', { id: product.id, q: quantity, price: product.price }); } catch { }
+           try { if (typeof window !== 'undefined' || typeof window.__analyticsTrack === 'function') window.__analyticsTrack('add_to_cart', { id: product.id, q: quantity, price: product.price }); } catch { }
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] StringLiteral
src/js/script.mjs:1163:37
-           try { if (typeof window !== 'undefined' && typeof window.__analyticsTrack === 'function') window.__analyticsTrack('add_to_cart', { id: product.id, q: quantity, price: product.price }); } catch { }
+           try { if (typeof window !== "" && typeof window.__analyticsTrack === 'function') window.__analyticsTrack('add_to_cart', { id: product.id, q: quantity, price: product.price }); } catch { }
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1163:52
-           try { if (typeof window !== 'undefined' && typeof window.__analyticsTrack === 'function') window.__analyticsTrack('add_to_cart', { id: product.id, q: quantity, price: product.price }); } catch { }
+           try { if (typeof window !== 'undefined' && true) window.__analyticsTrack('add_to_cart', { id: product.id, q: quantity, price: product.price }); } catch { }
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:1163:19
-           try { if (typeof window !== 'undefined' && typeof window.__analyticsTrack === 'function') window.__analyticsTrack('add_to_cart', { id: product.id, q: quantity, price: product.price }); } catch { }
+           try { if (true && typeof window.__analyticsTrack === 'function') window.__analyticsTrack('add_to_cart', { id: product.id, q: quantity, price: product.price }); } catch { }
Tests ran:
    Cart Helpers items accumulate with quantity caps
    Cart Helpers removing or decreasing quantity updates state and DOM
    Cart Helpers updateCartIcon reflects total items
  and 1 more test!

[Survived] ConditionalExpression
src/js/script.mjs:2100:5
-   if (typeof document !== 'undefined') {
+   if (true) {
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/js/script.mjs:2100:5
-   if (typeof document !== 'undefined') {
+   if (false) {
Ran all tests for this mutant.

[Survived] EqualityOperator
src/js/script.mjs:2100:5
-   if (typeof document !== 'undefined') {
+   if (typeof document === 'undefined') {
Ran all tests for this mutant.

[Survived] StringLiteral
src/js/script.mjs:2100:25
-   if (typeof document !== 'undefined') {
+   if (typeof document !== "") {
Ran all tests for this mutant.

[Survived] BlockStatement
src/js/script.mjs:2100:38
-   if (typeof document !== 'undefined') {
-       document.addEventListener('DOMContentLoaded', function () {
-           // Register service worker first
-           registerServiceWorker();
-   
-           // Then initialize the app
-           initApp().catch(error => {
-               console.error('Error al inicializar la aplicación:', error);
-               showErrorMessage('Error al inicializar la aplicación. Por favor, actualice la página.');
-           });
-       });
-   }
+   if (typeof document !== 'undefined') {}
Ran all tests for this mutant.

[Survived] StringLiteral
src/js/script.mjs:2101:31
-       document.addEventListener('DOMContentLoaded', function () {
+       document.addEventListener("", function () {
Ran all tests for this mutant.
